000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID.   C6SP01AX.
000003 ENVIRONMENT DIVISION.
000004 CONFIGURATION SECTION.
000005 SOURCE-COMPUTER. IBM-370.
000006 OBJECT-COMPUTER. IBM-370.
000007 SPECIAL-NAMES.
000008     DECIMAL-POINT IS COMMA.
000009 DATA DIVISION.
000010 WORKING-STORAGE SECTION.
000011 77  PIC918                       PIC S9(18).
000012 77  PIC9V1SO REDEFINES PIC918    PIC S9(17)V9(1).
000013 77  PIC9V2SO REDEFINES PIC918    PIC S9(16)V9(2).
000014 77  PIC9V3SO REDEFINES PIC918    PIC S9(15)V9(3).
000015 77  PIC9V4SO REDEFINES PIC918    PIC S9(14)V9(4).
000016 77  PIC9V5SO REDEFINES PIC918    PIC S9(13)V9(5).
000017 77  PIC9V6SO REDEFINES PIC918    PIC S9(12)V9(6).
000018*
000019 77  PIC918S                      PIC S9(18).
000020 77  PIC9V1SS REDEFINES PIC918S   PIC S9(17)V9(1).
000021 77  PIC9V2SS REDEFINES PIC918S   PIC S9(16)V9(2).
000022 77  PIC9V3SS REDEFINES PIC918S   PIC S9(15)V9(3).
000023 77  PIC9V4SS REDEFINES PIC918S   PIC S9(14)V9(4).
000024 77  PIC9V5SS REDEFINES PIC918S   PIC S9(13)V9(5).
000025 77  PIC9V6SS REDEFINES PIC918S   PIC S9(12)V9(6).
000026*
000027 77  PIC918F                      PIC S9(18).
000028 77  PIC9V1FI REDEFINES PIC918F   PIC S9(17)V9(1).
000029 77  PIC9V2FI REDEFINES PIC918F   PIC S9(16)V9(2).
000030 77  PIC9V3FI REDEFINES PIC918F   PIC S9(15)V9(3).
000031 77  PIC9V4FI REDEFINES PIC918F   PIC S9(14)V9(4).
000032 77  PIC9V5FI REDEFINES PIC918F   PIC S9(13)V9(5).
000033 77  PIC9V6FI REDEFINES PIC918F   PIC S9(12)V9(6).
000034*
000035 01  WS-GEN-PGMNOME  PIC X(8) VALUE 'C6SP01AX'.
000036 01  WS-MESSAGGIO    PIC X(80).
000037 01  DYNACALL        PIC X(8).
000038*
000039 01  WS-DAO-CDCAMPO  PIC X(15).
000040 01  WS-DAO-NRLEN    PIC S9(05) COMP-3.
000041 01  WS-DAO-NRIND    PIC S9(05) COMP-3.
000042*
000043 01  WS-IND-MAX      PIC 9(08) VALUE ZERO.
000044 01  WS-IND-RIP      PIC 9(09).
000045*
000046 01  WS-CDSERINT     PIC 9(09).
000047 01  WS-CDOGGETT     PIC 9(09).
000048 01  WS-DTINIZIO-OLD PIC X(10).
000049 01  WS-DTINIZIO-APP PIC X(10).
000050 01  WS-DTINIZIO-DB2 PIC X(10).
000051 01  WS-DTFINE-DB2   PIC X(10).
000052 01  WS-CDAPPLIV     PIC X(01).
000053*
000054 01  WS-UTDATA-DATA-1-DB2  PIC X(10).
000055 01  WS-UTDATA-DATA-2-DB2  PIC X(10).
000056*
000057* TABELLA APPOGGIO LEGAMI A CONVENZIONE
000058 01  WVA-IND          PIC 9(08) VALUE ZERO.
000059 01  WVA-INDM         PIC 9(08) VALUE ZERO.
000060 01  WVA-IND-MAX      PIC 9(08) VALUE ZERO.
000061 01  WVA-TAB-CVOG-APPO.
000062   05 WVA-EL-CVOG-APPO    OCCURS 150.
000063     10 WVA-CDCNV-CVOG    PIC 9(09).
000064     10 WVA-DTINIZIO-CVOG PIC X(10).
000065     10 WVA-DTFINE-CVOG   PIC X(10).
000066*
000067* TABELLA APPOGGIO DATE
000068 01  WD-IND           PIC 9(08) VALUE ZERO.
000069 01  WD-IND2          PIC 9(08) VALUE ZERO.
000070 01  WD-IND-POS       PIC 9(08) VALUE ZERO.
000071 01  WD-INDM          PIC 9(08) VALUE ZERO.
000072 01  WD-IND-MAX       PIC 9(08) VALUE ZERO.
000073 01  WD-TAB-DATE.
000074    05 WD-EL-DATE     OCCURS 1000.
000075      10 WD-DTINIZIO  PIC X(10).
000076      10 WD-DTFINE    PIC X(10).
000077 01  WD-SNDATE        PIC X(01).
000078     88 WD-SIDATE     VALUE 'S'.
000079*
000080* TABELLA DI COMODO VALORI DI OUTPUT
000081 01  WS-DTINIZIO-VALO PIC X(10).
000082 01  WS-DTFINE-VALO   PIC X(10).
000083 01  WS-CDVALALF-VALO PIC X(15).
000084 01  WS-CDVALNUM-VALO PIC S9(18).
000085 01  WS-CDINDICE-VALO PIC X(05).
000086 01  WS-CDAPPLIV-VALO PIC X(01).
000087 01  WS-CDVALNUM-INDI PIC S9(18).
000088 01  WS-NRDECIM-INDI  PIC 9(03).
000089 01  WS-NRFINITO-VALO PIC S9(18).
000090*
000091 01  WA-DTINIZIO     PIC X(10).
000092 01  WA-DTFINE       PIC X(10).
000093 01  WA-NRPRREGO     PIC 9(03).
000094*
000095 01  WAPP-CDZCMP.
000096   10 WA-NRPRELEM    PIC 9(03).
000097   10 WA-IDCDZ       PIC 9(09).
000098   10 WA-DSCDZBR     PIC X(15).
000099   10 WA-NRPRIOR     PIC 9(04).
000100   10 WA-IDCOMP      PIC 9(09).
000101   10 WA-DSLEGBR     PIC X(15).
000102   10 WA-CDNATCDZ    PIC X(01).
000103   10 WA-CDTPFORM    PIC X(01).
000104   10 WA-NRDECIM     PIC 9(02).
000105   10 WA-NRDIMENS    PIC 9(02).
000106   10 WA-CDSPREAD    PIC X(01).
000107   10 WA-CDCALCSPR   PIC X(01).
000108   10 WA-CDESTREM    PIC X(01).
000109   10 WA-SNSUPSTD    PIC X(01).
000110   10 WA-CDTPCAR     PIC X(01).
000111*
000112* TABELLA DI COMODO QUALIFICATORI CON RISALITA
000113 01  WQ-IND          PIC 9(08) VALUE ZERO.
000114 01  WQ-INDM         PIC 9(08) VALUE ZERO.
000115 01  WQ-IND-MAX      PIC 9(08) VALUE ZERO.
000116 01  WQ-TAB-QUALIF.
000117   05  WQ-IDQUALIF1  PIC S9(09) COMP.
000118   05  WQ-IDQUALIF2  PIC S9(09) COMP.
000119   05  WQ-IDQUALIF3  PIC S9(09) COMP.
000120   05  WQ-IDQUALIF4  PIC S9(09) COMP.
000121   05  WQ-IDQUALIF5  PIC S9(09) COMP.
000122   05  WQ-IDQUALIF6  PIC S9(09) COMP.
000123   05  WQ-IDQUALIF7  PIC S9(09) COMP.
000124   05  WQ-IDQUALIF8  PIC S9(09) COMP.
000125   05  WQ-IDQUALIF9  PIC S9(09) COMP.
000126   05  WQ-IDQUALIF10 PIC S9(09) COMP.
000127   05  WQ-IDQUALIF11 PIC S9(09) COMP.
000128   05  WQ-IDQUALIF12 PIC S9(09) COMP.
000129   05  WQ-IDQUALIF13 PIC S9(09) COMP.
000130   05  WQ-IDQUALIF14 PIC S9(09) COMP.
000131   05  WQ-IDQUALIF15 PIC S9(09) COMP.
000132   05  WQ-IDQUALIF16 PIC S9(09) COMP.
000133   05  WQ-IDQUALIF17 PIC S9(09) COMP.
000134   05  WQ-IDQUALIF18 PIC S9(09) COMP.
000135   05  WQ-IDQUALIF19 PIC S9(09) COMP.
000136   05  WQ-IDQUALIF20 PIC S9(09) COMP.
000137   05  WQ-IDQUALIF21 PIC S9(09) COMP.
000138   05  WQ-IDQUALIF22 PIC S9(09) COMP.
000139   05  WQ-IDQUALIF23 PIC S9(09) COMP.
000140   05  WQ-IDQUALIF24 PIC S9(09) COMP.
000141   05  WQ-IDQUALIF25 PIC S9(09) COMP.
000142   05  WQ-IDQUALIF26 PIC S9(09) COMP.
000143   05  WQ-IDQUALIF27 PIC S9(09) COMP.
000144   05  WQ-IDQUALIF28 PIC S9(09) COMP.
000145   05  WQ-IDQUALIF29 PIC S9(09) COMP.
000146   05  WQ-IDQUALIF30 PIC S9(09) COMP.
000147   05  WQ-IDQUALIF31 PIC S9(09) COMP.
000148   05  WQ-IDQUALIF32 PIC S9(09) COMP.
000149   05  WQ-IDQUALIF33 PIC S9(09) COMP.
000150   05  WQ-IDQUALIF34 PIC S9(09) COMP.
000151   05  WQ-IDQUALIF35 PIC S9(09) COMP.
000152   05  WQ-IDQUALIF36 PIC S9(09) COMP.
000153   05  WQ-IDQUALIF37 PIC S9(09) COMP.
000154   05  WQ-IDQUALIF38 PIC S9(09) COMP.
000155   05  WQ-IDQUALIF39 PIC S9(09) COMP.
000156   05  WQ-IDQUALIF40 PIC S9(09) COMP.
000157   05  WQ-IDQUALIF41 PIC S9(09) COMP.
000158   05  WQ-IDQUALIF42 PIC S9(09) COMP.
000159   05  WQ-IDQUALIF43 PIC S9(09) COMP.
000160   05  WQ-IDQUALIF44 PIC S9(09) COMP.
000161   05  WQ-IDQUALIF45 PIC S9(09) COMP.
000162   05  WQ-IDQUALIF46 PIC S9(09) COMP.
000163   05  WQ-IDQUALIF47 PIC S9(09) COMP.
000164   05  WQ-IDQUALIF48 PIC S9(09) COMP.
000165   05  WQ-IDQUALIF49 PIC S9(09) COMP.
000166   05  WQ-IDQUALIF50 PIC S9(09) COMP.
000167 01  WQ-TAB-CRQL.
000168   05  WQ-CDTPQUA1   PIC S9(04) COMP.
000169   05  WQ-CDVLPRQL1  PIC S9(09) COMP.
000170   05  WQ-CDTPQUA2   PIC S9(04) COMP.
000171   05  WQ-CDVLPRQL2  PIC S9(09) COMP.
000172   05  WQ-CDTPQUA3   PIC S9(04) COMP.
000173   05  WQ-CDVLPRQL3  PIC S9(09) COMP.
000174   05  WQ-CDTPQUA4   PIC S9(04) COMP.
000175   05  WQ-CDVLPRQL4  PIC S9(09) COMP.
000176   05  WQ-CDTPQUA5   PIC S9(04) COMP.
000177   05  WQ-CDVLPRQL5  PIC S9(09) COMP.
000178   05  WQ-CDTPQUA6   PIC S9(04) COMP.
000179   05  WQ-CDVLPRQL6  PIC S9(09) COMP.
000180   05  WQ-CDTPQUA7   PIC S9(04) COMP.
000181   05  WQ-CDVLPRQL7  PIC S9(09) COMP.
000182   05  WQ-CDTPQUA8   PIC S9(04) COMP.
000183   05  WQ-CDVLPRQL8  PIC S9(09) COMP.
000184   05  WQ-CDTPQUA9   PIC S9(04) COMP.
000185   05  WQ-CDVLPRQL9  PIC S9(09) COMP.
000186   05  WQ-CDTPQUA10  PIC S9(04) COMP.
000187   05  WQ-CDVLPRQL10 PIC S9(09) COMP.
000188*
000189* TABELLA DI COMODO LISTINI CON RISALITA
000190 01  WL-IND              PIC 9(08) VALUE ZERO.
000191 01  WL-INDM             PIC 9(08) VALUE ZERO.
000192 01  WL-IND-MAX          PIC 9(08) VALUE ZERO.
000193 01  WL-INDR             PIC 9(08) VALUE ZERO.
000194 01  WL-INDR-MAX         PIC 9(08) VALUE ZERO.
000195 01  WL-TAB-LISTIN.
000196   05 WL-EL-LISTIN       OCCURS 10.
000197     10 WL-CDCOMB        OCCURS 10 PIC 9(09).
000198     10 WL-DTINIZIO-LCOG PIC X(10).
000199     10 WL-DTFINE-LCOG   PIC X(10).
000200 01  WL-CDCOMB1      PIC S9(09) COMP.
000201 01  WL-CDCOMB2      PIC S9(09) COMP.
000202 01  WL-CDCOMB3      PIC S9(09) COMP.
000203 01  WL-CDCOMB4      PIC S9(09) COMP.
000204 01  WL-CDCOMB5      PIC S9(09) COMP.
000205 01  WL-CDCOMB6      PIC S9(09) COMP.
000206 01  WL-CDCOMB7      PIC S9(09) COMP.
000207 01  WL-CDCOMB8      PIC S9(09) COMP.
000208 01  WL-CDCOMB9      PIC S9(09) COMP.
000209 01  WL-CDCOMB10     PIC S9(09) COMP.
000210 01  WL-TAB-CRTZ.
000211   05  WL-CDTPGRP1   PIC S9(04) COMP.
000212   05  WL-CDGRP1     PIC S9(09) COMP.
000213   05  WL-CDTPGRP2   PIC S9(04) COMP.
000214   05  WL-CDGRP2     PIC S9(09) COMP.
000215   05  WL-CDTPGRP3   PIC S9(04) COMP.
000216   05  WL-CDGRP3     PIC S9(09) COMP.
000217   05  WL-CDTPGRP4   PIC S9(04) COMP.
000218   05  WL-CDGRP4     PIC S9(09) COMP.
000219   05  WL-CDTPGRP5   PIC S9(04) COMP.
000220   05  WL-CDGRP5     PIC S9(09) COMP.
000221*
000222* TABELLA DI COMODO CONVENZIONI
000223 01  WV-IND          PIC 9(08) VALUE ZERO.
000224*01  WV-INDM         PIC 9(08) VALUE ZERO.
000225 01  WV-INDDM        PIC 9(08) VALUE ZERO.
000226 01  WV-INDCM        PIC 9(08) VALUE ZERO.
000227*01  WV-IND-MAX      PIC 9(08) VALUE ZERO.
000228 01  WV-INDD-MAX     PIC 9(08) VALUE ZERO.
000229 01  WV-INDC-MAX     PIC 9(08) VALUE ZERO.
000230 01  WV-TAB-CONVEN.
000231*  05 WV-EL-CONVEN       OCCURS 10.
000232   05 WV-EL-CONVEN       OCCURS 50.
000233     10 WV-CDCNV         OCCURS 10 PIC 9(09).
000234     10 WV-DTINIZIO-CVOG PIC X(10).
000235     10 WV-DTFINE-CVOG   PIC X(10).
000236*
000237* TABELLA DI COMODO CONDIZIONI-COMPONENTI
000238 01  WC-IND          PIC 9(08) VALUE ZERO.
000239 01  WC-INDM         PIC 9(08) VALUE ZERO.
000240 01  WC-IND-MAX      PIC 9(08) VALUE ZERO.
000241 01  WC-TAB-CDZCMP.
000242   05  WC-EL-CDZCMP  OCCURS 100.
000243     10 WC-NRPRELEM  PIC 9(03).
000244     10 WC-IDCDZ     PIC 9(09).
000245     10 WC-DSCDZBR   PIC X(15).
000246     10 WC-NRPRCOMP  PIC 9(04).
000247     10 WC-IDCOMP    PIC 9(09).
000248     10 WC-DSLEGBR   PIC X(15).
000249     10 WC-CDNATCDZ  PIC X(01).
000250     10 WC-CDTPFORM  PIC X(01).
000251     10 WC-NRDECIM   PIC 9(02).
000252     10 WC-NRDIMENS  PIC 9(02).
000253     10 WC-CDSPREAD  PIC X(01).
000254     10 WC-CDCALCSPR PIC X(01).
000255     10 WC-CDESTREM  PIC X(01).
000256     10 WC-SNSUPSTD  PIC X(01).
000257     10 WC-CDTPCAR   PIC X(01).
000258*
000259* TABELLA PER CARICO BUCHI
000260 01 WB-IND                               PIC 9(08) VALUE ZERO.
000261 01 WB-INDM                              PIC 9(08) VALUE ZERO.
000262 01 WB-IND-MAX                           PIC 9(08) VALUE ZERO.
000263 01 WB-TB-DATE.
000264    02 WB-DATE OCCURS 300.
000265       05 WB-CDINDICE                    PIC X(05).
000266       05 WB-NRDECIM-INDI                PIC 9(03).
000267       05 WB-CDVALNUM-INDI               PIC S9(18).
000268       05 WB-DTINIZIO                    PIC X(10).
000269       05 WB-DTFINE                      PIC X(10).
000270*
000271* TABELLA PER CARICO DECORRENZE SPREAD
000272 01 W-INDS-CONTATORE                     PIC 9(08) VALUE ZERO.
000273 01 W-INDS-CONTATORE-TOT                 PIC S9(08) VALUE ZERO.
000274 01 W-INDS-DA-APP                        PIC 9(08) VALUE ZERO.
000275 01 W-INDS-A-APP                         PIC 9(08) VALUE ZERO.
000276 01 W-INDS-D-APP                         PIC 9(08) VALUE ZERO.
000277 01 W-INDS                               PIC 9(08) VALUE ZERO.
000278 01 W-INDS2                              PIC 9(08) VALUE ZERO.
000279 01 W-INDSM                              PIC 9(08) VALUE ZERO.
000280 01 W-INDS-MAX                           PIC 9(08) VALUE ZERO.
000281 01 W-INDS2-MAX                          PIC 9(08) VALUE ZERO.
000282 01 W-TB-SPREAD.
000283    02 W-SPREAD OCCURS 10.
000284       05 W-INDS-DA                      PIC 9(08).
000285       05 W-INDS-A                       PIC 9(08).
000286       05 W-INDS2M                       PIC 9(08).
000287       05 W-DECOR-S OCCURS 50.
000288         10 W-DTINIZIO-S                 PIC 9(08).
000289         10 W-DTFINE-S                   PIC 9(08).
000290         10 W-CDVALNUM-S                 PIC S9(18).
000291*
000292* TABELLA PER CARICO DECORRENZE CAP
000293 01 W-INDC-DA                            PIC 9(08) VALUE ZERO.
000294 01 W-INDC-A                             PIC 9(08) VALUE ZERO.
000295 01 W-INDC                               PIC 9(08) VALUE ZERO.
000296 01 W-INDCM                              PIC 9(08) VALUE ZERO.
000297 01 W-INDC-MAX                           PIC 9(08) VALUE ZERO.
000298 01 W-TB-CAP.
000299    02 W-CAP OCCURS 50.
000300       05 W-DTINIZIO-C                   PIC 9(08).
000301       05 W-DTFINE-C                     PIC 9(08).
000302       05 W-CDVALNUM-C                   PIC S9(18).
000303*
000304* TABELLA PER CARICO DECORRENZE CAP
000305 01 W-INDF-DA                            PIC 9(08) VALUE ZERO.
000306 01 W-INDF-A                             PIC 9(08) VALUE ZERO.
000307 01 W-INDF                               PIC 9(08) VALUE ZERO.
000308 01 W-INDFM                              PIC 9(08) VALUE ZERO.
000309 01 W-INDF-MAX                           PIC 9(08) VALUE ZERO.
000310 01 W-TB-FLO.
000311    02 W-FLO OCCURS 50.
000312       05 W-DTINIZIO-F                   PIC 9(08).
000313       05 W-DTFINE-F                     PIC 9(08).
000314       05 W-CDVALNUM-F                   PIC S9(18).
000315*
000316* TABELLA APPOGGIO PER CARICO VALORI
000317 01 WP-IND-MAX                           PIC 9(08) VALUE ZERO.
000318 01 WP-INDM                              PIC 9(08) VALUE ZERO.
000319 01 WP-IND                               PIC 9(08) VALUE ZERO.
000320 01 WP-TB-VALO.
000321    02 WP-VALO OCCURS 300.
000322       05 WP-DTINIZIO                    PIC X(10).
000323       05 WP-DTFINE                      PIC X(10).
000324       05 WP-CDVALALF                    PIC X(15).
000325       05 WP-CDVALNUM                    PIC S9(18).
000326       05 WP-CDINDICE                    PIC X(05).
000327       05 WP-CDAPPLIV                    PIC X(01).
000328 01 WO-INDM                              PIC 9(08) VALUE ZERO.
000329 01 WO-IND                               PIC 9(08) VALUE ZERO.
000330 01 WO-TB-VALO.
000331    02 WO-VALO OCCURS 300.
000332       05 WO-DTINIZIO                    PIC X(10).
000333       05 WO-DTFINE                      PIC X(10).
000334       05 WO-CDVALALF                    PIC X(15).
000335       05 WO-CDVALNUM                    PIC S9(18).
000336       05 WO-CDINDICE                    PIC X(05).
000337       05 WO-CDAPPLIV                    PIC X(01).
000338*
000339* TABELLA APPOGGIO PER CARICO INDICI
000340 01 WI-IND-MAX                           PIC 9(08) VALUE ZERO.
000341 01 WI-INDM                              PIC 9(08) VALUE ZERO.
000342 01 WI-IND                               PIC 9(08) VALUE ZERO.
000343 01 WI-IDCDZ                             PIC 9(09).
000344 01 WI-TB-INDI.
000345    02 WI-INDI OCCURS 50.
000346       05 WI-DTINIZIO                    PIC X(10).
000347       05 WI-DTFINE                      PIC X(10).
000348       05 WI-CDINDICE                    PIC X(05).
000349
000350* TABELLA OUTPUT DI APPOGGIO
000351 01 WS-TABOUT-APP.
000352    02 WS-CDUTIRIP-OUT     PIC X(01).
000353    02 WS-ELDIMOUT-OUT     PIC 9(03).
000354    02 WS-TBCDZOUT-OUT     OCCURS 500.
000355       05 WS-DTINIVAL-OUT   PIC 9(08).
000356       05 WS-DTFINVAL-OUT   PIC 9(08).
000357       05 WS-DSCDZBR-OUT    PIC X(15).
000358       05 WS-DSLEGBR-OUT    PIC X(15).
000359       05 WS-NRPRELEM-OUT   PIC 9(03).
000360       05 WS-NRPREGOL-OUT   PIC 9(03).
000361       05 WS-CDNATCDZ-OUT   PIC X(01).
000362       05 WS-CDTPCAR-OUT    PIC X(01).
000363       05 WS-CDSPREAD-OUT   PIC X(01).
000364       05 WS-CDAPPLIV-OUT   PIC X(01).
000365       05 WS-CDFORVAL-OUT   PIC X(01).
000366       05 WS-NMDIMEN-OUT    PIC 9(02).
000367       05 WS-NMDECIMA-OUT   PIC 9(02).
000368       05 WS-DSVAL-OUT      PIC X(15).
000369       05 WS-NRVAL-OUT      PIC S9(18).
000370       05 WS-NRPRCOMP-OUT   PIC 9(03).
000371       05 WS-CDINDICE-OUT   PIC X(05).
000372*
000373* APPOGGI PER RISALITA
000374 01 W-IND-APP                           PIC 9(08) VALUE ZERO.
000375 01 W-IND-APP1                          PIC 9(08) VALUE ZERO.
000376 01 W-IND-FIN                           PIC 9(08) VALUE ZERO.
000377 01 W-INDX                              PIC 9(08) VALUE ZERO.
000378 01 W-INDW                              PIC 9(08) VALUE ZERO.
000379 01 W-INDZ                              PIC 9(08) VALUE ZERO.
000380 01 W-INDY                              PIC 9(08) VALUE ZERO.
000381 01 W-INDO                              PIC 9(08) VALUE ZERO.
000382 01 WS-IND-OUT                          PIC 9(08) VALUE ZERO.
000383 01 WS-IND-OUT-MAX                      PIC 9(08) VALUE ZERO.
000384 01 WS-SC                               PIC 9(08) VALUE ZERO.
000385 01 WS-SC-FROM                          PIC 9(08) VALUE ZERO.
000386 01 WS-SIST-TAB                         PIC X(01) VALUE 'N'.
000387 01 WMIN-DTINIZIO                       PIC X(10).
000388 01 WMIN-DTFINE                         PIC X(10).
000389 01 WS-FINE-RISALITA                    PIC 9(01).
000390     88  WS-NO-FINE-RISALITA            VALUE ZERO.
000391     88  WS-SI-FINE-RISALITA            VALUE 1.
000392 01 WS-FINE-RICERCA                     PIC 9(01).
000393     88  WS-NO-FINE-RICERCA              VALUE ZERO.
000394     88  WS-SI-FINE-RICERCA              VALUE 1.
000395 01 WS-FINE-CARICO                      PIC 9(01).
000396     88  WS-NO-FINE-CARICO               VALUE ZERO.
000397     88  WS-SI-FINE-CARICO               VALUE 1.
000398 01 WS-FINE-RIPARTENZA                  PIC 9(01).
000399     88  WS-NO-FINE-RIPARTENZA           VALUE ZERO.
000400     88  WS-SI-FINE-RIPARTENZA           VALUE 1.
000401*
000402 01  WS-ERMSG.
000403   05  WS-SQLCOD     PIC -999 VALUE ZERO.
000404   05  FILLER        PIC X(1) VALUE '('.
000405   05  WS-SQLACC     PIC X(8).
000406   05  FILLER        PIC X(1) VALUE ')'.
000407   05  WS-SQLERRMC.
000408     10 WS-SQLERRM6  PIC X(6).
000409     10 FILLER       PIC X(02) VALUE ': '.
000410     10 WS-MESSAGE   PIC X(48) VALUE SPACES.
000411*
000412* APPOGGI PER VERIFICA/ALLINEAMENTO STD ISTITUTO
000413 01 WS-ALLINEAMENTO-STD                 PIC 9(01).
000414     88  WS-NO-ALLINEAMENTO-STD          VALUE ZERO.
000415     88  WS-SI-ALLINEAMENTO-STD          VALUE 1.
000416 01 WS-TROVATO-COMPAD                   PIC 9(01).
000417     88  WS-NO-TROVATO-COMPAD            VALUE ZERO.
000418     88  WS-SI-TROVATO-COMPAD            VALUE 1.
000419*
000420* TABELLA ASSOCIAZIONE CDZ SPREAD A FINITO PER ALLINEAMENTO STD
000421 01 WG-IND-MAX                           PIC 9(08) VALUE ZERO.
000422 01 WG-INDM                              PIC 9(08) VALUE ZERO.
000423 01 WG-IND                               PIC 9(08) VALUE ZERO.
000424 01 WG-IND-RIF                           PIC 9(08) VALUE ZERO.
000425 01 WG-TB-CNGR.
000426    02 WG-CNGR OCCURS 150.
000427       05 WG-IDCOMP                      PIC 9(09).
000428       05 WG-IND-DA                      PIC 9(09).
000429       05 WG-IND-A                       PIC 9(09).
000430*
000431* TABELLA CON TUTTI GLI STANDARD ISTITUTO
000432 01 WK-IND-MAX                           PIC 9(08) VALUE ZERO.
000433 01 WK-INDM                              PIC 9(08) VALUE ZERO.
000434 01 WK-IND                               PIC 9(08) VALUE ZERO.
000435 01 WK-TB-ALLSTD.
000436    02 WK-ALLSTD OCCURS 300.
000437       05 WK-IDCOMP                      PIC 9(08).
000438       05 WK-DTINIZIO                    PIC X(10).
000439       05 WK-DTFINE                      PIC X(10).
000440       05 WK-NRVAL                       PIC S9(18) USAGE COMP.
000441*
000442 01 WK-IDCDZ-APPO                        PIC 9(09) VALUE ZERO.
000443 01 WK-IDCOMP-APPO                       PIC 9(09) VALUE ZERO.
000444*
000445* TABELLA CON I VALORI DELL'INDICE CORRENTE
000446 01 WJ-IND-MAX                           PIC 9(08) VALUE ZERO.
000447 01 WJ-INDM                              PIC 9(08) VALUE ZERO.
000448 01 WJ-IND                               PIC 9(08) VALUE ZERO.
000449 01 WJ-TB-VALIND.
000450*   02 WJ-VALIND OCCURS 150.
000451    02 WJ-VALIND OCCURS 366.
000452       05 WJ-DTINIZIO                    PIC X(10).
000453       05 WJ-DTFINE                      PIC X(10).
000454       05 WJ-NRVAL                       PIC S9(18) USAGE COMP.
000455       05 WJ-NRDECIM                     PIC 9(03).
000456*
000457******************************************************************
000458* AREE COMUNICAZIONE PROGRAMMI RICHIAMATI
000459******************************************************************
000460*----------------------------------------------------------------*
000461*    BANKSIEL - STANDARD DI STRUTTURA DEI PROGRAMMI
000462*    AREA DI INTERFACCIA PER ROUTINE DELLA DATA
000463*----------------------------------------------------------------*
000464 01  UTDATA-PARAM.
000465     10  UTDATA-FUNZIONE-X.
000466       15  UTDATA-FUNZIONE               PIC 9.
000467     10  UTDATA-SEC-DATA-1.
000468       15  UTDATA-DATA-1.
000469         20  UTDATA-SEC-ANNO-1.
000470           25 UTDATA-SECOLO-1            PIC 99.
000471           25 UTDATA-ANNO-1              PIC 99.
000472         20  UTDATA-SEC-ANNO-1-N REDEFINES
000473             UTDATA-SEC-ANNO-1           PIC 9(4).
000474         20  UTDATA-MESE-1               PIC 99.
000475         20  UTDATA-GIORNO-1             PIC 99.
000476     10  UTDATA-SEC-DATA-2.
000477       15  UTDATA-DATA-2.
000478         20  UTDATA-SEC-ANNO-2.
000479           25 UTDATA-SECOLO-2            PIC 99.
000480           25 UTDATA-ANNO-2              PIC 99.
000481         20  UTDATA-SEC-ANNO-2-N REDEFINES
000482             UTDATA-SEC-ANNO-2           PIC 9(4).
000483         20  UTDATA-MESE-2               PIC 99.
000484         20  UTDATA-GIORNO-2             PIC 99.
000485     10  UTDATA-GIORNI                   PIC 9(6).
000486     10  UTDATA-DAYS REDEFINES UTDATA-GIORNI.
000487       15  UTDATA-GIORNI-DA              PIC 9(3).
000488       15  UTDATA-GIORNI-A               PIC 9(3).
000489     10  UTDATA-GIORNO-SETT              PIC X(03).
000490     10  UTDATA-FESTIVO                  PIC X.
000491     10  UTDATA-ERRORE                   PIC 9.
000492* IMPLEMENTAZIONE PER IL TRATTAMENTO DEL SABATO LAVORATIVO
000493     10  UTDATA-FUNZIONE-2               PIC 9.
000494
000495
000496*
000497******************************************************************
000498* AREE DB2
000499******************************************************************
000500  EXEC SQL INCLUDE SQLCA END-EXEC .
000501*
000502*       EXEC SQL INCLUDE C6WSRBD END-EXEC.
000503*---------------------------------------------------------------
000504* ALMAVIVA FINANCE S.P.A.
000505*
000506* PROGETTO_________:BKSCZI6
000507*
000508* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
000509*
000510* CLIENTE__________:BPOSTE
000511*
000512* DESC. CLIENTE____:BANCO POSTE
000513*
000514* MODULO MASTER____:C6WSRBD
000515*
000516* MODULO CUSTOM____:C6WSRBD
000517*
000518* VERSIONE MASTER__:V01_20080118_R1
000519*
000520* MD5 MASTER_______:0659A7DBDBC27BC88020F7AE3E823AEE
000521*
000522* VERSIONE CUSTOM__:V01_CPY_BPOSTE
000523*
000524*---------------------------------------------------------------
000525******************************************************************
000526* DCLGEN TABLE(C6TBSRBA)                                         *
000527*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WSRBD))                  *
000528*        ACTION(REPLACE)                                         *
000529*        LANGUAGE(COBOL)                                         *
000530*        NAMES(C6TBSRBA-)                                        *
000531*        QUOTE                                                   *
000532*        COLSUFFIX(YES)                                          *
000533* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
000534******************************************************************
000535  EXEC SQL DECLARE C6TBSRBA TABLE
000536  ( CDSEREST                       CHAR(3) NOT NULL,
000537  DSDESCR                        VARCHAR(35) NOT NULL,
000538  CDTPOGG                        SMALLINT NOT NULL,
000539  SNUTIQUA                       CHAR(1) NOT NULL,
000540  NRTPGRP                        SMALLINT NOT NULL,
000541  SNITPRP                        CHAR(1) NOT NULL,
000542  SNITRIS                        CHAR(1) NOT NULL,
000543  SNUTICNV                       CHAR(1) NOT NULL,
000544  SNUTISBO                       CHAR(1) NOT NULL,
000545  DSLBLQUA                       VARCHAR(15) NOT NULL,
000546  CDSERINT                       INTEGER NOT NULL,
000547  NRGGINDI                       DECIMAL(3, 0) NOT NULL,
000548  NMPGMOGG                       CHAR(8) NOT NULL,
000549  CDTRTREG                       CHAR(1) NOT NULL,
000550  SNNDCNUL                       CHAR(1) NOT NULL,
000551  CDTPRISQ                       CHAR(1) NOT NULL,
000552  CDSTATO                        CHAR(1) NOT NULL,
000553  CDISTITU                       CHAR(5) NOT NULL,
000554  TMSLOG                         TIMESTAMP NOT NULL,
000555  CDOPELOG                       CHAR(8) NOT NULL,
000556  CDPRFLOG                       SMALLINT NOT NULL,
000557  CDENTLOG                       CHAR(5) NOT NULL,
000558  NRENTLOG                       SMALLINT NOT NULL
000559  ) END-EXEC .
000560******************************************************************
000561* COBOL DECLARATION FOR TABLE C6TBSRBA                           *
000562******************************************************************
000563 01  DCLC6TBSRBA.
000564*                       CDSEREST
000565     10 C6TBSRBA-CDSEREST    PIC X(3).
000566     10 C6TBSRBA-DSDESCR.
000567*                       DSDESCR LENGTH
000568        49 C6TBSRBA-DSDESCR-LEN  PIC S9(4) USAGE COMP.
000569*                       DSDESCR
000570        49 C6TBSRBA-DSDESCR-TEXT  PIC X(35).
000571*                       CDTPOGG
000572     10 C6TBSRBA-CDTPOGG     PIC S9(4) USAGE COMP.
000573*                       SNUTIQUA
000574     10 C6TBSRBA-SNUTIQUA    PIC X(1).
000575*                       NRTPGRP
000576     10 C6TBSRBA-NRTPGRP     PIC S9(4) USAGE COMP.
000577*                       SNITPRP
000578     10 C6TBSRBA-SNITPRP     PIC X(1).
000579*                       SNITRIS
000580     10 C6TBSRBA-SNITRIS     PIC X(1).
000581*                       SNUTICNV
000582     10 C6TBSRBA-SNUTICNV    PIC X(1).
000583*                       SNUTISBO
000584     10 C6TBSRBA-SNUTISBO    PIC X(1).
000585     10 C6TBSRBA-DSLBLQUA.
000586*                       DSLBLQUA LENGTH
000587        49 C6TBSRBA-DSLBLQUA-LEN  PIC S9(4) USAGE COMP.
000588*                       DSLBLQUA
000589        49 C6TBSRBA-DSLBLQUA-TEXT  PIC X(15).
000590*                       CDSERINT
000591     10 C6TBSRBA-CDSERINT    PIC S9(9) USAGE COMP.
000592*                       NRGGINDI
000593     10 C6TBSRBA-NRGGINDI    PIC S9(3)V USAGE COMP-3.
000594*                       NMPGMOGG
000595     10 C6TBSRBA-NMPGMOGG    PIC X(8).
000596*                       CDTRTREG
000597     10 C6TBSRBA-CDTRTREG    PIC X(1).
000598*                       SNNDCNUL
000599     10 C6TBSRBA-SNNDCNUL    PIC X(1).
000600*                       CDTPRISQ
000601     10 C6TBSRBA-CDTPRISQ    PIC X(1).
000602*                       CDSTATO
000603     10 C6TBSRBA-CDSTATO     PIC X(1).
000604*                       CDISTITU
000605     10 C6TBSRBA-CDISTITU    PIC X(5).
000606*                       TMSLOG
000607     10 C6TBSRBA-TMSLOG      PIC X(26).
000608*                       CDOPELOG
000609     10 C6TBSRBA-CDOPELOG    PIC X(8).
000610*                       CDPRFLOG
000611     10 C6TBSRBA-CDPRFLOG    PIC S9(4) USAGE COMP.
000612*                       CDENTLOG
000613     10 C6TBSRBA-CDENTLOG    PIC X(5).
000614*                       NRENTLOG
000615     10 C6TBSRBA-NRENTLOG    PIC S9(4) USAGE COMP.
000616******************************************************************
000617* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 23      *
000618******************************************************************
000619
000620*       EXEC SQL INCLUDE C6WCOPD END-EXEC.
000621*---------------------------------------------------------------
000622* ALMAVIVA FINANCE S.P.A.
000623*
000624* PROGETTO_________:BKSCZI6
000625*
000626* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
000627*
000628* CLIENTE__________:BPOSTE
000629*
000630* DESC. CLIENTE____:BANCO POSTE
000631*
000632* MODULO MASTER____:C6WCOPD
000633*
000634* MODULO CUSTOM____:C6WCOPD
000635*
000636* VERSIONE MASTER__:V01_20060630_C5
000637*
000638* MD5 MASTER_______:13485F5CFEDC1CF9718A16F2EFC2DC3B
000639*
000640* VERSIONE CUSTOM__:V01_CPY_BPOSTE
000641*
000642*---------------------------------------------------------------
000643******************************************************************
000644* DCLGEN TABLE(C6TBCOMP)                                         *
000645*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WCOPD))                  *
000646*        ACTION(REPLACE)                                         *
000647*        LANGUAGE(COBOL)                                         *
000648*        QUOTE                                                   *
000649* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
000650******************************************************************
000651  EXEC SQL DECLARE C6TBCOMP TABLE
000652  ( IDCOMPEL                       INTEGER NOT NULL,
000653  DSCOMPEL                       VARCHAR(35) NOT NULL,
000654  DSCOMPBR                       VARCHAR(15) NOT NULL,
000655  CDTPFORM                       CHAR(1) NOT NULL,
000656  NRDECIM                        DECIMAL(2, 0) NOT NULL,
000657  NRDIMENS                       DECIMAL(2, 0) NOT NULL,
000658  CDSTATO                        CHAR(1) NOT NULL,
000659  CDISTITU                       CHAR(5) NOT NULL,
000660  TMSLOG                         TIMESTAMP NOT NULL,
000661  CDOPELOG                       CHAR(8) NOT NULL,
000662  CDPRFLOG                       SMALLINT NOT NULL,
000663  CDENTLOG                       CHAR(5) NOT NULL,
000664  NRENTLOG                       SMALLINT NOT NULL
000665  ) END-EXEC .
000666******************************************************************
000667* COBOL DECLARATION FOR TABLE C6TBCOMP                           *
000668******************************************************************
000669 01  DCLC6TBCOMP.
000670     10 C6TBCOMP-IDCOMPEL             PIC S9(9) USAGE COMP.
000671     10 C6TBCOMP-DSCOMPEL.
000672        49 C6TBCOMP-DSCOMPEL-LEN      PIC S9(4) USAGE COMP.
000673        49 C6TBCOMP-DSCOMPEL-TEXT     PIC X(35).
000674     10 C6TBCOMP-DSCOMPBR.
000675        49 C6TBCOMP-DSCOMPBR-LEN      PIC S9(4) USAGE COMP.
000676        49 C6TBCOMP-DSCOMPBR-TEXT     PIC X(15).
000677     10 C6TBCOMP-CDTPFORM             PIC X(1).
000678     10 C6TBCOMP-NRDECIM              PIC S9(2)V USAGE COMP-3.
000679     10 C6TBCOMP-NRDIMENS             PIC S9(2)V USAGE COMP-3.
000680     10 C6TBCOMP-CDSTATO              PIC X(1).
000681     10 C6TBCOMP-CDISTITU             PIC X(5).
000682     10 C6TBCOMP-TMSLOG               PIC X(26).
000683     10 C6TBCOMP-CDOPELOG             PIC X(8).
000684     10 C6TBCOMP-CDPRFLOG             PIC S9(4) USAGE COMP.
000685     10 C6TBCOMP-CDENTLOG             PIC X(5).
000686     10 C6TBCOMP-NRENTLOG             PIC S9(4) USAGE COMP.
000687******************************************************************
000688* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 13      *
000689******************************************************************
000690
000691*       EXEC SQL INCLUDE C6WCZCD END-EXEC.
000692*---------------------------------------------------------------
000693* ALMAVIVA FINANCE S.P.A.
000694*
000695* PROGETTO_________:BKSCZI6
000696*
000697* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
000698*
000699* CLIENTE__________:BPOSTE
000700*
000701* DESC. CLIENTE____:BANCO POSTE
000702*
000703* MODULO MASTER____:C6WCZCD
000704*
000705* MODULO CUSTOM____:C6WCZCD
000706*
000707* VERSIONE MASTER__:V01_20060630_C5
000708*
000709* MD5 MASTER_______:37459B1D4215CF850A5FB52885D9D590
000710*
000711* VERSIONE CUSTOM__:V01_CPY_BPOSTE
000712*
000713*---------------------------------------------------------------
000714******************************************************************
000715* DCLGEN TABLE(C6TBCZCO)                                         *
000716*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WCZCD))                  *
000717*        ACTION(REPLACE)                                         *
000718*        LANGUAGE(COBOL)                                         *
000719*        NAMES(C6TBCZCO-)                                        *
000720*        QUOTE                                                   *
000721*        COLSUFFIX(YES)                                          *
000722* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
000723******************************************************************
000724  EXEC SQL DECLARE C6TBCZCO TABLE
000725  ( IDCOMP                         INTEGER NOT NULL,
000726  IDCDZ                          INTEGER NOT NULL,
000727  IDCOMPEL                       INTEGER NOT NULL,
000728  NRPRIOR                        SMALLINT NOT NULL,
000729  DSLEGAME                       VARCHAR(35) NOT NULL,
000730  DSLEGBR                        VARCHAR(15) NOT NULL,
000731  CDESTREM                       CHAR(1) NOT NULL,
000732  SNSUPSTD                       CHAR(1) NOT NULL,
000733  CDCTRAUT                       CHAR(1) NOT NULL,
000734  CDDEROG                        CHAR(1) NOT NULL,
000735  CDLIVDER                       CHAR(1) NOT NULL,
000736  CDSPREAD                       CHAR(1) NOT NULL,
000737  CDCALCSPR                      CHAR(1) NOT NULL,
000738  DSCALCSPR                      VARCHAR(15) NOT NULL,
000739  NRGGPOS                        DECIMAL(3, 0) NOT NULL,
000740  NRGGPRE                        DECIMAL(3, 0) NOT NULL,
000741  CDPERPOS                       CHAR(2) NOT NULL,
000742  CDPERPRE                       CHAR(2) NOT NULL,
000743  CDSTATO                        CHAR(1) NOT NULL,
000744  CDISTITU                       CHAR(5) NOT NULL,
000745  TMSLOG                         TIMESTAMP NOT NULL,
000746  CDOPELOG                       CHAR(8) NOT NULL,
000747  CDPRFLOG                       SMALLINT NOT NULL,
000748  CDENTLOG                       CHAR(5) NOT NULL,
000749  NRENTLOG                       SMALLINT NOT NULL
000750  ) END-EXEC .
000751******************************************************************
000752* COBOL DECLARATION FOR TABLE C6TBCZCO                           *
000753******************************************************************
000754 01  DCLC6TBCZCO.
000755*                       IDCOMP
000756     10 C6TBCZCO-IDCOMP      PIC S9(9) USAGE COMP.
000757*                       IDCDZ
000758     10 C6TBCZCO-IDCDZ       PIC S9(9) USAGE COMP.
000759*                       IDCOMPEL
000760     10 C6TBCZCO-IDCOMPEL    PIC S9(9) USAGE COMP.
000761*                       NRPRIOR
000762     10 C6TBCZCO-NRPRIOR     PIC S9(4) USAGE COMP.
000763     10 C6TBCZCO-DSLEGAME.
000764*                       DSLEGAME LENGTH
000765        49 C6TBCZCO-DSLEGAME-LEN  PIC S9(4) USAGE COMP.
000766*                       DSLEGAME
000767        49 C6TBCZCO-DSLEGAME-TEXT  PIC X(35).
000768     10 C6TBCZCO-DSLEGBR.
000769*                       DSLEGBR LENGTH
000770        49 C6TBCZCO-DSLEGBR-LEN  PIC S9(4) USAGE COMP.
000771*                       DSLEGBR
000772        49 C6TBCZCO-DSLEGBR-TEXT  PIC X(15).
000773*                       CDESTREM
000774     10 C6TBCZCO-CDESTREM    PIC X(1).
000775*                       SNSUPSTD
000776     10 C6TBCZCO-SNSUPSTD    PIC X(1).
000777*                       CDCTRAUT
000778     10 C6TBCZCO-CDCTRAUT    PIC X(1).
000779*                       CDDEROG
000780     10 C6TBCZCO-CDDEROG     PIC X(1).
000781*                       CDLIVDER
000782     10 C6TBCZCO-CDLIVDER    PIC X(1).
000783*                       CDSPREAD
000784     10 C6TBCZCO-CDSPREAD    PIC X(1).
000785*                       CDCALCSPR
000786     10 C6TBCZCO-CDCALCSPR   PIC X(1).
000787     10 C6TBCZCO-DSCALCSPR.
000788*                       DSCALCSPR LENGTH
000789        49 C6TBCZCO-DSCALCSPR-LEN  PIC S9(4) USAGE COMP.
000790*                       DSCALCSPR
000791        49 C6TBCZCO-DSCALCSPR-TEXT  PIC X(15).
000792*                       NRGGPOS
000793     10 C6TBCZCO-NRGGPOS     PIC S9(3)V USAGE COMP-3.
000794*                       NRGGPRE
000795     10 C6TBCZCO-NRGGPRE     PIC S9(3)V USAGE COMP-3.
000796*                       CDPERPOS
000797     10 C6TBCZCO-CDPERPOS    PIC X(2).
000798*                       CDPERPRE
000799     10 C6TBCZCO-CDPERPRE    PIC X(2).
000800*                       CDSTATO
000801     10 C6TBCZCO-CDSTATO     PIC X(1).
000802*                       CDISTITU
000803     10 C6TBCZCO-CDISTITU    PIC X(5).
000804*                       TMSLOG
000805     10 C6TBCZCO-TMSLOG      PIC X(26).
000806*                       CDOPELOG
000807     10 C6TBCZCO-CDOPELOG    PIC X(8).
000808*                       CDPRFLOG
000809     10 C6TBCZCO-CDPRFLOG    PIC S9(4) USAGE COMP.
000810*                       CDENTLOG
000811     10 C6TBCZCO-CDENTLOG    PIC X(5).
000812*                       NRENTLOG
000813     10 C6TBCZCO-NRENTLOG    PIC S9(4) USAGE COMP.
000814******************************************************************
000815* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 25      *
000816******************************************************************
000817
000818*       EXEC SQL INCLUDE C6WCDID END-EXEC.
000819*---------------------------------------------------------------
000820* ALMAVIVA FINANCE S.P.A.
000821*
000822* PROGETTO_________:BKSCZM6
000823*
000824* DESC. PROGETTO___:CZM6 - CONDIZIONI RELEASE 6 MPS
000825*
000826* CLIENTE__________:BPOSTE
000827*
000828* DESC. CLIENTE____:BANCO POSTE
000829*
000830* MODULO MASTER____:C6WCDID
000831*
000832* MODULO CUSTOM____:C6WCDID
000833*
000834* VERSIONE MASTER__:V01_20091223_RIL1
000835*
000836* MD5 MASTER_______:4759D5F3EFF2CFFF04370EBB70498736
000837*
000838* VERSIONE CUSTOM__:V01_20091223_RIL1
000839*
000840*---------------------------------------------------------------
000841******************************************************************
000842* DCLGEN TABLE(C6TBCDZI)                                         *
000843*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WCDID))                  *
000844*        ACTION(REPLACE)                                         *
000845*        LANGUAGE(COBOL)                                         *
000846*        NAMES(C6TBCDZI-)                                        *
000847*        QUOTE                                                   *
000848*        COLSUFFIX(YES)                                          *
000849* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
000850******************************************************************
000851  EXEC SQL DECLARE C6TBCDZI TABLE
000852  ( IDCDZ                          INTEGER NOT NULL,
000853  DSCDZ                          VARCHAR(35) NOT NULL,
000854  DSCDZBR                        VARCHAR(15) NOT NULL,
000855  IDCDZEST                       CHAR(5) NOT NULL,
000856  CDSERINT                       INTEGER NOT NULL,
000857  CDNATCDZ                       CHAR(1) NOT NULL,
000858  SNUTIQUA                       CHAR(1) NOT NULL,
000859  SNTRSIM                        CHAR(1) NOT NULL,
000860  CDSTATO                        CHAR(1) NOT NULL,
000861  CDISTITU                       CHAR(5) NOT NULL,
000862  TMSLOG                         TIMESTAMP NOT NULL,
000863  CDOPELOG                       CHAR(8) NOT NULL,
000864  CDPRFLOG                       SMALLINT NOT NULL,
000865  CDENTLOG                       CHAR(5) NOT NULL,
000866  NRENTLOG                       SMALLINT NOT NULL,
000867  CDTPCAR                        CHAR(1) NOT NULL
000868  ) END-EXEC .
000869******************************************************************
000870* COBOL DECLARATION FOR TABLE C6TBCDZI                           *
000871******************************************************************
000872 01  DCLC6TBCDZI.
000873*                       IDCDZ
000874     10 C6TBCDZI-IDCDZ       PIC S9(9) USAGE COMP.
000875     10 C6TBCDZI-DSCDZ.
000876*                       DSCDZ LENGTH
000877        49 C6TBCDZI-DSCDZ-LEN  PIC S9(4) USAGE COMP.
000878*                       DSCDZ
000879        49 C6TBCDZI-DSCDZ-TEXT  PIC X(35).
000880     10 C6TBCDZI-DSCDZBR.
000881*                       DSCDZBR LENGTH
000882        49 C6TBCDZI-DSCDZBR-LEN  PIC S9(4) USAGE COMP.
000883*                       DSCDZBR
000884        49 C6TBCDZI-DSCDZBR-TEXT  PIC X(15).
000885*                       IDCDZEST
000886     10 C6TBCDZI-IDCDZEST    PIC X(5).
000887*                       CDSERINT
000888     10 C6TBCDZI-CDSERINT    PIC S9(9) USAGE COMP.
000889*                       CDNATCDZ
000890     10 C6TBCDZI-CDNATCDZ    PIC X(1).
000891*                       SNUTIQUA
000892     10 C6TBCDZI-SNUTIQUA    PIC X(1).
000893*                       SNTRSIM
000894     10 C6TBCDZI-SNTRSIM     PIC X(1).
000895*                       CDSTATO
000896     10 C6TBCDZI-CDSTATO     PIC X(1).
000897*                       CDISTITU
000898     10 C6TBCDZI-CDISTITU    PIC X(5).
000899*                       TMSLOG
000900     10 C6TBCDZI-TMSLOG      PIC X(26).
000901*                       CDOPELOG
000902     10 C6TBCDZI-CDOPELOG    PIC X(8).
000903*                       CDPRFLOG
000904     10 C6TBCDZI-CDPRFLOG    PIC S9(4) USAGE COMP.
000905*                       CDENTLOG
000906     10 C6TBCDZI-CDENTLOG    PIC X(5).
000907*                       NRENTLOG
000908     10 C6TBCDZI-NRENTLOG    PIC S9(4) USAGE COMP.
000909*                       CDTPCAR
000910     10 C6TBCDZI-CDTPCAR     PIC X(1).
000911******************************************************************
000912* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 15      *
000913******************************************************************
000914
000915*       EXEC SQL INCLUDE C6WGRCD END-EXEC.
000916*---------------------------------------------------------------
000917* ALMAVIVA FINANCE S.P.A.
000918*
000919* PROGETTO_________:BKSCZI6
000920*
000921* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
000922*
000923* CLIENTE__________:BPOSTE
000924*
000925* DESC. CLIENTE____:BANCO POSTE
000926*
000927* MODULO MASTER____:C6WGRCD
000928*
000929* MODULO CUSTOM____:C6WGRCD
000930*
000931* VERSIONE MASTER__:RI_CPY_20060626
000932*
000933* MD5 MASTER_______:CB3FD551E66C15473A0AF077FC406999
000934*
000935* VERSIONE CUSTOM__:V01_CPY_BPOSTE
000936*
000937*---------------------------------------------------------------
000938******************************************************************
000939* DCLGEN TABLE(C6TBGRCZ)                                         *
000940*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WGRCD))                  *
000941*        ACTION(REPLACE)                                         *
000942*        LANGUAGE(COBOL)                                         *
000943*        NAMES(C6TBGRCZ-)                                        *
000944*        QUOTE                                                   *
000945*        COLSUFFIX(YES)                                          *
000946* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
000947******************************************************************
000948  EXEC SQL DECLARE C6TBGRCZ TABLE
000949  ( CDGRP                          INTEGER NOT NULL,
000950  CDTPGRP                        SMALLINT NOT NULL,
000951  DSVAL                          CHAR(12) NOT NULL,
000952  DSDESCR                        VARCHAR(35) NOT NULL,
000953  CDSTATO                        CHAR(1) NOT NULL,
000954  CDISTITU                       CHAR(5) NOT NULL,
000955  TMSLOG                         TIMESTAMP NOT NULL,
000956  CDOPELOG                       CHAR(8) NOT NULL,
000957  CDPRFLOG                       SMALLINT NOT NULL,
000958  CDENTLOG                       CHAR(5) NOT NULL,
000959  NRENTLOG                       SMALLINT NOT NULL
000960  ) END-EXEC .
000961******************************************************************
000962* COBOL DECLARATION FOR TABLE C6TBGRCZ                           *
000963******************************************************************
000964 01  DCLC6TBGRCZ.
000965*                       CDGRP
000966     10 C6TBGRCZ-CDGRP       PIC S9(9) USAGE COMP.
000967*                       CDTPGRP
000968     10 C6TBGRCZ-CDTPGRP     PIC S9(4) USAGE COMP.
000969*                       DSVAL
000970     10 C6TBGRCZ-DSVAL       PIC X(12).
000971     10 C6TBGRCZ-DSDESCR.
000972*                       DSDESCR LENGTH
000973        49 C6TBGRCZ-DSDESCR-LEN  PIC S9(4) USAGE COMP.
000974*                       DSDESCR
000975        49 C6TBGRCZ-DSDESCR-TEXT  PIC X(35).
000976*                       CDSTATO
000977     10 C6TBGRCZ-CDSTATO     PIC X(1).
000978*                       CDISTITU
000979     10 C6TBGRCZ-CDISTITU    PIC X(5).
000980*                       TMSLOG
000981     10 C6TBGRCZ-TMSLOG      PIC X(26).
000982*                       CDOPELOG
000983     10 C6TBGRCZ-CDOPELOG    PIC X(8).
000984*                       CDPRFLOG
000985     10 C6TBGRCZ-CDPRFLOG    PIC S9(4) USAGE COMP.
000986*                       CDENTLOG
000987     10 C6TBGRCZ-CDENTLOG    PIC X(5).
000988*                       NRENTLOG
000989     10 C6TBGRCZ-NRENTLOG    PIC S9(4) USAGE COMP.
000990******************************************************************
000991* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 11      *
000992******************************************************************
000993
000994*       EXEC SQL INCLUDE C6WCRTD END-EXEC.
000995*---------------------------------------------------------------
000996* ALMAVIVA FINANCE S.P.A.
000997*
000998* PROGETTO_________:BKSCZI6
000999*
001000* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
001001*
001002* CLIENTE__________:BPOSTE
001003*
001004* DESC. CLIENTE____:BANCO POSTE
001005*
001006* MODULO MASTER____:C6WCRTD
001007*
001008* MODULO CUSTOM____:C6WCRTD
001009*
001010* VERSIONE MASTER__:RI_CPY_20060626
001011*
001012* MD5 MASTER_______:AA4D6E49DC0B3B3D3332DFCCE262CDA9
001013*
001014* VERSIONE CUSTOM__:V01_CPY_BPOSTE
001015*
001016*---------------------------------------------------------------
001017******************************************************************
001018* DCLGEN TABLE(C6TBCRTZ)                                         *
001019*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WCRTD))                  *
001020*        LANGUAGE(COBOL)                                         *
001021*        QUOTE                                                   *
001022* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
001023******************************************************************
001024  EXEC SQL DECLARE C6TBCRTZ TABLE
001025  ( CDTPGRP                        SMALLINT NOT NULL,
001026  NRPRIOR                        SMALLINT NOT NULL,
001027  PGREPER                        CHAR(8) NOT NULL,
001028  CDSERINT                       INTEGER NOT NULL,
001029  CDSTATO                        CHAR(1) NOT NULL,
001030  CDISTITU                       CHAR(5) NOT NULL,
001031  TMSLOG                         TIMESTAMP NOT NULL,
001032  CDOPELOG                       CHAR(8) NOT NULL,
001033  CDPRFLOG                       SMALLINT NOT NULL,
001034  CDENTLOG                       CHAR(5) NOT NULL,
001035  NRENTLOG                       SMALLINT NOT NULL
001036  ) END-EXEC .
001037******************************************************************
001038* COBOL DECLARATION FOR TABLE C6TBCRTZ                           *
001039******************************************************************
001040 01  DCLC6TBCRTZ.
001041     10 C6TBCRTZ-CDTPGRP     PIC S9(4) USAGE COMP.
001042     10 C6TBCRTZ-NRPRIOR     PIC S9(4) USAGE COMP.
001043     10 C6TBCRTZ-PGREPER     PIC X(8).
001044     10 C6TBCRTZ-CDSERINT    PIC S9(9) USAGE COMP.
001045     10 C6TBCRTZ-CDSTATO     PIC X(1).
001046     10 C6TBCRTZ-CDISTITU    PIC X(5).
001047     10 C6TBCRTZ-TMSLOG      PIC X(26).
001048     10 C6TBCRTZ-CDOPELOG    PIC X(8).
001049     10 C6TBCRTZ-CDPRFLOG    PIC S9(4) USAGE COMP.
001050     10 C6TBCRTZ-CDENTLOG    PIC X(5).
001051     10 C6TBCRTZ-NRENTLOG    PIC S9(4) USAGE COMP.
001052******************************************************************
001053* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 11      *
001054******************************************************************
001055
001056*       EXEC SQL INCLUDE C6WSTCD END-EXEC.
001057*---------------------------------------------------------------
001058* ALMAVIVA FINANCE S.P.A.
001059*
001060* PROGETTO_________:BKSCZI6
001061*
001062* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
001063*
001064* CLIENTE__________:BPOSTE
001065*
001066* DESC. CLIENTE____:BANCO POSTE
001067*
001068* MODULO MASTER____:C6WSTCD
001069*
001070* MODULO CUSTOM____:C6WSTCD
001071*
001072* VERSIONE MASTER__:V01_20070412_INT
001073*
001074* MD5 MASTER_______:552DB19A7E4492376A26BFB4998C6DC8
001075*
001076* VERSIONE CUSTOM__:V01_CPY_BPOSTE
001077*
001078*---------------------------------------------------------------
001079******************************************************************
001080* DCLGEN TABLE(C6TBSTCB)                                         *
001081*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WSTCD))                  *
001082*        ACTION(REPLACE)                                         *
001083*        LANGUAGE(COBOL)                                         *
001084*        NAMES(C6TBSTCB-)                                        *
001085*        QUOTE                                                   *
001086*        LABEL(YES)                                              *
001087*        DBCSDELIM(NO)                                           *
001088*        COLSUFFIX(YES)                                          *
001089* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
001090******************************************************************
001091  EXEC SQL DECLARE C6TBSTCB TABLE
001092  ( CDCOMB                         INTEGER NOT NULL,
001093  CDFORMA                        INTEGER NOT NULL,
001094  DSDESCR                        VARCHAR(35) NOT NULL,
001095  CDGRP1                         INTEGER NOT NULL,
001096  CDGRP2                         INTEGER NOT NULL,
001097  CDGRP3                         INTEGER NOT NULL,
001098  CDGRP4                         INTEGER NOT NULL,
001099  CDGRP5                         INTEGER NOT NULL,
001100  CDINDER                        CHAR(1) NOT NULL,
001101  CDINDEA                        CHAR(1) NOT NULL,
001102  CDSTATO                        CHAR(1) NOT NULL,
001103  SNBLCLST                       CHAR(1) NOT NULL,
001104  CDISTITU                       CHAR(5) NOT NULL,
001105  TMSLOG                         TIMESTAMP NOT NULL,
001106  CDOPELOG                       CHAR(8) NOT NULL,
001107  CDPRFLOG                       SMALLINT NOT NULL,
001108  CDENTLOG                       CHAR(5) NOT NULL,
001109  NRENTLOG                       SMALLINT NOT NULL
001110  ) END-EXEC .
001111******************************************************************
001112* COBOL DECLARATION FOR TABLE C6TBSTCB                           *
001113******************************************************************
001114 01  DCLC6TBSTCB.
001115*    *************************************************************
001116*                       CDCOMB
001117     10 C6TBSTCB-CDCOMB      PIC S9(9) USAGE COMP.
001118*    *************************************************************
001119*                       CDFORMA
001120     10 C6TBSTCB-CDFORMA     PIC S9(9) USAGE COMP.
001121*    *************************************************************
001122     10 C6TBSTCB-DSDESCR.
001123*                       DSDESCR LENGTH
001124        49 C6TBSTCB-DSDESCR-LEN  PIC S9(4) USAGE COMP.
001125*                       DSDESCR
001126        49 C6TBSTCB-DSDESCR-TEXT  PIC X(35).
001127*    *************************************************************
001128*                       CDGRP1
001129     10 C6TBSTCB-CDGRP1      PIC S9(9) USAGE COMP.
001130*    *************************************************************
001131*                       CDGRP2
001132     10 C6TBSTCB-CDGRP2      PIC S9(9) USAGE COMP.
001133*    *************************************************************
001134*                       CDGRP3
001135     10 C6TBSTCB-CDGRP3      PIC S9(9) USAGE COMP.
001136*    *************************************************************
001137*                       CDGRP4
001138     10 C6TBSTCB-CDGRP4      PIC S9(9) USAGE COMP.
001139*    *************************************************************
001140*                       CDGRP5
001141     10 C6TBSTCB-CDGRP5      PIC S9(9) USAGE COMP.
001142*    *************************************************************
001143*                       CDINDER
001144     10 C6TBSTCB-CDINDER     PIC X(1).
001145*    *************************************************************
001146*                       CDINDEA
001147     10 C6TBSTCB-CDINDEA     PIC X(1).
001148*    *************************************************************
001149*                       CDSTATO
001150     10 C6TBSTCB-CDSTATO     PIC X(1).
001151*    *************************************************************
001152*                       SNBLCLST
001153     10 C6TBSTCB-SNBLCLST    PIC X(1).
001154*    *************************************************************
001155*                       CDISTITU
001156     10 C6TBSTCB-CDISTITU    PIC X(5).
001157*    *************************************************************
001158*                       TMSLOG
001159     10 C6TBSTCB-TMSLOG      PIC X(26).
001160*    *************************************************************
001161*                       CDOPELOG
001162     10 C6TBSTCB-CDOPELOG    PIC X(8).
001163*    *************************************************************
001164*                       CDPRFLOG
001165     10 C6TBSTCB-CDPRFLOG    PIC S9(4) USAGE COMP.
001166*    *************************************************************
001167*                       CDENTLOG
001168     10 C6TBSTCB-CDENTLOG    PIC X(5).
001169*    *************************************************************
001170*                       NRENTLOG
001171     10 C6TBSTCB-NRENTLOG    PIC S9(4) USAGE COMP.
001172******************************************************************
001173* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 18      *
001174******************************************************************
001175
001176*       EXEC SQL INCLUDE C6WPRFD END-EXEC.
001177*---------------------------------------------------------------
001178* ALMAVIVA FINANCE S.P.A.
001179*
001180* PROGETTO_________:BKSCZI6
001181*
001182* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
001183*
001184* CLIENTE__________:BPOSTE
001185*
001186* DESC. CLIENTE____:BANCO POSTE
001187*
001188* MODULO MASTER____:C6WPRFD
001189*
001190* MODULO CUSTOM____:C6WPRFD
001191*
001192* VERSIONE MASTER__:RI_CPY_20060626
001193*
001194* MD5 MASTER_______:4F7080D4986176EF6EAFAAD76AAC1284
001195*
001196* VERSIONE CUSTOM__:V01_CPY_BPOSTE
001197*
001198*---------------------------------------------------------------
001199******************************************************************
001200* DCLGEN TABLE(C6TBPRFM)                                         *
001201*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WPRFD))                  *
001202*        LANGUAGE(COBOL)                                         *
001203*        QUOTE                                                   *
001204* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
001205******************************************************************
001206  EXEC SQL DECLARE C6TBPRFM TABLE
001207  ( CDFORMA                        INTEGER NOT NULL,
001208  NRPRIOR                        SMALLINT NOT NULL,
001209  CDSERINT                       INTEGER NOT NULL,
001210  CDSTATO                        CHAR(1) NOT NULL,
001211  CDISTITU                       CHAR(5) NOT NULL,
001212  TMSLOG                         TIMESTAMP NOT NULL,
001213  CDOPELOG                       CHAR(8) NOT NULL,
001214  CDPRFLOG                       SMALLINT NOT NULL,
001215  CDENTLOG                       CHAR(5) NOT NULL,
001216  NRENTLOG                       SMALLINT NOT NULL
001217  ) END-EXEC .
001218******************************************************************
001219* COBOL DECLARATION FOR TABLE C6TBPRFM                           *
001220******************************************************************
001221 01  DCLC6TBPRFM.
001222     10 C6TBPRFM-CDFORMA     PIC S9(9) USAGE COMP.
001223     10 C6TBPRFM-NRPRIOR     PIC S9(4) USAGE COMP.
001224     10 C6TBPRFM-CDSERINT    PIC S9(9) USAGE COMP.
001225     10 C6TBPRFM-CDSTATO     PIC X(1).
001226     10 C6TBPRFM-CDISTITU    PIC X(5).
001227     10 C6TBPRFM-TMSLOG      PIC X(26).
001228     10 C6TBPRFM-CDOPELOG    PIC X(8).
001229     10 C6TBPRFM-CDPRFLOG    PIC S9(4) USAGE COMP.
001230     10 C6TBPRFM-CDENTLOG    PIC X(5).
001231     10 C6TBPRFM-NRENTLOG    PIC S9(4) USAGE COMP.
001232******************************************************************
001233* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 10 C6TBPR
001234******************************************************************
001235
001236*       EXEC SQL INCLUDE C6WVLQD END-EXEC.
001237*---------------------------------------------------------------
001238* ALMAVIVA FINANCE S.P.A.
001239*
001240* PROGETTO_________:BKSCZI6
001241*
001242* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
001243*
001244* CLIENTE__________:BPOSTE
001245*
001246* DESC. CLIENTE____:BANCO POSTE
001247*
001248* MODULO MASTER____:C6WVLQD
001249*
001250* MODULO CUSTOM____:C6WVLQD
001251*
001252* VERSIONE MASTER__:RI_CPY_20060626
001253*
001254* MD5 MASTER_______:ACF5B378E87F442E558A5BAC38F56F7B
001255*
001256* VERSIONE CUSTOM__:V01_CPY_BPOSTE
001257*
001258*---------------------------------------------------------------
001259******************************************************************
001260* DCLGEN TABLE(C6TBVLQL)                                         *
001261*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WVLQD))                  *
001262*        LANGUAGE(COBOL)                                         *
001263*        NAMES(C6TBVLQL-)                                        *
001264*        QUOTE                                                   *
001265*        COLSUFFIX(YES)                                          *
001266* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
001267******************************************************************
001268  EXEC SQL DECLARE C6TBVLQL TABLE
001269  ( CDVLPRQL                       INTEGER NOT NULL,
001270  CDTPQUA                        SMALLINT NOT NULL,
001271  DSVAL                          CHAR(12) NOT NULL,
001272  DSDESCR                        VARCHAR(35) NOT NULL,
001273  CDSTATO                        CHAR(1) NOT NULL,
001274  CDISTITU                       CHAR(5) NOT NULL,
001275  TMSLOG                         TIMESTAMP NOT NULL,
001276  CDOPELOG                       CHAR(8) NOT NULL,
001277  CDPRFLOG                       SMALLINT NOT NULL,
001278  CDENTLOG                       CHAR(5) NOT NULL,
001279  NRENTLOG                       SMALLINT NOT NULL
001280  ) END-EXEC .
001281******************************************************************
001282* COBOL DECLARATION FOR TABLE C6TBVLQL                           *
001283******************************************************************
001284 01  DCLC6TBVLQL.
001285*                       CDVLPRQL
001286     10 C6TBVLQL-CDVLPRQL    PIC S9(9) USAGE COMP.
001287*                       CDTPQUA
001288     10 C6TBVLQL-CDTPQUA     PIC S9(4) USAGE COMP.
001289*                       DSVAL
001290     10 C6TBVLQL-DSVAL       PIC X(12).
001291     10 C6TBVLQL-DSDESCR.
001292*                       DSDESCR LENGTH
001293        49 C6TBVLQL-DSDESCR-LEN  PIC S9(4) USAGE COMP.
001294*                       DSDESCR
001295        49 C6TBVLQL-DSDESCR-TEXT  PIC X(35).
001296*                       CDSTATO
001297     10 C6TBVLQL-CDSTATO     PIC X(1).
001298*                       CDISTITU
001299     10 C6TBVLQL-CDISTITU    PIC X(5).
001300*                       TMSLOG
001301     10 C6TBVLQL-TMSLOG      PIC X(26).
001302*                       CDOPELOG
001303     10 C6TBVLQL-CDOPELOG    PIC X(8).
001304*                       CDPRFLOG
001305     10 C6TBVLQL-CDPRFLOG    PIC S9(4) USAGE COMP.
001306*                       CDENTLOG
001307     10 C6TBVLQL-CDENTLOG    PIC X(5).
001308*                       NRENTLOG
001309     10 C6TBVLQL-NRENTLOG    PIC S9(4) USAGE COMP.
001310******************************************************************
001311* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 11      *
001312******************************************************************
001313
001314*       EXEC SQL INCLUDE C6WCRQD END-EXEC.
001315*---------------------------------------------------------------
001316* ALMAVIVA FINANCE S.P.A.
001317*
001318* PROGETTO_________:BKSCZI6
001319*
001320* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
001321*
001322* CLIENTE__________:BPOSTE
001323*
001324* DESC. CLIENTE____:BANCO POSTE
001325*
001326* MODULO MASTER____:C6WCRQD
001327*
001328* MODULO CUSTOM____:C6WCRQD
001329*
001330* VERSIONE MASTER__:RI_CPY_20060626
001331*
001332* MD5 MASTER_______:2D76F16C9E8D967685BB95AB8BFB386E
001333*
001334* VERSIONE CUSTOM__:V01_CPY_BPOSTE
001335*
001336*---------------------------------------------------------------
001337******************************************************************
001338* DCLGEN TABLE(C6TBCRQL)                                         *
001339*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WCRQD))                  *
001340*        LANGUAGE(COBOL)                                         *
001341*        QUOTE                                                   *
001342* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
001343******************************************************************
001344  EXEC SQL DECLARE C6TBCRQL TABLE
001345  ( CDTPQUA                        SMALLINT NOT NULL,
001346  NRPRIOR                        SMALLINT NOT NULL,
001347  PGREPER                        CHAR(8) NOT NULL,
001348  CDSERINT                       INTEGER NOT NULL,
001349  CDSTATO                        CHAR(1) NOT NULL,
001350  CDISTITU                       CHAR(5) NOT NULL,
001351  TMSLOG                         TIMESTAMP NOT NULL,
001352  CDOPELOG                       CHAR(8) NOT NULL,
001353  CDPRFLOG                       SMALLINT NOT NULL,
001354  CDENTLOG                       CHAR(5) NOT NULL,
001355  NRENTLOG                       SMALLINT NOT NULL
001356  ) END-EXEC .
001357******************************************************************
001358* COBOL DECLARATION FOR TABLE C6TBCRQL                           *
001359******************************************************************
001360 01  DCLC6TBCRQL.
001361     10 C6TBCRQL-CDTPQUA     PIC S9(4) USAGE COMP.
001362     10 C6TBCRQL-NRPRIOR     PIC S9(4) USAGE COMP.
001363     10 C6TBCRQL-PGREPER     PIC X(8).
001364     10 C6TBCRQL-CDSERINT    PIC S9(9) USAGE COMP.
001365     10 C6TBCRQL-CDSTATO     PIC X(1).
001366     10 C6TBCRQL-CDISTITU    PIC X(5).
001367     10 C6TBCRQL-TMSLOG      PIC X(26).
001368     10 C6TBCRQL-CDOPELOG    PIC X(8).
001369     10 C6TBCRQL-CDPRFLOG    PIC S9(4) USAGE COMP.
001370     10 C6TBCRQL-CDENTLOG    PIC X(5).
001371     10 C6TBCRQL-NRENTLOG    PIC S9(4) USAGE COMP.
001372******************************************************************
001373* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 11      *
001374******************************************************************
001375
001376*       EXEC SQL INCLUDE C6WSTQD END-EXEC.
001377*---------------------------------------------------------------
001378* ALMAVIVA FINANCE S.P.A.
001379*
001380* PROGETTO_________:BKSCZI6
001381*
001382* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
001383*
001384* CLIENTE__________:BPOSTE
001385*
001386* DESC. CLIENTE____:BANCO POSTE
001387*
001388* MODULO MASTER____:C6WSTQD
001389*
001390* MODULO CUSTOM____:C6WSTQD
001391*
001392* VERSIONE MASTER__:V01_20060804_C5
001393*
001394* MD5 MASTER_______:C717B221AC18296AE62B295A79986590
001395*
001396* VERSIONE CUSTOM__:V01_CPY_BPOSTE
001397*
001398*---------------------------------------------------------------
001399******************************************************************
001400* DCLGEN TABLE(C6TBSTQL)                                         *
001401*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WSTQD))                  *
001402*        ACTION(REPLACE)                                         *
001403*        LANGUAGE(COBOL)                                         *
001404*        QUOTE                                                   *
001405* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
001406******************************************************************
001407  EXEC SQL DECLARE C6TBSTQL TABLE
001408  ( CDSERINT                       INTEGER NOT NULL,
001409  IDQUALIF                       INTEGER NOT NULL,
001410  CDFORMA                        INTEGER NOT NULL,
001411  DSDESCR                        VARCHAR(35) NOT NULL,
001412  CDVLPRQL1                      INTEGER NOT NULL,
001413  CDVLPRQL2                      INTEGER NOT NULL,
001414  CDVLPRQL3                      INTEGER NOT NULL,
001415  CDVLPRQL4                      INTEGER NOT NULL,
001416  CDVLPRQL5                      INTEGER NOT NULL,
001417  CDVLPRQL6                      INTEGER NOT NULL,
001418  CDVLPRQL7                      INTEGER NOT NULL,
001419  CDVLPRQL8                      INTEGER NOT NULL,
001420  CDVLPRQL9                      INTEGER NOT NULL,
001421  CDVLPRQL10                     INTEGER NOT NULL,
001422  CDSTATO                        CHAR(1) NOT NULL,
001423  CDISTITU                       CHAR(5) NOT NULL,
001424  TMSLOG                         TIMESTAMP NOT NULL,
001425  CDOPELOG                       CHAR(8) NOT NULL,
001426  CDPRFLOG                       SMALLINT NOT NULL,
001427  CDENTLOG                       CHAR(5) NOT NULL,
001428  NRENTLOG                       SMALLINT NOT NULL
001429  ) END-EXEC .
001430******************************************************************
001431* COBOL DECLARATION FOR TABLE C6TBSTQL                           *
001432******************************************************************
001433 01  DCLC6TBSTQL.
001434     10 C6TBSTQL-CDSERINT             PIC S9(9) USAGE COMP.
001435     10 C6TBSTQL-IDQUALIF             PIC S9(9) USAGE COMP.
001436     10 C6TBSTQL-CDFORMA              PIC S9(9) USAGE COMP.
001437     10 C6TBSTQL-DSDESCR.
001438        49 C6TBSTQL-DSDESCR-LEN       PIC S9(4) USAGE COMP.
001439        49 C6TBSTQL-DSDESCR-TEXT      PIC X(35).
001440     10 C6TBSTQL-CDVLPRQL1            PIC S9(9) USAGE COMP.
001441     10 C6TBSTQL-CDVLPRQL2            PIC S9(9) USAGE COMP.
001442     10 C6TBSTQL-CDVLPRQL3            PIC S9(9) USAGE COMP.
001443     10 C6TBSTQL-CDVLPRQL4            PIC S9(9) USAGE COMP.
001444     10 C6TBSTQL-CDVLPRQL5            PIC S9(9) USAGE COMP.
001445     10 C6TBSTQL-CDVLPRQL6            PIC S9(9) USAGE COMP.
001446     10 C6TBSTQL-CDVLPRQL7            PIC S9(9) USAGE COMP.
001447     10 C6TBSTQL-CDVLPRQL8            PIC S9(9) USAGE COMP.
001448     10 C6TBSTQL-CDVLPRQL9            PIC S9(9) USAGE COMP.
001449     10 C6TBSTQL-CDVLPRQL10           PIC S9(9) USAGE COMP.
001450     10 C6TBSTQL-CDSTATO              PIC X(1).
001451     10 C6TBSTQL-CDISTITU             PIC X(5).
001452     10 C6TBSTQL-TMSLOG               PIC X(26).
001453     10 C6TBSTQL-CDOPELOG             PIC X(8).
001454     10 C6TBSTQL-CDPRFLOG             PIC S9(4) USAGE COMP.
001455     10 C6TBSTQL-CDENTLOG             PIC X(5).
001456     10 C6TBSTQL-NRENTLOG             PIC S9(4) USAGE COMP.
001457******************************************************************
001458* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 21      *
001459******************************************************************
001460
001461*       EXEC SQL INCLUDE C6WPRQD END-EXEC.
001462*---------------------------------------------------------------
001463* ALMAVIVA FINANCE S.P.A.
001464*
001465* PROGETTO_________:BKSCZI6
001466*
001467* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
001468*
001469* CLIENTE__________:BPOSTE
001470*
001471* DESC. CLIENTE____:BANCO POSTE
001472*
001473* MODULO MASTER____:C6WPRQD
001474*
001475* MODULO CUSTOM____:C6WPRQD
001476*
001477* VERSIONE MASTER__:RI_CPY_20060626
001478*
001479* MD5 MASTER_______:7E0D96E4FEAC69C627E5386702A42742
001480*
001481* VERSIONE CUSTOM__:V01_CPY_BPOSTE
001482*
001483*---------------------------------------------------------------
001484******************************************************************
001485* DCLGEN TABLE(C6TBPRQL)                                         *
001486*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WPRQD))                  *
001487*        LANGUAGE(COBOL)                                         *
001488*        QUOTE                                                   *
001489* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
001490******************************************************************
001491  EXEC SQL DECLARE C6TBPRQL TABLE
001492  ( CDFORMA                        INTEGER NOT NULL,
001493  NRPRIOR                        SMALLINT NOT NULL,
001494  CDSERINT                       INTEGER NOT NULL,
001495  CDSTATO                        CHAR(1) NOT NULL,
001496  CDISTITU                       CHAR(5) NOT NULL,
001497  TMSLOG                         TIMESTAMP NOT NULL,
001498  CDOPELOG                       CHAR(8) NOT NULL,
001499  CDPRFLOG                       SMALLINT NOT NULL,
001500  CDENTLOG                       CHAR(5) NOT NULL,
001501  NRENTLOG                       SMALLINT NOT NULL
001502  ) END-EXEC .
001503******************************************************************
001504* COBOL DECLARATION FOR TABLE C6TBPRQL                           *
001505******************************************************************
001506 01  DCLC6TBPRQL.
001507     10 C6TBPRQL-CDFORMA     PIC S9(9) USAGE COMP.
001508     10 C6TBPRQL-NRPRIOR     PIC S9(4) USAGE COMP.
001509     10 C6TBPRQL-CDSERINT    PIC S9(9) USAGE COMP.
001510     10 C6TBPRQL-CDSTATO     PIC X(1).
001511     10 C6TBPRQL-CDISTITU    PIC X(5).
001512     10 C6TBPRQL-TMSLOG      PIC X(26).
001513     10 C6TBPRQL-CDOPELOG    PIC X(8).
001514     10 C6TBPRQL-CDPRFLOG    PIC S9(4) USAGE COMP.
001515     10 C6TBPRQL-CDENTLOG    PIC X(5).
001516     10 C6TBPRQL-NRENTLOG    PIC S9(4) USAGE COMP.
001517******************************************************************
001518* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 10
001519******************************************************************
001520
001521*       EXEC SQL INCLUDE C6WOGCD END-EXEC.
001522*---------------------------------------------------------------
001523* ALMAVIVA FINANCE S.P.A.
001524*
001525* PROGETTO_________:BKSCZI6
001526*
001527* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
001528*
001529* CLIENTE__________:BPOSTE
001530*
001531* DESC. CLIENTE____:BANCO POSTE
001532*
001533* MODULO MASTER____:C6WOGCD
001534*
001535* MODULO CUSTOM____:C6WOGCD
001536*
001537* VERSIONE MASTER__:RI_CPY_20060626
001538*
001539* MD5 MASTER_______:AF4DB5FCA58B814C469DC740E74AE1AD
001540*
001541* VERSIONE CUSTOM__:V01_CPY_BPOSTE
001542*
001543*---------------------------------------------------------------
001544******************************************************************
001545* DCLGEN TABLE(C6TBOGCZ)                                         *
001546*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WOGCD))                  *
001547*        ACTION(REPLACE)                                         *
001548*        LANGUAGE(COBOL)                                         *
001549*        NAMES(C6TBOGCZ-)                                        *
001550*        QUOTE                                                   *
001551*        COLSUFFIX(YES)                                          *
001552* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
001553******************************************************************
001554  EXEC SQL DECLARE C6TBOGCZ TABLE
001555  ( CDOGGETT                       INTEGER NOT NULL,
001556  CDTPOGG                        SMALLINT NOT NULL,
001557  CDOGGEST                       CHAR(30) NOT NULL,
001558  IDNDC                          DECIMAL(11, 0) NOT NULL,
001559  CDSTATO                        CHAR(1) NOT NULL,
001560  CDISTITU                       CHAR(5) NOT NULL,
001561  TMSLOG                         TIMESTAMP NOT NULL,
001562  CDOPELOG                       CHAR(8) NOT NULL,
001563  CDPRFLOG                       SMALLINT NOT NULL,
001564  CDENTLOG                       CHAR(5) NOT NULL,
001565  NRENTLOG                       SMALLINT NOT NULL,
001566  CDFILRAP                       CHAR(5) NOT NULL,
001567  NRRAPPORTO                     CHAR(12) NOT NULL,
001568  CDSERVIZIO                     CHAR(3) NOT NULL
001569  ) END-EXEC .
001570******************************************************************
001571* COBOL DECLARATION FOR TABLE C6TBOGCZ                           *
001572******************************************************************
001573 01  DCLC6TBOGCZ.
001574*                       CDOGGETT
001575     10 C6TBOGCZ-CDOGGETT    PIC S9(9) USAGE COMP.
001576*                       CDTPOGG
001577     10 C6TBOGCZ-CDTPOGG     PIC S9(4) USAGE COMP.
001578*                       CDOGGEST
001579     10 C6TBOGCZ-CDOGGEST    PIC X(30).
001580*                       IDNDC
001581     10 C6TBOGCZ-IDNDC       PIC S9(11)V USAGE COMP-3.
001582*                       CDSTATO
001583     10 C6TBOGCZ-CDSTATO     PIC X(1).
001584*                       CDISTITU
001585     10 C6TBOGCZ-CDISTITU    PIC X(5).
001586*                       TMSLOG
001587     10 C6TBOGCZ-TMSLOG      PIC X(26).
001588*                       CDOPELOG
001589     10 C6TBOGCZ-CDOPELOG    PIC X(8).
001590*                       CDPRFLOG
001591     10 C6TBOGCZ-CDPRFLOG    PIC S9(4) USAGE COMP.
001592*                       CDENTLOG
001593     10 C6TBOGCZ-CDENTLOG    PIC X(5).
001594*                       NRENTLOG
001595     10 C6TBOGCZ-NRENTLOG    PIC S9(4) USAGE COMP.
001596*                       CDFILRAP
001597     10 C6TBOGCZ-CDFILRAP    PIC X(5).
001598*                       NRRAPPORTO
001599     10 C6TBOGCZ-NRRAPPORTO  PIC X(12).
001600*                       CDSERVIZIO
001601     10 C6TBOGCZ-CDSERVIZIO  PIC X(3).
001602******************************************************************
001603* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 14      *
001604******************************************************************
001605
001606*       EXEC SQL INCLUDE C6WLCOD END-EXEC.
001607*---------------------------------------------------------------
001608* ALMAVIVA FINANCE S.P.A.
001609*
001610* PROGETTO_________:BKSCZI6
001611*
001612* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
001613*
001614* CLIENTE__________:BPOSTE
001615*
001616* DESC. CLIENTE____:BANCO POSTE
001617*
001618* MODULO MASTER____:C6WLCOD
001619*
001620* MODULO CUSTOM____:C6WLCOD
001621*
001622* VERSIONE MASTER__:V01_20061220_C3
001623*
001624* MD5 MASTER_______:E76C2A615FCB6BB8FA7145464EF874A5
001625*
001626* VERSIONE CUSTOM__:V01_CPY_BPOSTE
001627*
001628*---------------------------------------------------------------
001629******************************************************************
001630* DCLGEN TABLE(C6TBLCOG)                                         *
001631*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WLCOD))                  *
001632*        ACTION(REPLACE)                                         *
001633*        LANGUAGE(COBOL)                                         *
001634*        NAMES(C6TBLCOG-)                                        *
001635*        QUOTE                                                   *
001636*        COLSUFFIX(YES)                                          *
001637* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
001638******************************************************************
001639  EXEC SQL DECLARE C6TBLCOG TABLE
001640  ( CDOGGETT                       INTEGER NOT NULL,
001641  CDCOMB                         INTEGER NOT NULL,
001642  DTINIZIO                       DATE NOT NULL,
001643  DTFINE                         DATE NOT NULL,
001644  CDSTATO                        CHAR(1) NOT NULL,
001645  CDSERINT                       INTEGER NOT NULL,
001646  CDISTITU                       CHAR(5) NOT NULL,
001647  TMSLOG                         TIMESTAMP NOT NULL,
001648  CDOPELOG                       CHAR(8) NOT NULL,
001649  CDPRFLOG                       SMALLINT NOT NULL,
001650  CDENTLOG                       CHAR(5) NOT NULL,
001651  NRENTLOG                       SMALLINT NOT NULL,
001652  CDTPVARA                       CHAR(1) NOT NULL,
001653  CDTPVARC                       CHAR(1) NOT NULL,
001654  CDGSMAPE                       CHAR(1) NOT NULL,
001655  CDGSMCHI                       CHAR(1) NOT NULL
001656  ) END-EXEC .
001657******************************************************************
001658* COBOL DECLARATION FOR TABLE C6TBLCOG                           *
001659******************************************************************
001660 01  DCLC6TBLCOG.
001661*                       CDOGGETT
001662     10 C6TBLCOG-CDOGGETT    PIC S9(9) USAGE COMP.
001663*                       CDCOMB
001664     10 C6TBLCOG-CDCOMB      PIC S9(9) USAGE COMP.
001665*                       DTINIZIO
001666     10 C6TBLCOG-DTINIZIO    PIC X(10).
001667*                       DTFINE
001668     10 C6TBLCOG-DTFINE      PIC X(10).
001669*                       CDSTATO
001670     10 C6TBLCOG-CDSTATO     PIC X(1).
001671*                       CDSERINT
001672     10 C6TBLCOG-CDSERINT    PIC S9(9) USAGE COMP.
001673*                       CDISTITU
001674     10 C6TBLCOG-CDISTITU    PIC X(5).
001675*                       TMSLOG
001676     10 C6TBLCOG-TMSLOG      PIC X(26).
001677*                       CDOPELOG
001678     10 C6TBLCOG-CDOPELOG    PIC X(8).
001679*                       CDPRFLOG
001680     10 C6TBLCOG-CDPRFLOG    PIC S9(4) USAGE COMP.
001681*                       CDENTLOG
001682     10 C6TBLCOG-CDENTLOG    PIC X(5).
001683*                       NRENTLOG
001684     10 C6TBLCOG-NRENTLOG    PIC S9(4) USAGE COMP.
001685*                       CDTPVARA
001686     10 C6TBLCOG-CDTPVARA    PIC X(1).
001687*                       CDTPVARC
001688     10 C6TBLCOG-CDTPVARC    PIC X(1).
001689*                       CDGSMAPE
001690     10 C6TBLCOG-CDGSMAPE    PIC X(1).
001691*                       CDGSMCHI
001692     10 C6TBLCOG-CDGSMCHI    PIC X(1).
001693******************************************************************
001694* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 16      *
001695******************************************************************
001696
001697*       EXEC SQL INCLUDE C6WCVOD END-EXEC.
001698*---------------------------------------------------------------
001699* ALMAVIVA FINANCE S.P.A.
001700*
001701* PROGETTO_________:BKSCZI6
001702*
001703* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
001704*
001705* CLIENTE__________:BPOSTE
001706*
001707* DESC. CLIENTE____:BANCO POSTE
001708*
001709* MODULO MASTER____:C6WCVOD
001710*
001711* MODULO CUSTOM____:C6WCVOD
001712*
001713* VERSIONE MASTER__:V01_20061220_C8
001714*
001715* MD5 MASTER_______:323D32AA015A2C5B72A72286500AAE8D
001716*
001717* VERSIONE CUSTOM__:V01_CPY_BPOSTE
001718*
001719*---------------------------------------------------------------
001720******************************************************************
001721* DCLGEN TABLE(C6TBCVOG)                                         *
001722*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WCVOD))                  *
001723*        ACTION(REPLACE)                                         *
001724*        LANGUAGE(COBOL)                                         *
001725*        NAMES(C6TBCVOG-)                                        *
001726*        QUOTE                                                   *
001727*        COLSUFFIX(YES)                                          *
001728* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
001729******************************************************************
001730  EXEC SQL DECLARE C6TBCVOG TABLE
001731  ( CDSERINT                       INTEGER NOT NULL,
001732  CDOGGETT                       INTEGER NOT NULL,
001733  CDCNV                          INTEGER NOT NULL,
001734  DTINIZIO                       DATE NOT NULL,
001735  DTFINE                         DATE NOT NULL,
001736  IDPROP                         DECIMAL(13, 0) NOT NULL,
001737  CDTPPROP                       CHAR(1) NOT NULL,
001738  CDSTATO                        CHAR(1) NOT NULL,
001739  CDISTITU                       CHAR(5) NOT NULL,
001740  TMSLOG                         TIMESTAMP NOT NULL,
001741  CDOPELOG                       CHAR(8) NOT NULL,
001742  CDPRFLOG                       SMALLINT NOT NULL,
001743  CDENTLOG                       CHAR(5) NOT NULL,
001744  NRENTLOG                       SMALLINT NOT NULL,
001745  CDTPVARA                       CHAR(1) NOT NULL,
001746  CDTPVARC                       CHAR(1) NOT NULL,
001747  CDGSMAPE                       CHAR(1) NOT NULL,
001748  CDGSMCHI                       CHAR(1) NOT NULL
001749  ) END-EXEC .
001750******************************************************************
001751* COBOL DECLARATION FOR TABLE C6TBCVOG                           *
001752******************************************************************
001753 01  DCLC6TBCVOG.
001754*                       CDSERINT
001755     10 C6TBCVOG-CDSERINT    PIC S9(9) USAGE COMP.
001756*                       CDOGGETT
001757     10 C6TBCVOG-CDOGGETT    PIC S9(9) USAGE COMP.
001758*                       CDCNV
001759     10 C6TBCVOG-CDCNV       PIC S9(9) USAGE COMP.
001760*                       DTINIZIO
001761     10 C6TBCVOG-DTINIZIO    PIC X(10).
001762*                       DTFINE
001763     10 C6TBCVOG-DTFINE      PIC X(10).
001764*                       IDPROP
001765     10 C6TBCVOG-IDPROP      PIC S9(13)V USAGE COMP-3.
001766*                       CDTPPROP
001767     10 C6TBCVOG-CDTPPROP    PIC X(1).
001768*                       CDSTATO
001769     10 C6TBCVOG-CDSTATO     PIC X(1).
001770*                       CDISTITU
001771     10 C6TBCVOG-CDISTITU    PIC X(5).
001772*                       TMSLOG
001773     10 C6TBCVOG-TMSLOG      PIC X(26).
001774*                       CDOPELOG
001775     10 C6TBCVOG-CDOPELOG    PIC X(8).
001776*                       CDPRFLOG
001777     10 C6TBCVOG-CDPRFLOG    PIC S9(4) USAGE COMP.
001778*                       CDENTLOG
001779     10 C6TBCVOG-CDENTLOG    PIC X(5).
001780*                       NRENTLOG
001781     10 C6TBCVOG-NRENTLOG    PIC S9(4) USAGE COMP.
001782*                       CDTPVARA
001783     10 C6TBCVOG-CDTPVARA    PIC X(1).
001784*                       CDTPVARC
001785     10 C6TBCVOG-CDTPVARC    PIC X(1).
001786*                       CDGSMAPE
001787     10 C6TBCVOG-CDGSMAPE    PIC X(1).
001788*                       CDGSMCHI
001789     10 C6TBCVOG-CDGSMCHI    PIC X(1).
001790******************************************************************
001791* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 18      *
001792******************************************************************
001793
001794*       EXEC SQL INCLUDE C6WACND END-EXEC.
001795*---------------------------------------------------------------
001796* ALMAVIVA FINANCE S.P.A.
001797*
001798* PROGETTO_________:BKSCZI6
001799*
001800* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
001801*
001802* CLIENTE__________:BPOSTE
001803*
001804* DESC. CLIENTE____:BANCO POSTE
001805*
001806* MODULO MASTER____:C6WACND
001807*
001808* MODULO CUSTOM____:C6WACND
001809*
001810* VERSIONE MASTER__:V01_20070524_C8
001811*
001812* MD5 MASTER_______:A2EE6883DF0CA0243F174B1F0C932B30
001813*
001814* VERSIONE CUSTOM__:V01_CPY_BPOSTE
001815*
001816*---------------------------------------------------------------
001817******************************************************************
001818* DCLGEN TABLE(C6TBACNV)                                         *
001819*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WACND))                  *
001820*        ACTION(REPLACE)                                         *
001821*        LANGUAGE(COBOL)                                         *
001822*        NAMES(C6TBACNV-)                                        *
001823*        QUOTE                                                   *
001824*        COLSUFFIX(YES)                                          *
001825* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
001826******************************************************************
001827  EXEC SQL DECLARE C6TBACNV TABLE
001828  ( CDCNV                          INTEGER NOT NULL,
001829  CDTPCNV                        SMALLINT NOT NULL,
001830  CDCNVEST                       CHAR(30) NOT NULL,
001831  DSCNVBR                        VARCHAR(15) NOT NULL,
001832  DSCNV                          VARCHAR(35) NOT NULL,
001833  DTINIZIO                       DATE NOT NULL,
001834  DTFINE                         DATE NOT NULL,
001835  CDENTGST                       CHAR(5) NOT NULL,
001836  NRMAXCNV                       DECIMAL(18, 0) NOT NULL,
001837  SNINSLGC                       CHAR(1) NOT NULL,
001838  SNCANLGC                       CHAR(1) NOT NULL,
001839  CDINDER                        CHAR(1) NOT NULL,
001840  CDINDEA                        CHAR(1) NOT NULL,
001841  CDSTATO                        CHAR(1) NOT NULL,
001842  CDISTITU                       CHAR(5) NOT NULL,
001843  TMSLOG                         TIMESTAMP NOT NULL,
001844  CDOPELOG                       CHAR(8) NOT NULL,
001845  CDPRFLOG                       SMALLINT NOT NULL,
001846  CDENTLOG                       CHAR(5) NOT NULL,
001847  NRENTLOG                       SMALLINT NOT NULL,
001848  SNPRPLVM                       CHAR(1) NOT NULL,
001849  NRLIVMIN                       SMALLINT NOT NULL
001850  ) END-EXEC .
001851******************************************************************
001852* COBOL DECLARATION FOR TABLE C6TBACNV                           *
001853******************************************************************
001854 01  DCLC6TBACNV.
001855*                       CDCNV
001856     10 C6TBACNV-CDCNV       PIC S9(9) USAGE COMP.
001857*                       CDTPCNV
001858     10 C6TBACNV-CDTPCNV     PIC S9(4) USAGE COMP.
001859*                       CDCNVEST
001860     10 C6TBACNV-CDCNVEST    PIC X(30).
001861     10 C6TBACNV-DSCNVBR.
001862*                       DSCNVBR LENGTH
001863        49 C6TBACNV-DSCNVBR-LEN  PIC S9(4) USAGE COMP.
001864*                       DSCNVBR
001865        49 C6TBACNV-DSCNVBR-TEXT  PIC X(15).
001866     10 C6TBACNV-DSCNV.
001867*                       DSCNV LENGTH
001868        49 C6TBACNV-DSCNV-LEN  PIC S9(4) USAGE COMP.
001869*                       DSCNV
001870        49 C6TBACNV-DSCNV-TEXT  PIC X(35).
001871*                       DTINIZIO
001872     10 C6TBACNV-DTINIZIO    PIC X(10).
001873*                       DTFINE
001874     10 C6TBACNV-DTFINE      PIC X(10).
001875*                       CDENTGST
001876     10 C6TBACNV-CDENTGST    PIC X(5).
001877*                       NRMAXCNV
001878     10 C6TBACNV-NRMAXCNV    PIC S9(18)V USAGE COMP-3.
001879*                       SNINSLGC
001880     10 C6TBACNV-SNINSLGC    PIC X(1).
001881*                       SNCANLGC
001882     10 C6TBACNV-SNCANLGC    PIC X(1).
001883*                       CDINDER
001884     10 C6TBACNV-CDINDER     PIC X(1).
001885*                       CDINDEA
001886     10 C6TBACNV-CDINDEA     PIC X(1).
001887*                       CDSTATO
001888     10 C6TBACNV-CDSTATO     PIC X(1).
001889*                       CDISTITU
001890     10 C6TBACNV-CDISTITU    PIC X(5).
001891*                       TMSLOG
001892     10 C6TBACNV-TMSLOG      PIC X(26).
001893*                       CDOPELOG
001894     10 C6TBACNV-CDOPELOG    PIC X(8).
001895*                       CDPRFLOG
001896     10 C6TBACNV-CDPRFLOG    PIC S9(4) USAGE COMP.
001897*                       CDENTLOG
001898     10 C6TBACNV-CDENTLOG    PIC X(5).
001899*                       NRENTLOG
001900     10 C6TBACNV-NRENTLOG    PIC S9(4) USAGE COMP.
001901*                       SNPRPLVM
001902     10 C6TBACNV-SNPRPLVM    PIC X(1).
001903*                       NRLIVMIN
001904     10 C6TBACNV-NRLIVMIN    PIC S9(4) USAGE COMP.
001905******************************************************************
001906* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 22      *
001907******************************************************************
001908
001909*       EXEC SQL INCLUDE C6WVIND END-EXEC.
001910*---------------------------------------------------------------
001911* ALMAVIVA FINANCE S.P.A.
001912*
001913* PROGETTO_________:BKSCZI6
001914*
001915* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
001916*
001917* CLIENTE__________:BPOSTE
001918*
001919* DESC. CLIENTE____:BANCO POSTE
001920*
001921* MODULO MASTER____:C6WVIND
001922*
001923* MODULO CUSTOM____:C6WVIND
001924*
001925* VERSIONE MASTER__:V01_20070221_C6BIS
001926*
001927* MD5 MASTER_______:FEAF92D8A54C6C98135269C1DAB549AD
001928*
001929* VERSIONE CUSTOM__:V01_CPY_BPOSTE
001930*
001931*---------------------------------------------------------------
001932******************************************************************
001933* DCLGEN TABLE(C6TBVINC)                                         *
001934*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WVIND))                  *
001935*        ACTION(REPLACE)                                         *
001936*        LANGUAGE(COBOL)                                         *
001937*        NAMES(C6TBVINC-)                                        *
001938*        QUOTE                                                   *
001939*        COLSUFFIX(YES)                                          *
001940* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
001941******************************************************************
001942  EXEC SQL DECLARE C6TBVINC TABLE
001943  ( NRPROGR                        SMALLINT NOT NULL,
001944  IDCDZ                          INTEGER NOT NULL,
001945  IDCOMP                         INTEGER NOT NULL,
001946  DTINIZIO                       DATE NOT NULL,
001947  DTFINE                         DATE NOT NULL,
001948  CDINDICE                       CHAR(5) NOT NULL,
001949  NRVALDA                        DECIMAL(18, 0) NOT NULL,
001950  NRVALA                         DECIMAL(18, 0) NOT NULL,
001951  DSVALDA                        VARCHAR(15) NOT NULL,
001952  DSVALA                         VARCHAR(15) NOT NULL,
001953  DSVINC                         VARCHAR(35) NOT NULL,
001954  DSVINCBR                       VARCHAR(30) NOT NULL,
001955  CDSTATO                        CHAR(1) NOT NULL,
001956  CDISTITU                       CHAR(5) NOT NULL,
001957  TMSLOG                         TIMESTAMP NOT NULL,
001958  CDOPELOG                       CHAR(8) NOT NULL,
001959  CDPRFLOG                       SMALLINT NOT NULL,
001960  CDENTLOG                       CHAR(5) NOT NULL,
001961  NRENTLOG                       SMALLINT NOT NULL
001962  ) END-EXEC .
001963******************************************************************
001964* COBOL DECLARATION FOR TABLE C6TBVINC                           *
001965******************************************************************
001966 01  DCLC6TBVINC.
001967*                       NRPROGR
001968     10 C6TBVINC-NRPROGR     PIC S9(4) USAGE COMP.
001969*                       IDCDZ
001970     10 C6TBVINC-IDCDZ       PIC S9(9) USAGE COMP.
001971*                       IDCOMP
001972     10 C6TBVINC-IDCOMP      PIC S9(9) USAGE COMP.
001973*                       DTINIZIO
001974     10 C6TBVINC-DTINIZIO    PIC X(10).
001975*                       DTFINE
001976     10 C6TBVINC-DTFINE      PIC X(10).
001977*                       CDINDICE
001978     10 C6TBVINC-CDINDICE    PIC X(5).
001979*                       NRVALDA
001980     10 C6TBVINC-NRVALDA     PIC S9(18)V USAGE COMP-3.
001981*                       NRVALA
001982     10 C6TBVINC-NRVALA      PIC S9(18)V USAGE COMP-3.
001983     10 C6TBVINC-DSVALDA.
001984*                       DSVALDA LENGTH
001985        49 C6TBVINC-DSVALDA-LEN  PIC S9(4) USAGE COMP.
001986*                       DSVALDA
001987        49 C6TBVINC-DSVALDA-TEXT  PIC X(15).
001988     10 C6TBVINC-DSVALA.
001989*                       DSVALA LENGTH
001990        49 C6TBVINC-DSVALA-LEN  PIC S9(4) USAGE COMP.
001991*                       DSVALA
001992        49 C6TBVINC-DSVALA-TEXT  PIC X(15).
001993     10 C6TBVINC-DSVINC.
001994*                       DSVINC LENGTH
001995        49 C6TBVINC-DSVINC-LEN  PIC S9(4) USAGE COMP.
001996*                       DSVINC
001997        49 C6TBVINC-DSVINC-TEXT  PIC X(35).
001998     10 C6TBVINC-DSVINCBR.
001999*                       DSVINCBR LENGTH
002000        49 C6TBVINC-DSVINCBR-LEN  PIC S9(4) USAGE COMP.
002001*                       DSVINCBR
002002        49 C6TBVINC-DSVINCBR-TEXT  PIC X(30).
002003*                       CDSTATO
002004     10 C6TBVINC-CDSTATO     PIC X(1).
002005*                       CDISTITU
002006     10 C6TBVINC-CDISTITU    PIC X(5).
002007*                       TMSLOG
002008     10 C6TBVINC-TMSLOG      PIC X(26).
002009*                       CDOPELOG
002010     10 C6TBVINC-CDOPELOG    PIC X(8).
002011*                       CDPRFLOG
002012     10 C6TBVINC-CDPRFLOG    PIC S9(4) USAGE COMP.
002013*                       CDENTLOG
002014     10 C6TBVINC-CDENTLOG    PIC X(5).
002015*                       NRENTLOG
002016     10 C6TBVINC-NRENTLOG    PIC S9(4) USAGE COMP.
002017******************************************************************
002018* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 19      *
002019******************************************************************
002020
002021*       EXEC SQL INCLUDE C6WRLND END-EXEC.
002022*---------------------------------------------------------------
002023* ALMAVIVA FINANCE S.P.A.
002024*
002025* PROGETTO_________:BKSCZI6
002026*
002027* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
002028*
002029* CLIENTE__________:BPOSTE
002030*
002031* DESC. CLIENTE____:BANCO POSTE
002032*
002033* MODULO MASTER____:C6WRLND
002034*
002035* MODULO CUSTOM____:C6WRLND
002036*
002037* VERSIONE MASTER__:V01_20070221_6
002038*
002039* MD5 MASTER_______:C3FCCB88AB180EC36CE676B3F3D6F1A1
002040*
002041* VERSIONE CUSTOM__:V01_CPY_BPOSTE
002042*
002043*---------------------------------------------------------------
002044******************************************************************
002045* DCLGEN TABLE(C6TBRELN)                                         *
002046*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WRLND))                  *
002047*        ACTION(REPLACE)                                         *
002048*        LANGUAGE(COBOL)                                         *
002049*        NAMES(C6TBRELN-)                                        *
002050*        QUOTE                                                   *
002051*        COLSUFFIX(YES)                                          *
002052* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
002053******************************************************************
002054  EXEC SQL DECLARE C6TBRELN TABLE
002055  ( IDRELE                         INTEGER NOT NULL,
002056  IDCDZREG                       INTEGER NOT NULL,
002057  NRPROGR                        SMALLINT NOT NULL,
002058  IDCDZ                          INTEGER NOT NULL,
002059  CDTPRELE                       CHAR(1) NOT NULL,
002060  NRPRIOR                        SMALLINT NOT NULL,
002061  CDSTATO                        CHAR(1) NOT NULL,
002062  CDISTITU                       CHAR(5) NOT NULL,
002063  TMSLOG                         TIMESTAMP NOT NULL,
002064  CDOPELOG                       CHAR(8) NOT NULL,
002065  CDPRFLOG                       SMALLINT NOT NULL,
002066  CDENTLOG                       CHAR(5) NOT NULL,
002067  NRENTLOG                       SMALLINT NOT NULL,
002068  IDCOMPAD                       INTEGER NOT NULL
002069  ) END-EXEC .
002070******************************************************************
002071* COBOL DECLARATION FOR TABLE C6TBRELN                           *
002072******************************************************************
002073 01  DCLC6TBRELN.
002074*                       IDRELE
002075     10 C6TBRELN-IDRELE      PIC S9(9) USAGE COMP.
002076*                       IDCDZREG
002077     10 C6TBRELN-IDCDZREG    PIC S9(9) USAGE COMP.
002078*                       NRPROGR
002079     10 C6TBRELN-NRPROGR     PIC S9(4) USAGE COMP.
002080*                       IDCDZ
002081     10 C6TBRELN-IDCDZ       PIC S9(9) USAGE COMP.
002082*                       CDTPRELE
002083     10 C6TBRELN-CDTPRELE    PIC X(1).
002084*                       NRPRIOR
002085     10 C6TBRELN-NRPRIOR     PIC S9(4) USAGE COMP.
002086*                       CDSTATO
002087     10 C6TBRELN-CDSTATO     PIC X(1).
002088*                       CDISTITU
002089     10 C6TBRELN-CDISTITU    PIC X(5).
002090*                       TMSLOG
002091     10 C6TBRELN-TMSLOG      PIC X(26).
002092*                       CDOPELOG
002093     10 C6TBRELN-CDOPELOG    PIC X(8).
002094*                       CDPRFLOG
002095     10 C6TBRELN-CDPRFLOG    PIC S9(4) USAGE COMP.
002096*                       CDENTLOG
002097     10 C6TBRELN-CDENTLOG    PIC X(5).
002098*                       NRENTLOG
002099     10 C6TBRELN-NRENTLOG    PIC S9(4) USAGE COMP.
002100*                       IDCOMPAD
002101     10 C6TBRELN-IDCOMPAD    PIC S9(9) USAGE COMP.
002102******************************************************************
002103* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 14      *
002104******************************************************************
002105
002106*       EXEC SQL INCLUDE C6WVASD END-EXEC.
002107*---------------------------------------------------------------
002108* ALMAVIVA FINANCE S.P.A.
002109*
002110* PROGETTO_________:BKSCZI6
002111*
002112* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
002113*
002114* CLIENTE__________:BPOSTE
002115*
002116* DESC. CLIENTE____:BANCO POSTE
002117*
002118* MODULO MASTER____:C6WVASD
002119*
002120* MODULO CUSTOM____:C6WVASD
002121*
002122* VERSIONE MASTER__:V01_20061220_C4
002123*
002124* MD5 MASTER_______:4AAB3A7321B60C560EC1DBE19C7D5970
002125*
002126* VERSIONE CUSTOM__:V01_CPY_BPOSTE
002127*
002128*---------------------------------------------------------------
002129******************************************************************
002130* DCLGEN TABLE(C6TBVASG)                                         *
002131*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WVASD))                  *
002132*        ACTION(REPLACE)                                         *
002133*        LANGUAGE(COBOL)                                         *
002134*        NAMES(C6TBVASG-)                                        *
002135*        QUOTE                                                   *
002136*        COLSUFFIX(YES)                                          *
002137* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
002138******************************************************************
002139  EXEC SQL DECLARE C6TBVASG TABLE
002140  ( CDOGGETT                       INTEGER NOT NULL,
002141  CODSBOG                        SMALLINT NOT NULL,
002142  CDSUBOGG                       CHAR(25) NOT NULL,
002143  IDQUALIF                       INTEGER NOT NULL,
002144  IDCOMPON                       INTEGER NOT NULL,
002145  IDCDZ                          INTEGER NOT NULL,
002146  CDVALALF                       VARCHAR(15) NOT NULL,
002147  CDVALNUM                       DECIMAL(18, 0) NOT NULL,
002148  IDPROP                         DECIMAL(13, 0) NOT NULL,
002149  CDTPPROP                       CHAR(1) NOT NULL,
002150  DTINIZIO                       DATE NOT NULL,
002151  DTFINE                         DATE NOT NULL,
002152  CDSERINT                       INTEGER NOT NULL,
002153  CDSTATO                        CHAR(1) NOT NULL,
002154  CDISTITU                       CHAR(5) NOT NULL,
002155  TMLOG                          TIMESTAMP NOT NULL,
002156  CDOPELOG                       CHAR(8) NOT NULL,
002157  CDPRFLOG                       SMALLINT NOT NULL,
002158  CDENTLOG                       CHAR(5) NOT NULL,
002159  NRENTLOG                       SMALLINT NOT NULL,
002160  CDTPVARA                       CHAR(1) NOT NULL,
002161  CDTPVARC                       CHAR(1) NOT NULL,
002162  CDGSMAPE                       CHAR(1) NOT NULL,
002163  CDGSMCHI                       CHAR(1) NOT NULL,
002164  TMSINS                         TIMESTAMP NOT NULL
002165  ) END-EXEC .
002166******************************************************************
002167* COBOL DECLARATION FOR TABLE C6TBVASG                           *
002168******************************************************************
002169 01  DCLC6TBVASG.
002170*                       CDOGGETT
002171     10 C6TBVASG-CDOGGETT    PIC S9(9) USAGE COMP.
002172*                       CODSBOG
002173     10 C6TBVASG-CODSBOG     PIC S9(4) USAGE COMP.
002174*                       CDSUBOGG
002175     10 C6TBVASG-CDSUBOGG    PIC X(25).
002176*                       IDQUALIF
002177     10 C6TBVASG-IDQUALIF    PIC S9(9) USAGE COMP.
002178*                       IDCOMPON
002179     10 C6TBVASG-IDCOMPON    PIC S9(9) USAGE COMP.
002180*                       IDCDZ
002181     10 C6TBVASG-IDCDZ       PIC S9(9) USAGE COMP.
002182     10 C6TBVASG-CDVALALF.
002183*                       CDVALALF LENGTH
002184        49 C6TBVASG-CDVALALF-LEN  PIC S9(4) USAGE COMP.
002185*                       CDVALALF
002186        49 C6TBVASG-CDVALALF-TEXT  PIC X(15).
002187*                       CDVALNUM
002188     10 C6TBVASG-CDVALNUM    PIC S9(18)V USAGE COMP-3.
002189*                       IDPROP
002190     10 C6TBVASG-IDPROP      PIC S9(13)V USAGE COMP-3.
002191*                       CDTPPROP
002192     10 C6TBVASG-CDTPPROP    PIC X(1).
002193*                       DTINIZIO
002194     10 C6TBVASG-DTINIZIO    PIC X(10).
002195*                       DTFINE
002196     10 C6TBVASG-DTFINE      PIC X(10).
002197*                       CDSERINT
002198     10 C6TBVASG-CDSERINT    PIC S9(9) USAGE COMP.
002199*                       CDSTATO
002200     10 C6TBVASG-CDSTATO     PIC X(1).
002201*                       CDISTITU
002202     10 C6TBVASG-CDISTITU    PIC X(5).
002203*                       TMLOG
002204     10 C6TBVASG-TMLOG       PIC X(26).
002205*                       CDOPELOG
002206     10 C6TBVASG-CDOPELOG    PIC X(8).
002207*                       CDPRFLOG
002208     10 C6TBVASG-CDPRFLOG    PIC S9(4) USAGE COMP.
002209*                       CDENTLOG
002210     10 C6TBVASG-CDENTLOG    PIC X(5).
002211*                       NRENTLOG
002212     10 C6TBVASG-NRENTLOG    PIC S9(4) USAGE COMP.
002213*                       CDTPVARA
002214     10 C6TBVASG-CDTPVARA    PIC X(1).
002215*                       CDTPVARC
002216     10 C6TBVASG-CDTPVARC    PIC X(1).
002217*                       CDGSMAPE
002218     10 C6TBVASG-CDGSMAPE    PIC X(1).
002219*                       CDGSMCHI
002220     10 C6TBVASG-CDGSMCHI    PIC X(1).
002221*                       TMSINS
002222     10 C6TBVASG-TMSINS      PIC X(26).
002223******************************************************************
002224* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 25      *
002225******************************************************************
002226
002227*       EXEC SQL INCLUDE C6WVAOD END-EXEC.
002228*---------------------------------------------------------------
002229* ALMAVIVA FINANCE S.P.A.
002230*
002231* PROGETTO_________:BKSCZI6
002232*
002233* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
002234*
002235* CLIENTE__________:BPOSTE
002236*
002237* DESC. CLIENTE____:BANCO POSTE
002238*
002239* MODULO MASTER____:C6WVAOD
002240*
002241* MODULO CUSTOM____:C6WVAOD
002242*
002243* VERSIONE MASTER__:V01_20061220_C4
002244*
002245* MD5 MASTER_______:EA4B5EA3791EE19D76DD59CBB95DDF70
002246*
002247* VERSIONE CUSTOM__:V01_CPY_BPOSTE
002248*
002249*---------------------------------------------------------------
002250******************************************************************
002251* DCLGEN TABLE(C6TBVAOG)                                         *
002252*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WVAOD))                  *
002253*        ACTION(REPLACE)                                         *
002254*        LANGUAGE(COBOL)                                         *
002255*        NAMES(C6TBVAOG-)                                        *
002256*        QUOTE                                                   *
002257*        COLSUFFIX(YES)                                          *
002258* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
002259******************************************************************
002260  EXEC SQL DECLARE C6TBVAOG TABLE
002261  ( CDOGGETT                       INTEGER NOT NULL,
002262  IDQUALIF                       INTEGER NOT NULL,
002263  IDCOMPON                       INTEGER NOT NULL,
002264  IDCDZ                          INTEGER NOT NULL,
002265  CDVALALF                       VARCHAR(15) NOT NULL,
002266  CDVALNUM                       DECIMAL(18, 0) NOT NULL,
002267  IDPROP                         DECIMAL(13, 0) NOT NULL,
002268  CDTPPROP                       CHAR(1) NOT NULL,
002269  DTINIZIO                       DATE NOT NULL,
002270  DTFINE                         DATE NOT NULL,
002271  CDSERINT                       INTEGER NOT NULL,
002272  CDSTATO                        CHAR(1) NOT NULL,
002273  CDISTITU                       CHAR(5) NOT NULL,
002274  TMLOG                          TIMESTAMP NOT NULL,
002275  CDOPELOG                       CHAR(8) NOT NULL,
002276  CDPRFLOG                       SMALLINT NOT NULL,
002277  CDENTLOG                       CHAR(5) NOT NULL,
002278  NRENTLOG                       SMALLINT NOT NULL,
002279  CDTPVARA                       CHAR(1) NOT NULL,
002280  CDTPVARC                       CHAR(1) NOT NULL,
002281  CDGSMAPE                       CHAR(1) NOT NULL,
002282  CDGSMCHI                       CHAR(1) NOT NULL,
002283  TMSINS                         TIMESTAMP NOT NULL
002284  ) END-EXEC .
002285******************************************************************
002286* COBOL DECLARATION FOR TABLE C6TBVAOG                           *
002287******************************************************************
002288 01  DCLC6TBVAOG.
002289*                       CDOGGETT
002290     10 C6TBVAOG-CDOGGETT    PIC S9(9) USAGE COMP.
002291*                       IDQUALIF
002292     10 C6TBVAOG-IDQUALIF    PIC S9(9) USAGE COMP.
002293*                       IDCOMPON
002294     10 C6TBVAOG-IDCOMPON    PIC S9(9) USAGE COMP.
002295*                       IDCDZ
002296     10 C6TBVAOG-IDCDZ       PIC S9(9) USAGE COMP.
002297     10 C6TBVAOG-CDVALALF.
002298*                       CDVALALF LENGTH
002299        49 C6TBVAOG-CDVALALF-LEN  PIC S9(4) USAGE COMP.
002300*                       CDVALALF
002301        49 C6TBVAOG-CDVALALF-TEXT  PIC X(15).
002302*                       CDVALNUM
002303     10 C6TBVAOG-CDVALNUM    PIC S9(18)V USAGE COMP-3.
002304*                       IDPROP
002305     10 C6TBVAOG-IDPROP      PIC S9(13)V USAGE COMP-3.
002306*                       CDTPPROP
002307     10 C6TBVAOG-CDTPPROP    PIC X(1).
002308*                       DTINIZIO
002309     10 C6TBVAOG-DTINIZIO    PIC X(10).
002310*                       DTFINE
002311     10 C6TBVAOG-DTFINE      PIC X(10).
002312*                       CDSERINT
002313     10 C6TBVAOG-CDSERINT    PIC S9(9) USAGE COMP.
002314*                       CDSTATO
002315     10 C6TBVAOG-CDSTATO     PIC X(1).
002316*                       CDISTITU
002317     10 C6TBVAOG-CDISTITU    PIC X(5).
002318*                       TMLOG
002319     10 C6TBVAOG-TMLOG       PIC X(26).
002320*                       CDOPELOG
002321     10 C6TBVAOG-CDOPELOG    PIC X(8).
002322*                       CDPRFLOG
002323     10 C6TBVAOG-CDPRFLOG    PIC S9(4) USAGE COMP.
002324*                       CDENTLOG
002325     10 C6TBVAOG-CDENTLOG    PIC X(5).
002326*                       NRENTLOG
002327     10 C6TBVAOG-NRENTLOG    PIC S9(4) USAGE COMP.
002328*                       CDTPVARA
002329     10 C6TBVAOG-CDTPVARA    PIC X(1).
002330*                       CDTPVARC
002331     10 C6TBVAOG-CDTPVARC    PIC X(1).
002332*                       CDGSMAPE
002333     10 C6TBVAOG-CDGSMAPE    PIC X(1).
002334*                       CDGSMCHI
002335     10 C6TBVAOG-CDGSMCHI    PIC X(1).
002336*                       TMSINS
002337     10 C6TBVAOG-TMSINS      PIC X(26).
002338******************************************************************
002339* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 23      *
002340******************************************************************
002341
002342*       EXEC SQL INCLUDE C6WVAND END-EXEC.
002343*---------------------------------------------------------------
002344* ALMAVIVA FINANCE S.P.A.
002345*
002346* PROGETTO_________:BKSCZI6
002347*
002348* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
002349*
002350* CLIENTE__________:BPOSTE
002351*
002352* DESC. CLIENTE____:BANCO POSTE
002353*
002354* MODULO MASTER____:C6WVAND
002355*
002356* MODULO CUSTOM____:C6WVAND
002357*
002358* VERSIONE MASTER__:V01_20061220_C8
002359*
002360* MD5 MASTER_______:1E1631DA401426C72E66CAC87037CE4E
002361*
002362* VERSIONE CUSTOM__:V01_CPY_BPOSTE
002363*
002364*---------------------------------------------------------------
002365******************************************************************
002366* DCLGEN TABLE(C6TBVACN)                                         *
002367*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WVAND))                  *
002368*        ACTION(REPLACE)                                         *
002369*        LANGUAGE(COBOL)                                         *
002370*        NAMES(C6TBVACN-)                                        *
002371*        QUOTE                                                   *
002372*        COLSUFFIX(YES)                                          *
002373* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
002374******************************************************************
002375  EXEC SQL DECLARE C6TBVACN TABLE
002376  ( CDCNV                          INTEGER NOT NULL,
002377  IDCDZ                          INTEGER NOT NULL,
002378  IDCOMPON                       INTEGER NOT NULL,
002379  IDQUALIF                       INTEGER NOT NULL,
002380  DTINIZIO                       DATE NOT NULL,
002381  DTFINE                         DATE NOT NULL,
002382  CDVALALF                       VARCHAR(15) NOT NULL,
002383  CDVALNUM                       DECIMAL(18, 0) NOT NULL,
002384  CDSERINT                       INTEGER NOT NULL,
002385  SNTRSIM                        CHAR(1) NOT NULL,
002386  IDPROP                         DECIMAL(13, 0) NOT NULL,
002387  CDTPPROP                       CHAR(1) NOT NULL,
002388  CDSTATO                        CHAR(1) NOT NULL,
002389  CDISTITU                       CHAR(5) NOT NULL,
002390  TMSLOG                         TIMESTAMP NOT NULL,
002391  CDOPELOG                       CHAR(8) NOT NULL,
002392  CDPRFLOG                       SMALLINT NOT NULL,
002393  CDENTLOG                       CHAR(5) NOT NULL,
002394  NRENTLOG                       SMALLINT NOT NULL,
002395  CDTPVARA                       CHAR(1) NOT NULL,
002396  CDTPVARC                       CHAR(1) NOT NULL,
002397  CDGSMAPE                       CHAR(1) NOT NULL,
002398  CDGSMCHI                       CHAR(1) NOT NULL,
002399  TMSINS                         TIMESTAMP NOT NULL
002400  ) END-EXEC .
002401******************************************************************
002402* COBOL DECLARATION FOR TABLE C6TBVACN                           *
002403******************************************************************
002404 01  DCLC6TBVACN.
002405*                       CDCNV
002406     10 C6TBVACN-CDCNV       PIC S9(9) USAGE COMP.
002407*                       IDCDZ
002408     10 C6TBVACN-IDCDZ       PIC S9(9) USAGE COMP.
002409*                       IDCOMPON
002410     10 C6TBVACN-IDCOMPON    PIC S9(9) USAGE COMP.
002411*                       IDQUALIF
002412     10 C6TBVACN-IDQUALIF    PIC S9(9) USAGE COMP.
002413*                       DTINIZIO
002414     10 C6TBVACN-DTINIZIO    PIC X(10).
002415*                       DTFINE
002416     10 C6TBVACN-DTFINE      PIC X(10).
002417     10 C6TBVACN-CDVALALF.
002418*                       CDVALALF LENGTH
002419        49 C6TBVACN-CDVALALF-LEN  PIC S9(4) USAGE COMP.
002420*                       CDVALALF
002421        49 C6TBVACN-CDVALALF-TEXT  PIC X(15).
002422*                       CDVALNUM
002423     10 C6TBVACN-CDVALNUM    PIC S9(18)V USAGE COMP-3.
002424*                       CDSERINT
002425     10 C6TBVACN-CDSERINT    PIC S9(9) USAGE COMP.
002426*                       SNTRSIM
002427     10 C6TBVACN-SNTRSIM     PIC X(1).
002428*                       IDPROP
002429     10 C6TBVACN-IDPROP      PIC S9(13)V USAGE COMP-3.
002430*                       CDTPPROP
002431     10 C6TBVACN-CDTPPROP    PIC X(1).
002432*                       CDSTATO
002433     10 C6TBVACN-CDSTATO     PIC X(1).
002434*                       CDISTITU
002435     10 C6TBVACN-CDISTITU    PIC X(5).
002436*                       TMSLOG
002437     10 C6TBVACN-TMSLOG      PIC X(26).
002438*                       CDOPELOG
002439     10 C6TBVACN-CDOPELOG    PIC X(8).
002440*                       CDPRFLOG
002441     10 C6TBVACN-CDPRFLOG    PIC S9(4) USAGE COMP.
002442*                       CDENTLOG
002443     10 C6TBVACN-CDENTLOG    PIC X(5).
002444*                       NRENTLOG
002445     10 C6TBVACN-NRENTLOG    PIC S9(4) USAGE COMP.
002446*                       CDTPVARA
002447     10 C6TBVACN-CDTPVARA    PIC X(1).
002448*                       CDTPVARC
002449     10 C6TBVACN-CDTPVARC    PIC X(1).
002450*                       CDGSMAPE
002451     10 C6TBVACN-CDGSMAPE    PIC X(1).
002452*                       CDGSMCHI
002453     10 C6TBVACN-CDGSMCHI    PIC X(1).
002454*                       TMSINS
002455     10 C6TBVACN-TMSINS      PIC X(26).
002456******************************************************************
002457* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 24      *
002458******************************************************************
002459
002460 01 C6TBVACN-CDCNV1  PIC S9(09) COMP.
002461 01 C6TBVACN-CDCNV2  PIC S9(09) COMP.
002462 01 C6TBVACN-CDCNV3  PIC S9(09) COMP.
002463 01 C6TBVACN-CDCNV4  PIC S9(09) COMP.
002464 01 C6TBVACN-CDCNV5  PIC S9(09) COMP.
002465 01 C6TBVACN-CDCNV6  PIC S9(09) COMP.
002466 01 C6TBVACN-CDCNV7  PIC S9(09) COMP.
002467 01 C6TBVACN-CDCNV8  PIC S9(09) COMP.
002468 01 C6TBVACN-CDCNV9  PIC S9(09) COMP.
002469 01 C6TBVACN-CDCNV10 PIC S9(09) COMP.
002470*       EXEC SQL INCLUDE C6WVACD END-EXEC.
002471*---------------------------------------------------------------
002472* ALMAVIVA FINANCE S.P.A.
002473*
002474* PROGETTO_________:BKSCZI6
002475*
002476* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
002477*
002478* CLIENTE__________:BPOSTE
002479*
002480* DESC. CLIENTE____:BANCO POSTE
002481*
002482* MODULO MASTER____:C6WVACD
002483*
002484* MODULO CUSTOM____:C6WVACD
002485*
002486* VERSIONE MASTER__:V01_20061220_C3
002487*
002488* MD5 MASTER_______:632D62FBE004AE00763E20E9FE82F31C
002489*
002490* VERSIONE CUSTOM__:V01_CPY_BPOSTE
002491*
002492*---------------------------------------------------------------
002493******************************************************************
002494* DCLGEN TABLE(C6TBVACB)                                         *
002495*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WVACD))                  *
002496*        ACTION(REPLACE)                                         *
002497*        LANGUAGE(COBOL)                                         *
002498*        NAMES(C6TBVACB-)                                        *
002499*        QUOTE                                                   *
002500*        COLSUFFIX(YES)                                          *
002501* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
002502******************************************************************
002503  EXEC SQL DECLARE C6TBVACB TABLE
002504  ( CDCOMB                         INTEGER NOT NULL,
002505  IDCDZ                          INTEGER NOT NULL,
002506  IDCOMPON                       INTEGER NOT NULL,
002507  IDQUALIF                       INTEGER NOT NULL,
002508  DTINIZIO                       DATE NOT NULL,
002509  DTFINE                         DATE NOT NULL,
002510  CDVALALF                       VARCHAR(15) NOT NULL,
002511  CDVALNUM                       DECIMAL(18, 0) NOT NULL,
002512  SNTRSIM                        CHAR(1) NOT NULL,
002513  CDSTATO                        CHAR(1) NOT NULL,
002514  CDISTITU                       CHAR(5) NOT NULL,
002515  TMSLOG                         TIMESTAMP NOT NULL,
002516  CDOPELOG                       CHAR(8) NOT NULL,
002517  CDPRFLOG                       SMALLINT NOT NULL,
002518  CDENTLOG                       CHAR(5) NOT NULL,
002519  NRENTLOG                       SMALLINT NOT NULL,
002520  CDTPVARA                       CHAR(1) NOT NULL,
002521  CDTPVARC                       CHAR(1) NOT NULL,
002522  CDGSMAPE                       CHAR(1) NOT NULL,
002523  CDGSMCHI                       CHAR(1) NOT NULL,
002524  TMSINS                         TIMESTAMP NOT NULL
002525  ) END-EXEC .
002526******************************************************************
002527* COBOL DECLARATION FOR TABLE C6TBVACB                           *
002528******************************************************************
002529 01  DCLC6TBVACB.
002530*                       CDCOMB
002531     10 C6TBVACB-CDCOMB      PIC S9(9) USAGE COMP.
002532*                       IDCDZ
002533     10 C6TBVACB-IDCDZ       PIC S9(9) USAGE COMP.
002534*                       IDCOMPON
002535     10 C6TBVACB-IDCOMPON    PIC S9(9) USAGE COMP.
002536*                       IDQUALIF
002537     10 C6TBVACB-IDQUALIF    PIC S9(9) USAGE COMP.
002538*                       DTINIZIO
002539     10 C6TBVACB-DTINIZIO    PIC X(10).
002540*                       DTFINE
002541     10 C6TBVACB-DTFINE      PIC X(10).
002542     10 C6TBVACB-CDVALALF.
002543*                       CDVALALF LENGTH
002544        49 C6TBVACB-CDVALALF-LEN  PIC S9(4) USAGE COMP.
002545*                       CDVALALF
002546        49 C6TBVACB-CDVALALF-TEXT  PIC X(15).
002547*                       CDVALNUM
002548     10 C6TBVACB-CDVALNUM    PIC S9(18)V USAGE COMP-3.
002549*                       SNTRSIM
002550     10 C6TBVACB-SNTRSIM     PIC X(1).
002551*                       CDSTATO
002552     10 C6TBVACB-CDSTATO     PIC X(1).
002553*                       CDISTITU
002554     10 C6TBVACB-CDISTITU    PIC X(5).
002555*                       TMSLOG
002556     10 C6TBVACB-TMSLOG      PIC X(26).
002557*                       CDOPELOG
002558     10 C6TBVACB-CDOPELOG    PIC X(8).
002559*                       CDPRFLOG
002560     10 C6TBVACB-CDPRFLOG    PIC S9(4) USAGE COMP.
002561*                       CDENTLOG
002562     10 C6TBVACB-CDENTLOG    PIC X(5).
002563*                       NRENTLOG
002564     10 C6TBVACB-NRENTLOG    PIC S9(4) USAGE COMP.
002565*                       CDTPVARA
002566     10 C6TBVACB-CDTPVARA    PIC X(1).
002567*                       CDTPVARC
002568     10 C6TBVACB-CDTPVARC    PIC X(1).
002569*                       CDGSMAPE
002570     10 C6TBVACB-CDGSMAPE    PIC X(1).
002571*                       CDGSMCHI
002572     10 C6TBVACB-CDGSMCHI    PIC X(1).
002573*                       TMSINS
002574     10 C6TBVACB-TMSINS      PIC X(26).
002575******************************************************************
002576* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 21      *
002577******************************************************************
002578
002579*       EXEC SQL INCLUDE C6WVILD END-EXEC.
002580*---------------------------------------------------------------
002581* ALMAVIVA FINANCE S.P.A.
002582*
002583* PROGETTO_________:BKSCZI6
002584*
002585* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
002586*
002587* CLIENTE__________:BPOSTE
002588*
002589* DESC. CLIENTE____:BANCO POSTE
002590*
002591* MODULO MASTER____:C6WVILD
002592*
002593* MODULO CUSTOM____:C6WVILD
002594*
002595* VERSIONE MASTER__:V01_20061220_C6
002596*
002597* MD5 MASTER_______:8BB201CE2E358086AA0A372AC918F45C
002598*
002599* VERSIONE CUSTOM__:V01_CPY_BPOSTE
002600*
002601*---------------------------------------------------------------
002602******************************************************************
002603* DCLGEN TABLE(C6TBVILS)                                         *
002604*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WVILD))                  *
002605*        ACTION(REPLACE)                                         *
002606*        LANGUAGE(COBOL)                                         *
002607*        NAMES(C6TBVILS-)                                        *
002608*        QUOTE                                                   *
002609*        COLSUFFIX(YES)                                          *
002610* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
002611******************************************************************
002612  EXEC SQL DECLARE C6TBVILS TABLE
002613  ( CDCOMB                         INTEGER NOT NULL,
002614  IDCDZ                          INTEGER NOT NULL,
002615  IDCOMP                         INTEGER NOT NULL,
002616  IDQUALIF                       INTEGER NOT NULL,
002617  CDINDICE                       CHAR(5) NOT NULL,
002618  DTINIZIO                       DATE NOT NULL,
002619  DTFINE                         DATE NOT NULL,
002620  DSVAL                          VARCHAR(15) NOT NULL,
002621  NRVAL                          DECIMAL(18, 0) NOT NULL,
002622  SNTRSIM                        CHAR(1) NOT NULL,
002623  CDSTATO                        CHAR(1) NOT NULL,
002624  CDISTITU                       CHAR(5) NOT NULL,
002625  TMSLOG                         TIMESTAMP NOT NULL,
002626  CDOPELOG                       CHAR(8) NOT NULL,
002627  CDPRFLOG                       SMALLINT NOT NULL,
002628  CDENTLOG                       CHAR(5) NOT NULL,
002629  NRENTLOG                       SMALLINT NOT NULL,
002630  CDTPVARA                       CHAR(1) NOT NULL,
002631  CDTPVARC                       CHAR(1) NOT NULL,
002632  CDGSMAPE                       CHAR(1) NOT NULL,
002633  CDGSMCHI                       CHAR(1) NOT NULL,
002634  TMSINS                         TIMESTAMP NOT NULL
002635  ) END-EXEC .
002636******************************************************************
002637* COBOL DECLARATION FOR TABLE C6TBVILS                           *
002638******************************************************************
002639 01  DCLC6TBVILS.
002640*                       CDCOMB
002641     10 C6TBVILS-CDCOMB      PIC S9(9) USAGE COMP.
002642*                       IDCDZ
002643     10 C6TBVILS-IDCDZ       PIC S9(9) USAGE COMP.
002644*                       IDCOMP
002645     10 C6TBVILS-IDCOMP      PIC S9(9) USAGE COMP.
002646*                       IDQUALIF
002647     10 C6TBVILS-IDQUALIF    PIC S9(9) USAGE COMP.
002648*                       CDINDICE
002649     10 C6TBVILS-CDINDICE    PIC X(5).
002650*                       DTINIZIO
002651     10 C6TBVILS-DTINIZIO    PIC X(10).
002652*                       DTFINE
002653     10 C6TBVILS-DTFINE      PIC X(10).
002654     10 C6TBVILS-DSVAL.
002655*                       DSVAL LENGTH
002656        49 C6TBVILS-DSVAL-LEN  PIC S9(4) USAGE COMP.
002657*                       DSVAL
002658        49 C6TBVILS-DSVAL-TEXT  PIC X(15).
002659*                       NRVAL
002660     10 C6TBVILS-NRVAL       PIC S9(18)V USAGE COMP-3.
002661*                       SNTRSIM
002662     10 C6TBVILS-SNTRSIM     PIC X(1).
002663*                       CDSTATO
002664     10 C6TBVILS-CDSTATO     PIC X(1).
002665*                       CDISTITU
002666     10 C6TBVILS-CDISTITU    PIC X(5).
002667*                       TMSLOG
002668     10 C6TBVILS-TMSLOG      PIC X(26).
002669*                       CDOPELOG
002670     10 C6TBVILS-CDOPELOG    PIC X(8).
002671*                       CDPRFLOG
002672     10 C6TBVILS-CDPRFLOG    PIC S9(4) USAGE COMP.
002673*                       CDENTLOG
002674     10 C6TBVILS-CDENTLOG    PIC X(5).
002675*                       NRENTLOG
002676     10 C6TBVILS-NRENTLOG    PIC S9(4) USAGE COMP.
002677*                       CDTPVARA
002678     10 C6TBVILS-CDTPVARA    PIC X(1).
002679*                       CDTPVARC
002680     10 C6TBVILS-CDTPVARC    PIC X(1).
002681*                       CDGSMAPE
002682     10 C6TBVILS-CDGSMAPE    PIC X(1).
002683*                       CDGSMCHI
002684     10 C6TBVILS-CDGSMCHI    PIC X(1).
002685*                       TMSINS
002686     10 C6TBVILS-TMSINS      PIC X(26).
002687******************************************************************
002688* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 22      *
002689******************************************************************
002690
002691*       EXEC SQL INCLUDE C6WVISD END-EXEC.
002692*---------------------------------------------------------------
002693* ALMAVIVA FINANCE S.P.A.
002694*
002695* PROGETTO_________:BKSCZI6
002696*
002697* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
002698*
002699* CLIENTE__________:BPOSTE
002700*
002701* DESC. CLIENTE____:BANCO POSTE
002702*
002703* MODULO MASTER____:C6WVISD
002704*
002705* MODULO CUSTOM____:C6WVISD
002706*
002707* VERSIONE MASTER__:V01_20061220_C6
002708*
002709* MD5 MASTER_______:3EAD173A65CC573517B8B03CDF8236EA
002710*
002711* VERSIONE CUSTOM__:V01_CPY_BPOSTE
002712*
002713*---------------------------------------------------------------
002714******************************************************************
002715* DCLGEN TABLE(C6TBVISN)                                         *
002716*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WVISD))                  *
002717*        ACTION(REPLACE)                                         *
002718*        LANGUAGE(COBOL)                                         *
002719*        NAMES(C6TBVISN-)                                        *
002720*        QUOTE                                                   *
002721*        COLSUFFIX(YES)                                          *
002722* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
002723******************************************************************
002724  EXEC SQL DECLARE C6TBVISN TABLE
002725  ( IDCDZ                          INTEGER NOT NULL,
002726  IDCOMP                         INTEGER NOT NULL,
002727  IDQUALIF                       INTEGER NOT NULL,
002728  DTINIZIO                       DATE NOT NULL,
002729  DTFINE                         DATE NOT NULL,
002730  DSVAL                          VARCHAR(15) NOT NULL,
002731  NRVAL                          DECIMAL(18, 0) NOT NULL,
002732  SNTRSIM                        CHAR(1) NOT NULL,
002733  CDSTATO                        CHAR(1) NOT NULL,
002734  CDISTITU                       CHAR(5) NOT NULL,
002735  TMSLOG                         TIMESTAMP NOT NULL,
002736  CDOPELOG                       CHAR(8) NOT NULL,
002737  CDPRFLOG                       SMALLINT NOT NULL,
002738  CDENTLOG                       CHAR(5) NOT NULL,
002739  NRENTLOG                       SMALLINT NOT NULL,
002740  CDTPVARA                       CHAR(1) NOT NULL,
002741  CDTPVARC                       CHAR(1) NOT NULL,
002742  CDGSMAPE                       CHAR(1) NOT NULL,
002743  CDGSMCHI                       CHAR(1) NOT NULL,
002744  TMSINS                         TIMESTAMP NOT NULL
002745  ) END-EXEC .
002746******************************************************************
002747* COBOL DECLARATION FOR TABLE C6TBVISN                           *
002748******************************************************************
002749 01  DCLC6TBVISN.
002750*                       IDCDZ
002751     10 C6TBVISN-IDCDZ       PIC S9(9) USAGE COMP.
002752*                       IDCOMP
002753     10 C6TBVISN-IDCOMP      PIC S9(9) USAGE COMP.
002754*                       IDQUALIF
002755     10 C6TBVISN-IDQUALIF    PIC S9(9) USAGE COMP.
002756*                       DTINIZIO
002757     10 C6TBVISN-DTINIZIO    PIC X(10).
002758*                       DTFINE
002759     10 C6TBVISN-DTFINE      PIC X(10).
002760     10 C6TBVISN-DSVAL.
002761*                       DSVAL LENGTH
002762        49 C6TBVISN-DSVAL-LEN  PIC S9(4) USAGE COMP.
002763*                       DSVAL
002764        49 C6TBVISN-DSVAL-TEXT  PIC X(15).
002765*                       NRVAL
002766     10 C6TBVISN-NRVAL       PIC S9(18)V USAGE COMP-3.
002767*                       SNTRSIM
002768     10 C6TBVISN-SNTRSIM     PIC X(1).
002769*                       CDSTATO
002770     10 C6TBVISN-CDSTATO     PIC X(1).
002771*                       CDISTITU
002772     10 C6TBVISN-CDISTITU    PIC X(5).
002773*                       TMSLOG
002774     10 C6TBVISN-TMSLOG      PIC X(26).
002775*                       CDOPELOG
002776     10 C6TBVISN-CDOPELOG    PIC X(8).
002777*                       CDPRFLOG
002778     10 C6TBVISN-CDPRFLOG    PIC S9(4) USAGE COMP.
002779*                       CDENTLOG
002780     10 C6TBVISN-CDENTLOG    PIC X(5).
002781*                       NRENTLOG
002782     10 C6TBVISN-NRENTLOG    PIC S9(4) USAGE COMP.
002783*                       CDTPVARA
002784     10 C6TBVISN-CDTPVARA    PIC X(1).
002785*                       CDTPVARC
002786     10 C6TBVISN-CDTPVARC    PIC X(1).
002787*                       CDGSMAPE
002788     10 C6TBVISN-CDGSMAPE    PIC X(1).
002789*                       CDGSMCHI
002790     10 C6TBVISN-CDGSMCHI    PIC X(1).
002791*                       TMSINS
002792     10 C6TBVISN-TMSINS      PIC X(26).
002793******************************************************************
002794* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 20      *
002795******************************************************************
002796
002797 01 C6TBVISN-CDSERINT PIC S9(09) COMP.
002798*       EXEC SQL INCLUDE C6WVSSD END-EXEC.
002799*---------------------------------------------------------------
002800* ALMAVIVA FINANCE S.P.A.
002801*
002802* PROGETTO_________:BKSCZI6
002803*
002804* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
002805*
002806* CLIENTE__________:BPOSTE
002807*
002808* DESC. CLIENTE____:BANCO POSTE
002809*
002810* MODULO MASTER____:C6WVSSD
002811*
002812* MODULO CUSTOM____:C6WVSSD
002813*
002814* VERSIONE MASTER__:V01_20061220_C6
002815*
002816* MD5 MASTER_______:C065A84EFDD74F865404C638AEF304D7
002817*
002818* VERSIONE CUSTOM__:V01_CPY_BPOSTE
002819*
002820*---------------------------------------------------------------
002821******************************************************************
002822* DCLGEN TABLE(C6TBVISS)                                         *
002823*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WVSSD))                  *
002824*        ACTION(REPLACE)                                         *
002825*        LANGUAGE(COBOL)                                         *
002826*        NAMES(C6TBVISS-)                                        *
002827*        QUOTE                                                   *
002828*        COLSUFFIX(YES)                                          *
002829* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
002830******************************************************************
002831  EXEC SQL DECLARE C6TBVISS TABLE
002832  ( IDCDZ                          INTEGER NOT NULL,
002833  IDCOMP                         INTEGER NOT NULL,
002834  IDQUALIF                       INTEGER NOT NULL,
002835  CDINDICE                       CHAR(5) NOT NULL,
002836  DTINIZIO                       DATE NOT NULL,
002837  DTFINE                         DATE NOT NULL,
002838  DSVAL                          VARCHAR(15) NOT NULL,
002839  NRVAL                          DECIMAL(18, 0) NOT NULL,
002840  SNTRSIM                        CHAR(1) NOT NULL,
002841  CDSTATO                        CHAR(1) NOT NULL,
002842  CDISTITU                       CHAR(5) NOT NULL,
002843  TMSLOG                         TIMESTAMP NOT NULL,
002844  CDOPELOG                       CHAR(8) NOT NULL,
002845  CDPRFLOG                       SMALLINT NOT NULL,
002846  CDENTLOG                       CHAR(5) NOT NULL,
002847  NRENTLOG                       SMALLINT NOT NULL,
002848  CDTPVARA                       CHAR(1) NOT NULL,
002849  CDTPVARC                       CHAR(1) NOT NULL,
002850  CDGSMAPE                       CHAR(1) NOT NULL,
002851  CDGSMCHI                       CHAR(1) NOT NULL,
002852  TMSINS                         TIMESTAMP NOT NULL
002853  ) END-EXEC .
002854******************************************************************
002855* COBOL DECLARATION FOR TABLE C6TBVISS                           *
002856******************************************************************
002857 01  DCLC6TBVISS.
002858*                       IDCDZ
002859     10 C6TBVISS-IDCDZ       PIC S9(9) USAGE COMP.
002860*                       IDCOMP
002861     10 C6TBVISS-IDCOMP      PIC S9(9) USAGE COMP.
002862*                       IDQUALIF
002863     10 C6TBVISS-IDQUALIF    PIC S9(9) USAGE COMP.
002864*                       CDINDICE
002865     10 C6TBVISS-CDINDICE    PIC X(5).
002866*                       DTINIZIO
002867     10 C6TBVISS-DTINIZIO    PIC X(10).
002868*                       DTFINE
002869     10 C6TBVISS-DTFINE      PIC X(10).
002870     10 C6TBVISS-DSVAL.
002871*                       DSVAL LENGTH
002872        49 C6TBVISS-DSVAL-LEN  PIC S9(4) USAGE COMP.
002873*                       DSVAL
002874        49 C6TBVISS-DSVAL-TEXT  PIC X(15).
002875*                       NRVAL
002876     10 C6TBVISS-NRVAL       PIC S9(18)V USAGE COMP-3.
002877*                       SNTRSIM
002878     10 C6TBVISS-SNTRSIM     PIC X(1).
002879*                       CDSTATO
002880     10 C6TBVISS-CDSTATO     PIC X(1).
002881*                       CDISTITU
002882     10 C6TBVISS-CDISTITU    PIC X(5).
002883*                       TMSLOG
002884     10 C6TBVISS-TMSLOG      PIC X(26).
002885*                       CDOPELOG
002886     10 C6TBVISS-CDOPELOG    PIC X(8).
002887*                       CDPRFLOG
002888     10 C6TBVISS-CDPRFLOG    PIC S9(4) USAGE COMP.
002889*                       CDENTLOG
002890     10 C6TBVISS-CDENTLOG    PIC X(5).
002891*                       NRENTLOG
002892     10 C6TBVISS-NRENTLOG    PIC S9(4) USAGE COMP.
002893*                       CDTPVARA
002894     10 C6TBVISS-CDTPVARA    PIC X(1).
002895*                       CDTPVARC
002896     10 C6TBVISS-CDTPVARC    PIC X(1).
002897*                       CDGSMAPE
002898     10 C6TBVISS-CDGSMAPE    PIC X(1).
002899*                       CDGSMCHI
002900     10 C6TBVISS-CDGSMCHI    PIC X(1).
002901*                       TMSINS
002902     10 C6TBVISS-TMSINS      PIC X(26).
002903******************************************************************
002904* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 21      *
002905******************************************************************
002906
002907 01 C6TBVISS-CDSERINT PIC S9(09) COMP.
002908*       EXEC SQL INCLUDE C6WLSCD END-EXEC.
002909*---------------------------------------------------------------
002910* ALMAVIVA FINANCE S.P.A.
002911*
002912* PROGETTO_________:BKSCZI6
002913*
002914* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
002915*
002916* CLIENTE__________:BPOSTE
002917*
002918* DESC. CLIENTE____:BANCO POSTE
002919*
002920* MODULO MASTER____:C6WLSCD
002921*
002922* MODULO CUSTOM____:C6WLSCD
002923*
002924* VERSIONE MASTER__:V01_20080307_R1
002925*
002926* MD5 MASTER_______:3C520A708F2EC39FA3128248EF61CAD2
002927*
002928* VERSIONE CUSTOM__:V01_CPY_BPOSTE
002929*
002930*---------------------------------------------------------------
002931******************************************************************
002932* DCLGEN TABLE(C6TBLSCZ)                                         *
002933*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WLSCD))                  *
002934*        ACTION(REPLACE)                                         *
002935*        LANGUAGE(COBOL)                                         *
002936*        NAMES(C6TBLSCZ-)                                        *
002937*        QUOTE                                                   *
002938*        COLSUFFIX(YES)                                          *
002939* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
002940******************************************************************
002941  EXEC SQL DECLARE C6TBLSCZ TABLE
002942  ( CDISTITU                       CHAR(5) NOT NULL,
002943  CDLISTA                        CHAR(20) NOT NULL,
002944  CDTPLST                        CHAR(1) NOT NULL,
002945  DSLISTA                        CHAR(30) NOT NULL,
002946  PGLSTPRD                       CHAR(8) NOT NULL,
002947  CDSERINT                       INTEGER NOT NULL,
002948  CDUSRVAR                       CHAR(10) NOT NULL,
002949  DTVARIAZ                       CHAR(8) NOT NULL,
002950  TMVARIAZ                       DECIMAL(6, 0) NOT NULL,
002951  CDPRFLOG                       SMALLINT NOT NULL,
002952  CDENTLOG                       CHAR(5) NOT NULL,
002953  NRENTLOG                       SMALLINT NOT NULL,
002954  CDSTATO                        CHAR(1) NOT NULL,
002955  CDTIPCHI                       CHAR(3) NOT NULL,
002956  CDTPDATA                       CHAR(1) NOT NULL,
002957  NRGMA                          DECIMAL(3, 0) NOT NULL,
002958  CDPER                          CHAR(1) NOT NULL
002959  ) END-EXEC .
002960******************************************************************
002961* COBOL DECLARATION FOR TABLE C6TBLSCZ                           *
002962******************************************************************
002963 01  DCLC6TBLSCZ.
002964*                       CDISTITU
002965     10 C6TBLSCZ-CDISTITU    PIC X(5).
002966*                       CDLISTA
002967     10 C6TBLSCZ-CDLISTA     PIC X(20).
002968*                       CDTPLST
002969     10 C6TBLSCZ-CDTPLST     PIC X(1).
002970*                       DSLISTA
002971     10 C6TBLSCZ-DSLISTA     PIC X(30).
002972*                       PGLSTPRD
002973     10 C6TBLSCZ-PGLSTPRD    PIC X(8).
002974*                       CDSERINT
002975     10 C6TBLSCZ-CDSERINT    PIC S9(9) USAGE COMP.
002976*                       CDUSRVAR
002977     10 C6TBLSCZ-CDUSRVAR    PIC X(10).
002978*                       DTVARIAZ
002979     10 C6TBLSCZ-DTVARIAZ    PIC X(8).
002980*                       TMVARIAZ
002981     10 C6TBLSCZ-TMVARIAZ    PIC S9(6)V USAGE COMP-3.
002982*                       CDPRFLOG
002983     10 C6TBLSCZ-CDPRFLOG    PIC S9(4) USAGE COMP.
002984*                       CDENTLOG
002985     10 C6TBLSCZ-CDENTLOG    PIC X(5).
002986*                       NRENTLOG
002987     10 C6TBLSCZ-NRENTLOG    PIC S9(4) USAGE COMP.
002988*                       CDSTATO
002989     10 C6TBLSCZ-CDSTATO     PIC X(1).
002990*                       CDTIPCHI
002991     10 C6TBLSCZ-CDTIPCHI    PIC X(3).
002992*                       CDTPDATA
002993     10 C6TBLSCZ-CDTPDATA    PIC X(1).
002994*                       NRGMA
002995     10 C6TBLSCZ-NRGMA       PIC S9(3)V USAGE COMP-3.
002996*                       CDPER
002997     10 C6TBLSCZ-CDPER       PIC X(1).
002998******************************************************************
002999* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 17      *
003000******************************************************************
003001
003002*       EXEC SQL INCLUDE C6WELCD END-EXEC.
003003*---------------------------------------------------------------
003004* ALMAVIVA FINANCE S.P.A.
003005*
003006* PROGETTO_________:BKSCZI6
003007*
003008* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
003009*
003010* CLIENTE__________:BPOSTE
003011*
003012* DESC. CLIENTE____:BANCO POSTE
003013*
003014* MODULO MASTER____:C6WELCD
003015*
003016* MODULO CUSTOM____:C6WELCD
003017*
003018* VERSIONE MASTER__:V01_20080317_R2
003019*
003020* MD5 MASTER_______:87571650893B2ECF49022BD03E856E0E
003021*
003022* VERSIONE CUSTOM__:V01_CPY_BPOSTE
003023*
003024*---------------------------------------------------------------
003025******************************************************************
003026* DCLGEN TABLE(C6TBELCZ)                                         *
003027*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WELCD))                  *
003028*        ACTION(REPLACE)                                         *
003029*        LANGUAGE(COBOL)                                         *
003030*        NAMES(C6TBELCZ-)                                        *
003031*        QUOTE                                                   *
003032*        COLSUFFIX(YES)                                          *
003033* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
003034******************************************************************
003035  EXEC SQL DECLARE C6TBELCZ TABLE
003036  ( CDISTITU                       CHAR(5) NOT NULL,
003037  CDLISTA                        CHAR(20) NOT NULL,
003038  CDTPLST                        CHAR(1) NOT NULL,
003039  NRPRELEM                       DECIMAL(3, 0) NOT NULL,
003040  IDCONDIZ                       INTEGER NOT NULL,
003041  CDUSRVAR                       CHAR(10) NOT NULL,
003042  DTVARIAZ                       CHAR(8) NOT NULL,
003043  TMVARIAZ                       DECIMAL(6, 0) NOT NULL,
003044  CDPRFLOG                       SMALLINT NOT NULL,
003045  CDENTLOG                       CHAR(5) NOT NULL,
003046  NRENTLOG                       SMALLINT NOT NULL,
003047  CDUTIL                         CHAR(1) NOT NULL
003048  ) END-EXEC .
003049******************************************************************
003050* COBOL DECLARATION FOR TABLE C6TBELCZ                           *
003051******************************************************************
003052 01  DCLC6TBELCZ.
003053*                       CDISTITU
003054     10 C6TBELCZ-CDISTITU    PIC X(5).
003055*                       CDLISTA
003056     10 C6TBELCZ-CDLISTA     PIC X(20).
003057*                       CDTPLST
003058     10 C6TBELCZ-CDTPLST     PIC X(1).
003059*                       NRPRELEM
003060     10 C6TBELCZ-NRPRELEM    PIC S9(3)V USAGE COMP-3.
003061*                       IDCONDIZ
003062     10 C6TBELCZ-IDCONDIZ    PIC S9(9) USAGE COMP.
003063*                       CDUSRVAR
003064     10 C6TBELCZ-CDUSRVAR    PIC X(10).
003065*                       DTVARIAZ
003066     10 C6TBELCZ-DTVARIAZ    PIC X(8).
003067*                       TMVARIAZ
003068     10 C6TBELCZ-TMVARIAZ    PIC S9(6)V USAGE COMP-3.
003069*                       CDPRFLOG
003070     10 C6TBELCZ-CDPRFLOG    PIC S9(4) USAGE COMP.
003071*                       CDENTLOG
003072     10 C6TBELCZ-CDENTLOG    PIC X(5).
003073*                       NRENTLOG
003074     10 C6TBELCZ-NRENTLOG    PIC S9(4) USAGE COMP.
003075*                       CDUTIL
003076     10 C6TBELCZ-CDUTIL      PIC X(1).
003077******************************************************************
003078* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 12      *
003079******************************************************************
003080
003081*       EXEC SQL INCLUDE C6WVAID END-EXEC.
003082*---------------------------------------------------------------
003083* ALMAVIVA FINANCE S.P.A.
003084*
003085* PROGETTO_________:BKSCZI6
003086*
003087* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
003088*
003089* CLIENTE__________:BPOSTE
003090*
003091* DESC. CLIENTE____:BANCO POSTE
003092*
003093* MODULO MASTER____:C6WVAID
003094*
003095* MODULO CUSTOM____:C6WVAID
003096*
003097* VERSIONE MASTER__:V01_20060630_C5
003098*
003099* MD5 MASTER_______:4D17F2907EC30847B2055375209077E5
003100*
003101* VERSIONE CUSTOM__:V01_CPY_BPOSTE
003102*
003103*---------------------------------------------------------------
003104******************************************************************
003105* DCLGEN TABLE(C6TBVAIN)                                         *
003106*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WVAID))                  *
003107*        ACTION(REPLACE)                                         *
003108*        LANGUAGE(COBOL)                                         *
003109*        NAMES(C6TBVAIN-)                                        *
003110*        QUOTE                                                   *
003111*        COLSUFFIX(YES)                                          *
003112* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
003113******************************************************************
003114  EXEC SQL DECLARE C6TBVAIN TABLE
003115  ( CDINDICE                       CHAR(5) NOT NULL,
003116  DTINIZIO                       DATE NOT NULL,
003117  DTFINE                         DATE NOT NULL,
003118  NRVAL                          DECIMAL(18, 0) NOT NULL,
003119  CDISTITU                       CHAR(5) NOT NULL,
003120  TMSLOG                         TIMESTAMP NOT NULL,
003121  CDOPELOG                       CHAR(8) NOT NULL,
003122  CDPRFLOG                       SMALLINT NOT NULL,
003123  CDENTLOG                       CHAR(5) NOT NULL,
003124  NRENTLOG                       SMALLINT NOT NULL
003125  ) END-EXEC .
003126******************************************************************
003127* COBOL DECLARATION FOR TABLE C6TBVAIN                           *
003128******************************************************************
003129 01  DCLC6TBVAIN.
003130*                       CDINDICE
003131     10 C6TBVAIN-CDINDICE    PIC X(5).
003132*                       DTINIZIO
003133     10 C6TBVAIN-DTINIZIO    PIC X(10).
003134*                       DTFINE
003135     10 C6TBVAIN-DTFINE      PIC X(10).
003136*                       NRVAL
003137     10 C6TBVAIN-NRVAL       PIC S9(18)V USAGE COMP-3.
003138*                       CDISTITU
003139     10 C6TBVAIN-CDISTITU    PIC X(5).
003140*                       TMSLOG
003141     10 C6TBVAIN-TMSLOG      PIC X(26).
003142*                       CDOPELOG
003143     10 C6TBVAIN-CDOPELOG    PIC X(8).
003144*                       CDPRFLOG
003145     10 C6TBVAIN-CDPRFLOG    PIC S9(4) USAGE COMP.
003146*                       CDENTLOG
003147     10 C6TBVAIN-CDENTLOG    PIC X(5).
003148*                       NRENTLOG
003149     10 C6TBVAIN-NRENTLOG    PIC S9(4) USAGE COMP.
003150******************************************************************
003151* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 10      *
003152******************************************************************
003153
003154*       EXEC SQL INCLUDE C6WINDD END-EXEC.
003155*---------------------------------------------------------------
003156* ALMAVIVA FINANCE S.P.A.
003157*
003158* PROGETTO_________:BKSCZI6
003159*
003160* DESC. PROGETTO___:CZI6 - CONDIZIONI RELEASE 6
003161*
003162* CLIENTE__________:BPOSTE
003163*
003164* DESC. CLIENTE____:BANCO POSTE
003165*
003166* MODULO MASTER____:C6WINDD
003167*
003168* MODULO CUSTOM____:C6WINDD
003169*
003170* VERSIONE MASTER__:V01_20080827_INDI
003171*
003172* MD5 MASTER_______:4D117BCFA5AAA1295DF0229E9A7E7A49
003173*
003174* VERSIONE CUSTOM__:V01_CPY_BPOSTE
003175*
003176*---------------------------------------------------------------
003177******************************************************************
003178* DCLGEN TABLE(C6TBINDI)                                         *
003179*        LIBRARY(BKSCZI6.SVILC60.COPY(C6WINDI))                  *
003180*        ACTION(REPLACE)                                         *
003181*        LANGUAGE(COBOL)                                         *
003182*        NAMES(C6TBINDI-)                                        *
003183*        QUOTE                                                   *
003184*        COLSUFFIX(YES)                                          *
003185* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
003186******************************************************************
003187  EXEC SQL DECLARE C6TBINDI TABLE
003188  ( CDINDICE                       CHAR(5) NOT NULL,
003189  DSIND                          VARCHAR(35) NOT NULL,
003190  DSINDBR                        VARCHAR(15) NOT NULL,
003191  NRPROGR                        SMALLINT NOT NULL,
003192  CDTPIND                        CHAR(1) NOT NULL,
003193  PCCALC1                        DECIMAL(5, 2) NOT NULL,
003194  CDINDRIF1                      CHAR(5) NOT NULL,
003195  PCCALC2                        DECIMAL(5, 2) NOT NULL,
003196  CDINDRIF2                      CHAR(5) NOT NULL,
003197  PCCALC3                        DECIMAL(5, 2) NOT NULL,
003198  CDINDRIF3                      CHAR(5) NOT NULL,
003199  PCCALC4                        DECIMAL(5, 2) NOT NULL,
003200  CDINDRIF4                      CHAR(5) NOT NULL,
003201  PCCALC5                        DECIMAL(5, 2) NOT NULL,
003202  CDINDRIF5                      CHAR(5) NOT NULL,
003203  CDTPFORM                       CHAR(1) NOT NULL,
003204  NRDECIM                        DECIMAL(2, 0) NOT NULL,
003205  NRDIMENS                       DECIMAL(2, 0) NOT NULL,
003206  CDSTATO                        CHAR(1) NOT NULL,
003207  CDISTITU                       CHAR(5) NOT NULL,
003208  TMSLOG                         TIMESTAMP NOT NULL,
003209  CDOPELOG                       CHAR(8) NOT NULL,
003210  CDPRFLOG                       SMALLINT NOT NULL,
003211  CDENTLOG                       CHAR(5) NOT NULL,
003212  NRENTLOG                       SMALLINT NOT NULL,
003213  CDCRT                          CHAR(30) NOT NULL,
003214  DTFINVAL                       DATE NOT NULL
003215  ) END-EXEC .
003216******************************************************************
003217* COBOL DECLARATION FOR TABLE C6TBINDI                           *
003218******************************************************************
003219 01  DCLC6TBINDI.
003220*                       CDINDICE
003221     10 C6TBINDI-CDINDICE    PIC X(5).
003222     10 C6TBINDI-DSIND.
003223*                       DSIND LENGTH
003224        49 C6TBINDI-DSIND-LEN  PIC S9(4) USAGE COMP.
003225*                       DSIND
003226        49 C6TBINDI-DSIND-TEXT  PIC X(35).
003227     10 C6TBINDI-DSINDBR.
003228*                       DSINDBR LENGTH
003229        49 C6TBINDI-DSINDBR-LEN  PIC S9(4) USAGE COMP.
003230*                       DSINDBR
003231        49 C6TBINDI-DSINDBR-TEXT  PIC X(15).
003232*                       NRPROGR
003233     10 C6TBINDI-NRPROGR     PIC S9(4) USAGE COMP.
003234*                       CDTPIND
003235     10 C6TBINDI-CDTPIND     PIC X(1).
003236*                       PCCALC1
003237     10 C6TBINDI-PCCALC1     PIC S9(3)V9(2) USAGE COMP-3.
003238*                       CDINDRIF1
003239     10 C6TBINDI-CDINDRIF1   PIC X(5).
003240*                       PCCALC2
003241     10 C6TBINDI-PCCALC2     PIC S9(3)V9(2) USAGE COMP-3.
003242*                       CDINDRIF2
003243     10 C6TBINDI-CDINDRIF2   PIC X(5).
003244*                       PCCALC3
003245     10 C6TBINDI-PCCALC3     PIC S9(3)V9(2) USAGE COMP-3.
003246*                       CDINDRIF3
003247     10 C6TBINDI-CDINDRIF3   PIC X(5).
003248*                       PCCALC4
003249     10 C6TBINDI-PCCALC4     PIC S9(3)V9(2) USAGE COMP-3.
003250*                       CDINDRIF4
003251     10 C6TBINDI-CDINDRIF4   PIC X(5).
003252*                       PCCALC5
003253     10 C6TBINDI-PCCALC5     PIC S9(3)V9(2) USAGE COMP-3.
003254*                       CDINDRIF5
003255     10 C6TBINDI-CDINDRIF5   PIC X(5).
003256*                       CDTPFORM
003257     10 C6TBINDI-CDTPFORM    PIC X(1).
003258*                       NRDECIM
003259     10 C6TBINDI-NRDECIM     PIC S9(2)V USAGE COMP-3.
003260*                       NRDIMENS
003261     10 C6TBINDI-NRDIMENS    PIC S9(2)V USAGE COMP-3.
003262*                       CDSTATO
003263     10 C6TBINDI-CDSTATO     PIC X(1).
003264*                       CDISTITU
003265     10 C6TBINDI-CDISTITU    PIC X(5).
003266*                       TMSLOG
003267     10 C6TBINDI-TMSLOG      PIC X(26).
003268*                       CDOPELOG
003269     10 C6TBINDI-CDOPELOG    PIC X(8).
003270*                       CDPRFLOG
003271     10 C6TBINDI-CDPRFLOG    PIC S9(4) USAGE COMP.
003272*                       CDENTLOG
003273     10 C6TBINDI-CDENTLOG    PIC X(5).
003274*                       NRENTLOG
003275     10 C6TBINDI-NRENTLOG    PIC S9(4) USAGE COMP.
003276*                       CDCRT
003277     10 C6TBINDI-CDCRT       PIC X(30).
003278*                       DTFINVAL
003279     10 C6TBINDI-DTFINVAL    PIC X(10).
003280******************************************************************
003281* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 27      *
003282******************************************************************
003283
003284*
003285  EXEC SQL DECLARE CD_CRQL CURSOR FOR
003286  SELECT CDTPQUA
003287  ,NRPRIOR
003288  FROM C6TBCRQL
003289  WHERE CDSERINT = :C6TBCRQL-CDSERINT
003290  ORDER BY NRPRIOR
003291  WITH UR
003292  END-EXEC 
003293*
003294  EXEC SQL DECLARE CD_QUALIF CURSOR FOR
003295  SELECT STQL.IDQUALIF
003296  FROM C6TBSTQL STQL,
003297  C6TBPRQL PRQL
003298  WHERE STQL.CDSERINT = :C6TBSTQL-CDSERINT
003299  AND STQL.CDVLPRQL1  IN (0,:C6TBSTQL-CDVLPRQL1)
003300  AND STQL.CDVLPRQL2  IN (0,:C6TBSTQL-CDVLPRQL2)
003301  AND STQL.CDVLPRQL3  IN (0,:C6TBSTQL-CDVLPRQL3)
003302  AND STQL.CDVLPRQL4  IN (0,:C6TBSTQL-CDVLPRQL4)
003303  AND STQL.CDVLPRQL5  IN (0,:C6TBSTQL-CDVLPRQL5)
003304  AND STQL.CDVLPRQL6  IN (0,:C6TBSTQL-CDVLPRQL6)
003305  AND STQL.CDVLPRQL7  IN (0,:C6TBSTQL-CDVLPRQL7)
003306  AND STQL.CDVLPRQL8  IN (0,:C6TBSTQL-CDVLPRQL8)
003307  AND STQL.CDVLPRQL9  IN (0,:C6TBSTQL-CDVLPRQL9)
003308  AND STQL.CDVLPRQL10 IN (0,:C6TBSTQL-CDVLPRQL10)
003309  AND PRQL.CDSERINT = STQL.CDSERINT
003310  AND PRQL.CDFORMA  = STQL.CDFORMA
003311  WITH UR
003312  END-EXEC 
003313*
003314  EXEC SQL DECLARE CD_LCOG CURSOR FOR
003315  SELECT LCOG.CDOGGETT
003316  ,CHAR(LCOG.DTINIZIO, ISO)
003317  ,CHAR(LCOG.DTFINE, ISO)
003318  ,STC2.CDCOMB
003319  FROM C6TBOGCZ OGCZ,
003320  C6TBLCOG LCOG,
003321  C6TBSTCB STC1,
003322  C6TBSTCB STC2,
003323  C6TBPRFM PRF2
003324  WHERE  OGCZ.CDOGGEST  = :C6TBOGCZ-CDOGGEST
003325  AND  LCOG.CDSERINT  = :C6TBLCOG-CDSERINT
003326  AND  LCOG.DTINIZIO <= :C6TBLCOG-DTFINE
003327  AND  LCOG.DTFINE   >= :C6TBLCOG-DTINIZIO
003328  AND  OGCZ.CDOGGETT  = LCOG.CDOGGETT
003329  AND  LCOG.CDCOMB    = STC1.CDCOMB
003330  AND (STC2.CDGRP1    = STC1.CDGRP1
003331  OR   STC2.CDGRP1    = 0)
003332  AND (STC2.CDGRP2    = STC1.CDGRP2
003333  OR   STC2.CDGRP2    = 0)
003334  AND (STC2.CDGRP3    = STC1.CDGRP3
003335  OR   STC2.CDGRP3    = 0)
003336  AND (STC2.CDGRP4    = STC1.CDGRP4
003337  OR   STC2.CDGRP4    = 0)
003338  AND (STC2.CDGRP5    = STC1.CDGRP5
003339  OR   STC2.CDGRP5    = 0)
003340  AND  PRF2.CDSERINT  = LCOG.CDSERINT
003341  AND  PRF2.CDFORMA   = STC2.CDFORMA
003342  ORDER BY LCOG.DTINIZIO
003343  WITH UR
003344  END-EXEC 
003345*
003346  EXEC SQL DECLARE CD_CVOG CURSOR FOR
003347  SELECT CDCNV
003348  ,CHAR(DTINIZIO, ISO)
003349  ,CHAR(DTFINE, ISO)
003350  FROM C6TBCVOG
003351  WHERE CDSERINT  = :C6TBCVOG-CDSERINT
003352  AND CDOGGETT  = :C6TBCVOG-CDOGGETT
003353  AND DTINIZIO <= :C6TBCVOG-DTFINE
003354  AND DTFINE   >= :C6TBCVOG-DTINIZIO
003355  ORDER BY DTINIZIO ASC
003356  WITH UR
003357  END-EXEC 
003358*
003359  EXEC SQL DECLARE CD_CRTZ CURSOR FOR
003360  SELECT CDTPGRP
003361  ,NRPRIOR
003362  FROM C6TBCRTZ
003363  WHERE CDSERINT = :C6TBCRTZ-CDSERINT
003364  ORDER BY NRPRIOR
003365  WITH UR
003366  END-EXEC 
003367*
003368  EXEC SQL DECLARE CD_LISTIN CURSOR FOR
003369  SELECT STCB.CDCOMB
003370  FROM C6TBSTCB STCB,
003371  C6TBPRFM PRFM
003372  WHERE STCB.CDGRP1  IN (0,:C6TBSTCB-CDGRP1)
003373  AND STCB.CDGRP2  IN (0,:C6TBSTCB-CDGRP2)
003374  AND STCB.CDGRP3  IN (0,:C6TBSTCB-CDGRP3)
003375  AND STCB.CDGRP4  IN (0,:C6TBSTCB-CDGRP4)
003376  AND STCB.CDGRP5  IN (0,:C6TBSTCB-CDGRP5)
003377  AND PRFM.CDSERINT = :C6TBPRFM-CDSERINT
003378  AND PRFM.CDFORMA  = STCB.CDFORMA
003379  WITH UR
003380  END-EXEC 
003381*
003382  EXEC SQL DECLARE CD_LISTA CURSOR FOR
003383  SELECT ELCZ.NRPRELEM
003384  ,CDZI.IDCDZ
003385  ,CDZI.DSCDZBR
003386  ,CZCO.NRPRIOR
003387  ,CZCO.IDCOMP
003388  ,CZCO.DSLEGBR
003389  ,CDZI.CDNATCDZ
003390  ,COMP.CDTPFORM
003391  ,COMP.NRDECIM
003392  ,COMP.NRDIMENS
003393  ,CZCO.CDSPREAD
003394  ,CZCO.CDCALCSPR
003395  ,CZCO.CDESTREM
003396  ,CZCO.SNSUPSTD
003397  ,CDZI.CDTPCAR
003398  FROM C6TBLSCZ LSCZ,
003399  C6TBELCZ ELCZ,
003400  C6TBCDZI CDZI,
003401  C6TBCZCO CZCO,
003402  C6TBCOMP COMP
003403  WHERE LSCZ.CDTPLST  = :C6TBLSCZ-CDTPLST
003404  AND LSCZ.CDLISTA  = :C6TBLSCZ-CDLISTA
003405  AND LSCZ.CDTPLST  = ELCZ.CDTPLST
003406  AND LSCZ.CDLISTA  = ELCZ.CDLISTA
003407  AND ELCZ.IDCONDIZ = CDZI.IDCDZ
003408  AND ELCZ.IDCONDIZ = CZCO.IDCDZ
003409  AND CZCO.IDCOMPEL = COMP.IDCOMPEL
003410  ORDER BY ELCZ.NRPRELEM, CZCO.NRPRIOR
003411  WITH UR
003412  END-EXEC 
003413*
003414  EXEC SQL DECLARE CD_CDZCMP CURSOR FOR
003415  SELECT CDZI.IDCDZ
003416  ,CDZI.DSCDZBR
003417  ,CZCO.NRPRIOR
003418  ,CZCO.IDCOMP
003419  ,CZCO.DSLEGBR
003420  ,CDZI.CDNATCDZ
003421  ,COMP.CDTPFORM
003422  ,COMP.NRDECIM
003423  ,COMP.NRDIMENS
003424  ,CZCO.CDSPREAD
003425  ,CZCO.CDCALCSPR
003426  ,CZCO.CDESTREM
003427  ,CZCO.SNSUPSTD
003428  ,CDZI.CDTPCAR
003429  FROM C6TBCDZI CDZI,
003430  C6TBCZCO CZCO,
003431  C6TBCOMP COMP
003432  WHERE CDZI.DSCDZBR  = :C6TBCDZI-DSCDZBR
003433  AND CDZI.CDSERINT = :C6TBCDZI-CDSERINT
003434  AND CDZI.IDCDZ    = CZCO.IDCDZ
003435  AND CZCO.IDCOMPEL = COMP.IDCOMPEL
003436  ORDER BY CZCO.NRPRIOR
003437  WITH UR
003438  END-EXEC 
003439*
003440  EXEC SQL DECLARE CD_VALOGG CURSOR FOR
003441  SELECT CHAR(VAOG.DTINIZIO, ISO)
003442  ,CHAR(VAOG.DTFINE, ISO)
003443  ,VAOG.CDVALALF
003444  ,VAOG.CDVALNUM
003445  ,PRQL.NRPRIOR
003446  FROM C6TBVAOG VAOG,
003447  C6TBSTQL STQL,
003448  C6TBPRQL PRQL
003449  WHERE VAOG.CDOGGETT  = :C6TBVAOG-CDOGGETT
003450  AND VAOG.CDSERINT  = :C6TBVAOG-CDSERINT
003451  AND VAOG.IDCDZ     = :C6TBVAOG-IDCDZ
003452  AND VAOG.IDCOMPON  = :C6TBVAOG-IDCOMPON
003453  AND VAOG.DTINIZIO <= :C6TBVAOG-DTFINE
003454  AND VAOG.DTFINE   >= :C6TBVAOG-DTINIZIO
003455  AND VAOG.CDSTATO   = 'A'
003456  AND VAOG.IDQUALIF  = STQL.IDQUALIF
003457  AND VAOG.CDSERINT  = STQL.CDSERINT
003458  AND PRQL.CDSERINT  = STQL.CDSERINT
003459  AND PRQL.CDFORMA   = STQL.CDFORMA
003460  AND VAOG.IDQUALIF IN(
003461  :WQ-IDQUALIF1 , :WQ-IDQUALIF2 , :WQ-IDQUALIF3
003462  ,:WQ-IDQUALIF4 , :WQ-IDQUALIF5 , :WQ-IDQUALIF6
003463  ,:WQ-IDQUALIF7 , :WQ-IDQUALIF8 , :WQ-IDQUALIF9
003464  ,:WQ-IDQUALIF10, :WQ-IDQUALIF11, :WQ-IDQUALIF12
003465  ,:WQ-IDQUALIF13, :WQ-IDQUALIF14, :WQ-IDQUALIF15
003466  ,:WQ-IDQUALIF16, :WQ-IDQUALIF17, :WQ-IDQUALIF18
003467  ,:WQ-IDQUALIF19, :WQ-IDQUALIF20, :WQ-IDQUALIF21
003468  ,:WQ-IDQUALIF22, :WQ-IDQUALIF23, :WQ-IDQUALIF24
003469  ,:WQ-IDQUALIF25, :WQ-IDQUALIF26, :WQ-IDQUALIF27
003470  ,:WQ-IDQUALIF28, :WQ-IDQUALIF29, :WQ-IDQUALIF30
003471  ,:WQ-IDQUALIF31, :WQ-IDQUALIF32, :WQ-IDQUALIF33
003472  ,:WQ-IDQUALIF34, :WQ-IDQUALIF35, :WQ-IDQUALIF36
003473  ,:WQ-IDQUALIF37, :WQ-IDQUALIF38, :WQ-IDQUALIF39
003474  ,:WQ-IDQUALIF40, :WQ-IDQUALIF41, :WQ-IDQUALIF42
003475  ,:WQ-IDQUALIF43, :WQ-IDQUALIF44, :WQ-IDQUALIF45
003476  ,:WQ-IDQUALIF46, :WQ-IDQUALIF47, :WQ-IDQUALIF48
003477  ,:WQ-IDQUALIF49, :WQ-IDQUALIF50)
003478  UNION ALL
003479  SELECT CHAR(VAOG.DTINIZIO, ISO)
003480  ,CHAR(VAOG.DTFINE, ISO)
003481  ,VAOG.CDVALALF
003482  ,VAOG.CDVALNUM
003483  ,0
003484  FROM C6TBVAOG VAOG
003485  WHERE VAOG.CDOGGETT  = :C6TBVAOG-CDOGGETT
003486  AND VAOG.CDSERINT  = :C6TBVAOG-CDSERINT
003487  AND VAOG.IDCDZ     = :C6TBVAOG-IDCDZ
003488  AND VAOG.IDCOMPON  = :C6TBVAOG-IDCOMPON
003489  AND VAOG.DTINIZIO <= :C6TBVAOG-DTFINE
003490  AND VAOG.DTFINE   >= :C6TBVAOG-DTINIZIO
003491  AND VAOG.CDSTATO   = 'A'
003492  AND VAOG.IDQUALIF  = 0
003493  ORDER BY 5 DESC, 1 ASC
003494  WITH UR
003495  END-EXEC 
003496*
003497  EXEC SQL DECLARE CD_VALSUB CURSOR FOR
003498  SELECT CHAR(VASG.DTINIZIO, ISO)
003499  ,CHAR(VASG.DTFINE, ISO)
003500  ,VASG.CDVALALF
003501  ,VASG.CDVALNUM
003502  ,PRQL.NRPRIOR
003503  FROM C6TBVASG VASG,
003504  C6TBSTQL STQL,
003505  C6TBPRQL PRQL
003506  WHERE VASG.CDSUBOGG  = :C6TBVASG-CDSUBOGG
003507  AND VASG.CDOGGETT  = :C6TBVASG-CDOGGETT
003508  AND VASG.CDSERINT  = :C6TBVASG-CDSERINT
003509  AND VASG.IDCDZ     = :C6TBVASG-IDCDZ
003510  AND VASG.IDCOMPON  = :C6TBVASG-IDCOMPON
003511  AND VASG.DTINIZIO <= :C6TBVASG-DTFINE
003512  AND VASG.DTFINE   >= :C6TBVASG-DTINIZIO
003513  AND VASG.CDSTATO   = 'A'
003514  AND VASG.IDQUALIF  = STQL.IDQUALIF
003515  AND VASG.CDSERINT  = STQL.CDSERINT
003516  AND PRQL.CDSERINT  = STQL.CDSERINT
003517  AND PRQL.CDFORMA   = STQL.CDFORMA
003518  AND VASG.IDQUALIF IN(
003519  :WQ-IDQUALIF1 , :WQ-IDQUALIF2 , :WQ-IDQUALIF3
003520  ,:WQ-IDQUALIF4 , :WQ-IDQUALIF5 , :WQ-IDQUALIF6
003521  ,:WQ-IDQUALIF7 , :WQ-IDQUALIF8 , :WQ-IDQUALIF9
003522  ,:WQ-IDQUALIF10, :WQ-IDQUALIF11, :WQ-IDQUALIF12
003523  ,:WQ-IDQUALIF13, :WQ-IDQUALIF14, :WQ-IDQUALIF15
003524  ,:WQ-IDQUALIF16, :WQ-IDQUALIF17, :WQ-IDQUALIF18
003525  ,:WQ-IDQUALIF19, :WQ-IDQUALIF20, :WQ-IDQUALIF21
003526  ,:WQ-IDQUALIF22, :WQ-IDQUALIF23, :WQ-IDQUALIF24
003527  ,:WQ-IDQUALIF25, :WQ-IDQUALIF26, :WQ-IDQUALIF27
003528  ,:WQ-IDQUALIF28, :WQ-IDQUALIF29, :WQ-IDQUALIF30
003529  ,:WQ-IDQUALIF31, :WQ-IDQUALIF32, :WQ-IDQUALIF33
003530  ,:WQ-IDQUALIF34, :WQ-IDQUALIF35, :WQ-IDQUALIF36
003531  ,:WQ-IDQUALIF37, :WQ-IDQUALIF38, :WQ-IDQUALIF39
003532  ,:WQ-IDQUALIF40, :WQ-IDQUALIF41, :WQ-IDQUALIF42
003533  ,:WQ-IDQUALIF43, :WQ-IDQUALIF44, :WQ-IDQUALIF45
003534  ,:WQ-IDQUALIF46, :WQ-IDQUALIF47, :WQ-IDQUALIF48
003535  ,:WQ-IDQUALIF49, :WQ-IDQUALIF50)
003536  UNION ALL
003537  SELECT CHAR(VASG.DTINIZIO, ISO)
003538  ,CHAR(VASG.DTFINE, ISO)
003539  ,VASG.CDVALALF
003540  ,VASG.CDVALNUM
003541  ,0
003542  FROM C6TBVASG VASG
003543  WHERE VASG.CDSUBOGG  = :C6TBVASG-CDSUBOGG
003544  AND VASG.CDOGGETT  = :C6TBVASG-CDOGGETT
003545  AND VASG.CDSERINT  = :C6TBVASG-CDSERINT
003546  AND VASG.IDCDZ     = :C6TBVASG-IDCDZ
003547  AND VASG.IDCOMPON  = :C6TBVASG-IDCOMPON
003548  AND VASG.DTINIZIO <= :C6TBVASG-DTFINE
003549  AND VASG.DTFINE   >= :C6TBVASG-DTINIZIO
003550  AND VASG.CDSTATO   = 'A'
003551  AND VASG.IDQUALIF  = 0
003552  *>  ORDER BY PRQL.NRPRIOR, VASG.DTINIZIO
003553  ORDER BY 5 DESC, 1 ASC
003554  WITH UR
003555  END-EXEC 
003556*
003557  EXEC SQL DECLARE CD_VALCNV CURSOR FOR
003558  SELECT CHAR(VACN.DTINIZIO, ISO)
003559  , CHAR(VACN.DTFINE, ISO)
003560  , VACN.CDVALALF
003561  , VACN.CDVALNUM
003562  , TPCN.NRPRIOR
003563  , PRQL.NRPRIOR
003564  FROM C6TBVACN VACN,
003565  C6TBACNV ACNV,
003566  C6TBTPCN TPCN,
003567  C6TBSTQL STQL,
003568  C6TBPRQL PRQL
003569  WHERE VACN.CDCNV IN(
003570  :C6TBVACN-CDCNV1, :C6TBVACN-CDCNV2,
003571  :C6TBVACN-CDCNV3, :C6TBVACN-CDCNV4,
003572  :C6TBVACN-CDCNV5, :C6TBVACN-CDCNV6,
003573  :C6TBVACN-CDCNV7, :C6TBVACN-CDCNV8,
003574  :C6TBVACN-CDCNV9, :C6TBVACN-CDCNV10)
003575  AND VACN.CDSERINT  = :C6TBVACN-CDSERINT
003576  AND VACN.IDCDZ     = :C6TBVACN-IDCDZ
003577  AND VACN.IDCOMPON  = :C6TBVACN-IDCOMPON
003578  AND VACN.DTINIZIO <= :C6TBVACN-DTFINE
003579  AND VACN.DTFINE   >= :C6TBVACN-DTINIZIO
003580  AND VACN.CDSTATO   = 'A'
003581  AND VACN.CDCNV     = ACNV.CDCNV
003582  AND ACNV.CDTPCNV   = TPCN.CDTPCNV
003583  AND VACN.CDSERINT  = STQL.CDSERINT
003584  AND VACN.IDQUALIF  = STQL.IDQUALIF
003585  AND PRQL.CDSERINT  = STQL.CDSERINT
003586  AND PRQL.CDFORMA   = STQL.CDFORMA
003587  AND VACN.IDQUALIF IN(
003588  :WQ-IDQUALIF1 , :WQ-IDQUALIF2 , :WQ-IDQUALIF3
003589  ,:WQ-IDQUALIF4 , :WQ-IDQUALIF5 , :WQ-IDQUALIF6
003590  ,:WQ-IDQUALIF7 , :WQ-IDQUALIF8 , :WQ-IDQUALIF9
003591  ,:WQ-IDQUALIF10, :WQ-IDQUALIF11, :WQ-IDQUALIF12
003592  ,:WQ-IDQUALIF13, :WQ-IDQUALIF14, :WQ-IDQUALIF15
003593  ,:WQ-IDQUALIF16, :WQ-IDQUALIF17, :WQ-IDQUALIF18
003594  ,:WQ-IDQUALIF19, :WQ-IDQUALIF20, :WQ-IDQUALIF21
003595  ,:WQ-IDQUALIF22, :WQ-IDQUALIF23, :WQ-IDQUALIF24
003596  ,:WQ-IDQUALIF25, :WQ-IDQUALIF26, :WQ-IDQUALIF27
003597  ,:WQ-IDQUALIF28, :WQ-IDQUALIF29, :WQ-IDQUALIF30
003598  ,:WQ-IDQUALIF31, :WQ-IDQUALIF32, :WQ-IDQUALIF33
003599  ,:WQ-IDQUALIF34, :WQ-IDQUALIF35, :WQ-IDQUALIF36
003600  ,:WQ-IDQUALIF37, :WQ-IDQUALIF38, :WQ-IDQUALIF39
003601  ,:WQ-IDQUALIF40, :WQ-IDQUALIF41, :WQ-IDQUALIF42
003602  ,:WQ-IDQUALIF43, :WQ-IDQUALIF44, :WQ-IDQUALIF45
003603  ,:WQ-IDQUALIF46, :WQ-IDQUALIF47, :WQ-IDQUALIF48
003604  ,:WQ-IDQUALIF49, :WQ-IDQUALIF50)
003605  UNION  ALL
003606  SELECT CHAR(VACN.DTINIZIO, ISO)
003607  , CHAR(VACN.DTFINE, ISO)
003608  , VACN.CDVALALF
003609  , VACN.CDVALNUM
003610  , TPCN.NRPRIOR
003611  , 0
003612  FROM C6TBVACN VACN,
003613  C6TBACNV ACNV,
003614  C6TBTPCN TPCN
003615  WHERE VACN.CDCNV IN(
003616  :C6TBVACN-CDCNV1, :C6TBVACN-CDCNV2,
003617  :C6TBVACN-CDCNV3, :C6TBVACN-CDCNV4,
003618  :C6TBVACN-CDCNV5, :C6TBVACN-CDCNV6,
003619  :C6TBVACN-CDCNV7, :C6TBVACN-CDCNV8,
003620  :C6TBVACN-CDCNV9, :C6TBVACN-CDCNV10)
003621  AND VACN.CDSERINT  = :C6TBVACN-CDSERINT
003622  AND VACN.IDCDZ     = :C6TBVACN-IDCDZ
003623  AND VACN.IDCOMPON  = :C6TBVACN-IDCOMPON
003624  AND VACN.DTINIZIO <= :C6TBVACN-DTFINE
003625  AND VACN.DTFINE   >= :C6TBVACN-DTINIZIO
003626  AND VACN.CDSTATO   = 'A'
003627  AND VACN.IDQUALIF  = 0
003628  AND VACN.CDCNV     = ACNV.CDCNV
003629  AND ACNV.CDTPCNV   = TPCN.CDTPCNV
003630  ORDER BY 5 DESC, 6 DESC, 1 ASC
003631  WITH UR
003632  END-EXEC 
003633*
003634  EXEC SQL DECLARE CD_VALLST CURSOR FOR
003635  SELECT CHAR(VACB.DTINIZIO, ISO)
003636  , CHAR(VACB.DTFINE, ISO)
003637  , VACB.CDVALALF
003638  , VACB.CDVALNUM
003639  , PRFM.NRPRIOR
003640  , PRQL.NRPRIOR
003641  FROM C6TBVACB VACB,
003642  C6TBSTCB STCB,
003643  C6TBPRFM PRFM,
003644  C6TBSTQL STQL,
003645  C6TBPRQL PRQL
003646  WHERE VACB.IDCDZ     = :C6TBVACB-IDCDZ
003647  AND VACB.IDCOMPON  = :C6TBVACB-IDCOMPON
003648  AND VACB.DTINIZIO <= :C6TBVACB-DTFINE
003649  AND VACB.DTFINE   >= :C6TBVACB-DTINIZIO
003650  AND VACB.CDSTATO   = 'A'
003651  AND VACB.CDCOMB    = STCB.CDCOMB
003652  AND PRFM.CDSERINT  = :C6TBPRFM-CDSERINT
003653  AND PRFM.CDFORMA   = STCB.CDFORMA
003654  AND VACB.CDCOMB IN(
003655  :WL-CDCOMB1 , :WL-CDCOMB2 , :WL-CDCOMB3
003656  ,:WL-CDCOMB4 , :WL-CDCOMB5 , :WL-CDCOMB6
003657  ,:WL-CDCOMB7 , :WL-CDCOMB8 , :WL-CDCOMB9
003658  ,:WL-CDCOMB10)
003659  AND VACB.IDQUALIF  = STQL.IDQUALIF
003660  AND PRQL.CDSERINT  = STQL.CDSERINT
003661  AND PRQL.CDFORMA   = STQL.CDFORMA
003662  AND VACB.IDQUALIF IN(
003663  :WQ-IDQUALIF1 , :WQ-IDQUALIF2 , :WQ-IDQUALIF3
003664  ,:WQ-IDQUALIF4 , :WQ-IDQUALIF5 , :WQ-IDQUALIF6
003665  ,:WQ-IDQUALIF7 , :WQ-IDQUALIF8 , :WQ-IDQUALIF9
003666  ,:WQ-IDQUALIF10, :WQ-IDQUALIF11, :WQ-IDQUALIF12
003667  ,:WQ-IDQUALIF13, :WQ-IDQUALIF14, :WQ-IDQUALIF15
003668  ,:WQ-IDQUALIF16, :WQ-IDQUALIF17, :WQ-IDQUALIF18
003669  ,:WQ-IDQUALIF19, :WQ-IDQUALIF20, :WQ-IDQUALIF21
003670  ,:WQ-IDQUALIF22, :WQ-IDQUALIF23, :WQ-IDQUALIF24
003671  ,:WQ-IDQUALIF25, :WQ-IDQUALIF26, :WQ-IDQUALIF27
003672  ,:WQ-IDQUALIF28, :WQ-IDQUALIF29, :WQ-IDQUALIF30
003673  ,:WQ-IDQUALIF31, :WQ-IDQUALIF32, :WQ-IDQUALIF33
003674  ,:WQ-IDQUALIF34, :WQ-IDQUALIF35, :WQ-IDQUALIF36
003675  ,:WQ-IDQUALIF37, :WQ-IDQUALIF38, :WQ-IDQUALIF39
003676  ,:WQ-IDQUALIF40, :WQ-IDQUALIF41, :WQ-IDQUALIF42
003677  ,:WQ-IDQUALIF43, :WQ-IDQUALIF44, :WQ-IDQUALIF45
003678  ,:WQ-IDQUALIF46, :WQ-IDQUALIF47, :WQ-IDQUALIF48
003679  ,:WQ-IDQUALIF49, :WQ-IDQUALIF50)
003680  UNION ALL
003681  SELECT CHAR(VACB.DTINIZIO, ISO)
003682  , CHAR(VACB.DTFINE, ISO)
003683  , VACB.CDVALALF
003684  , VACB.CDVALNUM
003685  , PRFM.NRPRIOR
003686  , 0
003687  FROM C6TBVACB VACB,
003688  C6TBSTCB STCB,
003689  C6TBPRFM PRFM
003690  WHERE VACB.IDCDZ     = :C6TBVACB-IDCDZ
003691  AND VACB.IDCOMPON  = :C6TBVACB-IDCOMPON
003692  AND VACB.DTINIZIO <= :C6TBVACB-DTFINE
003693  AND VACB.DTFINE   >= :C6TBVACB-DTINIZIO
003694  AND VACB.CDSTATO   = 'A'
003695  AND VACB.IDQUALIF  = 0
003696  AND VACB.CDCOMB    = STCB.CDCOMB
003697  AND PRFM.CDSERINT  = :C6TBPRFM-CDSERINT
003698  AND PRFM.CDFORMA   = STCB.CDFORMA
003699  AND VACB.CDCOMB IN(
003700  :WL-CDCOMB1 , :WL-CDCOMB2 , :WL-CDCOMB3
003701  ,:WL-CDCOMB4 , :WL-CDCOMB5 , :WL-CDCOMB6
003702  ,:WL-CDCOMB7 , :WL-CDCOMB8 , :WL-CDCOMB9
003703  ,:WL-CDCOMB10)
003704  ORDER BY 5 DESC, 6 DESC, 1 ASC
003705  WITH UR
003706  END-EXEC 
003707*
003708  EXEC SQL DECLARE CD_VALLST_SPR CURSOR FOR
003709  SELECT VILS.CDINDICE
003710  , CHAR(VILS.DTINIZIO, ISO)
003711  , CHAR(VILS.DTFINE, ISO)
003712  , VILS.DSVAL
003713  , VILS.NRVAL
003714  , PRFM.NRPRIOR
003715  , PRQL.NRPRIOR
003716  FROM C6TBVILS VILS,
003717  C6TBSTCB STCB,
003718  C6TBPRFM PRFM,
003719  C6TBSTQL STQL,
003720  C6TBPRQL PRQL
003721  WHERE VILS.IDCDZ     = :C6TBVILS-IDCDZ
003722  AND VILS.IDCOMP    = :C6TBVILS-IDCOMP
003723  AND VILS.DTINIZIO <= :C6TBVILS-DTFINE
003724  AND VILS.DTFINE   >= :C6TBVILS-DTINIZIO
003725  AND VILS.CDSTATO   = 'A'
003726  AND VILS.CDCOMB    = STCB.CDCOMB
003727  AND PRFM.CDSERINT  = :C6TBPRFM-CDSERINT
003728  AND PRFM.CDFORMA   = STCB.CDFORMA
003729  AND VILS.CDCOMB IN(
003730  :WL-CDCOMB1 , :WL-CDCOMB2 , :WL-CDCOMB3
003731  ,:WL-CDCOMB4 , :WL-CDCOMB5 , :WL-CDCOMB6
003732  ,:WL-CDCOMB7 , :WL-CDCOMB8 , :WL-CDCOMB9
003733  ,:WL-CDCOMB10)
003734  AND VILS.IDQUALIF  = STQL.IDQUALIF
003735  AND PRQL.CDSERINT  = STQL.CDSERINT
003736  AND PRQL.CDFORMA   = STQL.CDFORMA
003737  AND VILS.IDQUALIF IN(
003738  :WQ-IDQUALIF1 , :WQ-IDQUALIF2 , :WQ-IDQUALIF3
003739  ,:WQ-IDQUALIF4 , :WQ-IDQUALIF5 , :WQ-IDQUALIF6
003740  ,:WQ-IDQUALIF7 , :WQ-IDQUALIF8 , :WQ-IDQUALIF9
003741  ,:WQ-IDQUALIF10, :WQ-IDQUALIF11, :WQ-IDQUALIF12
003742  ,:WQ-IDQUALIF13, :WQ-IDQUALIF14, :WQ-IDQUALIF15
003743  ,:WQ-IDQUALIF16, :WQ-IDQUALIF17, :WQ-IDQUALIF18
003744  ,:WQ-IDQUALIF19, :WQ-IDQUALIF20, :WQ-IDQUALIF21
003745  ,:WQ-IDQUALIF22, :WQ-IDQUALIF23, :WQ-IDQUALIF24
003746  ,:WQ-IDQUALIF25, :WQ-IDQUALIF26, :WQ-IDQUALIF27
003747  ,:WQ-IDQUALIF28, :WQ-IDQUALIF29, :WQ-IDQUALIF30
003748  ,:WQ-IDQUALIF31, :WQ-IDQUALIF32, :WQ-IDQUALIF33
003749  ,:WQ-IDQUALIF34, :WQ-IDQUALIF35, :WQ-IDQUALIF36
003750  ,:WQ-IDQUALIF37, :WQ-IDQUALIF38, :WQ-IDQUALIF39
003751  ,:WQ-IDQUALIF40, :WQ-IDQUALIF41, :WQ-IDQUALIF42
003752  ,:WQ-IDQUALIF43, :WQ-IDQUALIF44, :WQ-IDQUALIF45
003753  ,:WQ-IDQUALIF46, :WQ-IDQUALIF47, :WQ-IDQUALIF48
003754  ,:WQ-IDQUALIF49, :WQ-IDQUALIF50)
003755  UNION ALL
003756  SELECT VILS.CDINDICE
003757  , CHAR(VILS.DTINIZIO, ISO)
003758  , CHAR(VILS.DTFINE, ISO)
003759  , VILS.DSVAL
003760  , VILS.NRVAL
003761  , PRFM.NRPRIOR
003762  , 0
003763  FROM C6TBVILS VILS,
003764  C6TBSTCB STCB,
003765  C6TBPRFM PRFM
003766  WHERE VILS.IDCDZ     = :C6TBVILS-IDCDZ
003767  AND VILS.IDCOMP    = :C6TBVILS-IDCOMP
003768  AND VILS.DTINIZIO <= :C6TBVILS-DTFINE
003769  AND VILS.DTFINE   >= :C6TBVILS-DTINIZIO
003770  AND VILS.CDSTATO   = 'A'
003771  AND VILS.IDQUALIF  = 0
003772  AND VILS.CDCOMB    = STCB.CDCOMB
003773  AND PRFM.CDSERINT  = :C6TBPRFM-CDSERINT
003774  AND PRFM.CDFORMA   = STCB.CDFORMA
003775  AND VILS.CDCOMB IN(
003776  :WL-CDCOMB1 , :WL-CDCOMB2 , :WL-CDCOMB3
003777  ,:WL-CDCOMB4 , :WL-CDCOMB5 , :WL-CDCOMB6
003778  ,:WL-CDCOMB7 , :WL-CDCOMB8 , :WL-CDCOMB9
003779  ,:WL-CDCOMB10)
003780  *>  PRIORITA' LISTINO, PRIORITA' QUALIFICATORE, DATA INIZIO
003781  ORDER BY 6 DESC, 7 DESC, 2 ASC, 1 ASC
003782  WITH UR
003783  END-EXEC 
003784*
003785  EXEC SQL DECLARE CD_VALIST CURSOR FOR
003786  SELECT CHAR(VISN.DTINIZIO, ISO)
003787  , CHAR(VISN.DTFINE, ISO)
003788  , VISN.DSVAL
003789  , VISN.NRVAL
003790  , PRQL.NRPRIOR
003791  FROM C6TBVISN VISN,
003792  C6TBSTQL STQL,
003793  C6TBPRQL PRQL
003794  WHERE VISN.IDCDZ     = :C6TBVISN-IDCDZ
003795  AND VISN.IDCOMP    = :C6TBVISN-IDCOMP
003796  AND VISN.DTINIZIO <= :C6TBVISN-DTFINE
003797  AND VISN.DTFINE   >= :C6TBVISN-DTINIZIO
003798  AND VISN.CDSTATO   = 'A'
003799  AND VISN.IDQUALIF  = STQL.IDQUALIF
003800  AND PRQL.CDFORMA   = STQL.CDFORMA
003801  AND PRQL.CDSERINT  = STQL.CDSERINT
003802  AND PRQL.CDSERINT  = :C6TBVISN-CDSERINT
003803  AND VISN.IDQUALIF IN(
003804  :WQ-IDQUALIF1 , :WQ-IDQUALIF2 , :WQ-IDQUALIF3
003805  ,:WQ-IDQUALIF4 , :WQ-IDQUALIF5 , :WQ-IDQUALIF6
003806  ,:WQ-IDQUALIF7 , :WQ-IDQUALIF8 , :WQ-IDQUALIF9
003807  ,:WQ-IDQUALIF10, :WQ-IDQUALIF11, :WQ-IDQUALIF12
003808  ,:WQ-IDQUALIF13, :WQ-IDQUALIF14, :WQ-IDQUALIF15
003809  ,:WQ-IDQUALIF16, :WQ-IDQUALIF17, :WQ-IDQUALIF18
003810  ,:WQ-IDQUALIF19, :WQ-IDQUALIF20, :WQ-IDQUALIF21
003811  ,:WQ-IDQUALIF22, :WQ-IDQUALIF23, :WQ-IDQUALIF24
003812  ,:WQ-IDQUALIF25, :WQ-IDQUALIF26, :WQ-IDQUALIF27
003813  ,:WQ-IDQUALIF28, :WQ-IDQUALIF29, :WQ-IDQUALIF30
003814  ,:WQ-IDQUALIF31, :WQ-IDQUALIF32, :WQ-IDQUALIF33
003815  ,:WQ-IDQUALIF34, :WQ-IDQUALIF35, :WQ-IDQUALIF36
003816  ,:WQ-IDQUALIF37, :WQ-IDQUALIF38, :WQ-IDQUALIF39
003817  ,:WQ-IDQUALIF40, :WQ-IDQUALIF41, :WQ-IDQUALIF42
003818  ,:WQ-IDQUALIF43, :WQ-IDQUALIF44, :WQ-IDQUALIF45
003819  ,:WQ-IDQUALIF46, :WQ-IDQUALIF47, :WQ-IDQUALIF48
003820  ,:WQ-IDQUALIF49, :WQ-IDQUALIF50)
003821  UNION ALL
003822  SELECT CHAR(VISN.DTINIZIO, ISO)
003823  , CHAR(VISN.DTFINE, ISO)
003824  , VISN.DSVAL
003825  , VISN.NRVAL
003826  , 0
003827  FROM C6TBVISN VISN
003828  WHERE VISN.IDCDZ     = :C6TBVISN-IDCDZ
003829  AND VISN.IDCOMP    = :C6TBVISN-IDCOMP
003830  AND VISN.DTINIZIO <= :C6TBVISN-DTFINE
003831  AND VISN.DTFINE   >= :C6TBVISN-DTINIZIO
003832  AND VISN.CDSTATO   = 'A'
003833  AND VISN.IDQUALIF  = 0
003834  ORDER BY 5 DESC, 1 ASC
003835  WITH UR
003836  END-EXEC 
003837*
003838  EXEC SQL DECLARE CD_VALIST_SPR CURSOR FOR
003839  SELECT VISS.CDINDICE
003840  , CHAR(VISS.DTINIZIO, ISO)
003841  , CHAR(VISS.DTFINE, ISO)
003842  , VISS.DSVAL
003843  , VISS.NRVAL
003844  , PRQL.NRPRIOR
003845  FROM C6TBVISS VISS,
003846  C6TBSTQL STQL,
003847  C6TBPRQL PRQL
003848  WHERE VISS.IDCDZ     = :C6TBVISS-IDCDZ
003849  AND VISS.IDCOMP    = :C6TBVISS-IDCOMP
003850  AND VISS.DTINIZIO <= :C6TBVISS-DTFINE
003851  AND VISS.DTFINE   >= :C6TBVISS-DTINIZIO
003852  AND VISS.CDSTATO   = 'A'
003853  AND VISS.IDQUALIF  = STQL.IDQUALIF
003854  AND PRQL.CDFORMA   = STQL.CDFORMA
003855  AND PRQL.CDSERINT  = STQL.CDSERINT
003856  AND PRQL.CDSERINT  = :C6TBVISS-CDSERINT
003857  AND VISS.IDQUALIF IN(
003858  :WQ-IDQUALIF1 , :WQ-IDQUALIF2 , :WQ-IDQUALIF3
003859  ,:WQ-IDQUALIF4 , :WQ-IDQUALIF5 , :WQ-IDQUALIF6
003860  ,:WQ-IDQUALIF7 , :WQ-IDQUALIF8 , :WQ-IDQUALIF9
003861  ,:WQ-IDQUALIF10, :WQ-IDQUALIF11, :WQ-IDQUALIF12
003862  ,:WQ-IDQUALIF13, :WQ-IDQUALIF14, :WQ-IDQUALIF15
003863  ,:WQ-IDQUALIF16, :WQ-IDQUALIF17, :WQ-IDQUALIF18
003864  ,:WQ-IDQUALIF19, :WQ-IDQUALIF20, :WQ-IDQUALIF21
003865  ,:WQ-IDQUALIF22, :WQ-IDQUALIF23, :WQ-IDQUALIF24
003866  ,:WQ-IDQUALIF25, :WQ-IDQUALIF26, :WQ-IDQUALIF27
003867  ,:WQ-IDQUALIF28, :WQ-IDQUALIF29, :WQ-IDQUALIF30
003868  ,:WQ-IDQUALIF31, :WQ-IDQUALIF32, :WQ-IDQUALIF33
003869  ,:WQ-IDQUALIF34, :WQ-IDQUALIF35, :WQ-IDQUALIF36
003870  ,:WQ-IDQUALIF37, :WQ-IDQUALIF38, :WQ-IDQUALIF39
003871  ,:WQ-IDQUALIF40, :WQ-IDQUALIF41, :WQ-IDQUALIF42
003872  ,:WQ-IDQUALIF43, :WQ-IDQUALIF44, :WQ-IDQUALIF45
003873  ,:WQ-IDQUALIF46, :WQ-IDQUALIF47, :WQ-IDQUALIF48
003874  ,:WQ-IDQUALIF49, :WQ-IDQUALIF50)
003875  UNION ALL
003876  SELECT VISS.CDINDICE
003877  , CHAR(VISS.DTINIZIO, ISO)
003878  , CHAR(VISS.DTFINE, ISO)
003879  , VISS.DSVAL
003880  , VISS.NRVAL
003881  , 0
003882  FROM C6TBVISS VISS
003883  WHERE VISS.IDCDZ     = :C6TBVISS-IDCDZ
003884  AND VISS.IDCOMP    = :C6TBVISS-IDCOMP
003885  AND VISS.DTINIZIO <= :C6TBVISS-DTFINE
003886  AND VISS.DTFINE   >= :C6TBVISS-DTINIZIO
003887  AND VISS.CDSTATO   = 'A'
003888  AND VISS.IDQUALIF  = 0
003889  *>  PRIORITA' QUALIFICATORE, DATA INIZIO, CDINDICE
003890  ORDER BY 6 DESC, 2 ASC, 1 ASC
003891  WITH UR
003892  END-EXEC 
003893*
003894  EXEC SQL DECLARE CD_VALIS2_SPR CURSOR FOR
003895  SELECT CHAR(VISS.DTINIZIO, ISO)
003896  , CHAR(VISS.DTFINE, ISO)
003897  , VISS.NRVAL
003898  , PRQL.NRPRIOR
003899  FROM C6TBVISS VISS,
003900  C6TBSTQL STQL,
003901  C6TBPRQL PRQL
003902  WHERE VISS.IDCDZ     = :C6TBVISS-IDCDZ
003903  AND VISS.IDCOMP    = :C6TBVISS-IDCOMP
003904  AND VISS.DTINIZIO <= :C6TBVISS-DTFINE
003905  AND VISS.DTFINE   >= :C6TBVISS-DTINIZIO
003906  AND VISS.CDINDICE  = :C6TBVISS-CDINDICE
003907  AND VISS.CDSTATO   = 'A'
003908  AND VISS.IDQUALIF  = STQL.IDQUALIF
003909  AND PRQL.CDFORMA   = STQL.CDFORMA
003910  AND PRQL.CDSERINT  = STQL.CDSERINT
003911  AND PRQL.CDSERINT  = :C6TBVISS-CDSERINT
003912  AND VISS.IDQUALIF IN(
003913  :WQ-IDQUALIF1 , :WQ-IDQUALIF2 , :WQ-IDQUALIF3
003914  ,:WQ-IDQUALIF4 , :WQ-IDQUALIF5 , :WQ-IDQUALIF6
003915  ,:WQ-IDQUALIF7 , :WQ-IDQUALIF8 , :WQ-IDQUALIF9
003916  ,:WQ-IDQUALIF10, :WQ-IDQUALIF11, :WQ-IDQUALIF12
003917  ,:WQ-IDQUALIF13, :WQ-IDQUALIF14, :WQ-IDQUALIF15
003918  ,:WQ-IDQUALIF16, :WQ-IDQUALIF17, :WQ-IDQUALIF18
003919  ,:WQ-IDQUALIF19, :WQ-IDQUALIF20, :WQ-IDQUALIF21
003920  ,:WQ-IDQUALIF22, :WQ-IDQUALIF23, :WQ-IDQUALIF24
003921  ,:WQ-IDQUALIF25, :WQ-IDQUALIF26, :WQ-IDQUALIF27
003922  ,:WQ-IDQUALIF28, :WQ-IDQUALIF29, :WQ-IDQUALIF30
003923  ,:WQ-IDQUALIF31, :WQ-IDQUALIF32, :WQ-IDQUALIF33
003924  ,:WQ-IDQUALIF34, :WQ-IDQUALIF35, :WQ-IDQUALIF36
003925  ,:WQ-IDQUALIF37, :WQ-IDQUALIF38, :WQ-IDQUALIF39
003926  ,:WQ-IDQUALIF40, :WQ-IDQUALIF41, :WQ-IDQUALIF42
003927  ,:WQ-IDQUALIF43, :WQ-IDQUALIF44, :WQ-IDQUALIF45
003928  ,:WQ-IDQUALIF46, :WQ-IDQUALIF47, :WQ-IDQUALIF48
003929  ,:WQ-IDQUALIF49, :WQ-IDQUALIF50)
003930  UNION ALL
003931  SELECT CHAR(VISS.DTINIZIO, ISO)
003932  , CHAR(VISS.DTFINE, ISO)
003933  , VISS.NRVAL
003934  , 0
003935  FROM C6TBVISS VISS
003936  WHERE VISS.IDCDZ     = :C6TBVISS-IDCDZ
003937  AND VISS.IDCOMP    = :C6TBVISS-IDCOMP
003938  AND VISS.DTINIZIO <= :C6TBVISS-DTFINE
003939  AND VISS.DTFINE   >= :C6TBVISS-DTINIZIO
003940  AND VISS.CDINDICE  = :C6TBVISS-CDINDICE
003941  AND VISS.CDSTATO   = 'A'
003942  AND VISS.IDQUALIF  = 0
003943  *>  PRIORITA' QUALIFICATORE, DATA INIZIO
003944  ORDER BY 4 DESC, 1 ASC
003945  WITH UR
003946  END-EXEC 
003947*
003948  EXEC SQL DECLARE CD_REGOLATE CURSOR FOR
003949  SELECT RELN.NRPRIOR
003950  ,CDZI.IDCDZ
003951  ,CDZI.DSCDZBR
003952  ,CZCO.NRPRIOR
003953  ,CZCO.IDCOMP
003954  ,CZCO.DSLEGBR
003955  ,CDZI.CDNATCDZ
003956  ,COMP.CDTPFORM
003957  ,COMP.NRDECIM
003958  ,COMP.NRDIMENS
003959  ,CZCO.CDSPREAD
003960  ,CZCO.CDCALCSPR
003961  ,CZCO.CDESTREM
003962  ,CZCO.SNSUPSTD
003963  ,CDZI.CDTPCAR
003964  FROM C6TBVINC VINC,
003965  C6TBRELN RELN,
003966  C6TBCDZI CDZI,
003967  C6TBCZCO CZCO,
003968  C6TBCOMP COMP
003969  WHERE VINC.DSVALDA  = :C6TBVINC-DSVALDA
003970  AND   VINC.IDCDZ    = :C6TBVINC-IDCDZ
003971  AND   VINC.IDCOMP   = :C6TBVINC-IDCOMP
003972  AND   RELN.IDCDZREG = VINC.IDCDZ
003973  AND   VINC.NRPROGR  = RELN.NRPROGR
003974  AND   RELN.CDTPRELE IN ('S','E')
003975  AND   CDZI.IDCDZ    = RELN.IDCDZ
003976  AND   CZCO.IDCDZ    = RELN.IDCDZ
003977  AND   COMP.IDCOMPEL = CZCO.IDCOMPEL
003978  UNION ALL
003979  SELECT RELN.NRPRIOR
003980  ,CDZI.IDCDZ
003981  ,CDZI.DSCDZBR
003982  ,CZCO.NRPRIOR
003983  ,CZCO.IDCOMP
003984  ,CZCO.DSLEGBR
003985  ,CDZI.CDNATCDZ
003986  ,COMP.CDTPFORM
003987  ,COMP.NRDECIM
003988  ,COMP.NRDIMENS
003989  ,CZCO.CDSPREAD
003990  ,CZCO.CDCALCSPR
003991  ,CZCO.CDESTREM
003992  ,CZCO.SNSUPSTD
003993  ,CDZI.CDTPCAR
003994  FROM C6TBRELN RELN,
003995  C6TBCDZI CDZI,
003996  C6TBCZCO CZCO,
003997  C6TBCOMP COMP
003998  WHERE RELN.IDCDZREG = :C6TBRELN-IDCDZREG
003999  AND   RELN.CDTPRELE = 'T'
004000  AND   CDZI.IDCDZ    = RELN.IDCDZ
004001  AND   CZCO.IDCDZ    = RELN.IDCDZ
004002  AND   COMP.IDCOMPEL = CZCO.IDCOMPEL
004003  *>  ORDER BY RELN.NRPRIOR, CZCO.NRPRIOR
004004  ORDER BY 1, 4
004005  WITH UR
004006  END-EXEC 
004007*
004008  EXEC SQL DECLARE CD_VALIND CURSOR FOR
004009  SELECT INDI.NRDIMENS
004010  ,INDI.NRDECIM
004011  ,CHAR(VAIN.DTINIZIO, ISO)
004012  ,CHAR(VAIN.DTFINE, ISO)
004013  ,VAIN.NRVAL
004014  FROM C6TBVAIN VAIN,
004015  C6TBINDI INDI
004016  WHERE VAIN.CDINDICE  = :C6TBVAIN-CDINDICE
004017  AND VAIN.DTINIZIO <= :C6TBVAIN-DTFINE
004018  AND VAIN.DTFINE   >= :C6TBVAIN-DTINIZIO
004019  AND VAIN.CDINDICE  = INDI.CDINDICE
004020  *>  ORDER BY VAIN.DTINIZIO
004021  ORDER BY 3 ASC
004022  WITH UR
004023  END-EXEC 
004024*
004025 LINKAGE SECTION.
004026 01  DFHCOMMAREA.
004027   02 C6AP01AS.
004028      05 C6SP01A-IDAREA           PIC X(008) VALUE 'C6AP01AS'.
004029*
004030   05 C6SP01A-GRDATIIN.
004031    10 C6SP01A-CDSERBAN         PIC X(003).
004032    10 C6SP01A-CDTPENT          PIC X(001).
004033    10 C6SP01A-CDENTITA         PIC X(060).
004034    10 C6SP01A-DTINIRIC         PIC 9(008).
004035    10 C6SP01A-DTFINRIC         PIC 9(008).
004036    10 C6SP01A-CDUTIREG         PIC X(001).
004037    10 C6SP01A-CDUTISPR         PIC X(001).
004038    10 C6SP01A-CDQUALIT         PIC X(120).
004039    10 C6SP01A-NRDIMENS         PIC 9(003).
004040    10 C6SP01A-CDTPRICH         PIC X(001).
004041    10 C6SP01A-CDTPLST          PIC X(001).
004042    10 C6SP01A-CDLISTA          PIC X(020).
004043    10 C6SP01A-DSCDZBR          PIC X(015).
004044    10 C6SP01A-DSLEGBR          PIC X(015).
004045*
004046*-----------------------------------------------------------
004047* DATI AMBIENTALI (DUE SEZIONI: ISTITUTO E UTENTE)
004048*-----------------------------------------------------------
004049*      CARATTERISTICHE DELLA ORGANIZZAZIONE DELL'ISTITUTO
004050*                           (BANCA/ASSICURAZIONE)
004051    10 C6SP01A-CDISTITU          PIC X(5).
004052*
004053   05 C6SP01A-GRDATIIO.
004054    10 C6SP01A-GRSLINOU.
004055     15 C6SP01A-CDKEYRIP          PIC X(030).
004056*
004057   05 C6SP01A-GRDATIOU.
004058    10 C6SP01A-GRDTOUER.
004059       15 C6SP01A-CDISTITU-ERR    PIC X(001).
004060       15 C6SP01A-CDSERBAN-ERR    PIC X(001).
004061       15 C6SP01A-CDTPENT-ERR     PIC X(001).
004062       15 C6SP01A-CDENTITA-ERR    PIC X(001).
004063       15 C6SP01A-DTINIRIC-ERR    PIC X(001).
004064       15 C6SP01A-DTFINRIC-ERR    PIC X(001).
004065       15 C6SP01A-CDUTIREG-ERR    PIC X(001).
004066       15 C6SP01A-CDUTISPR-ERR    PIC X(001).
004067       15 C6SP01A-CDQUALIT-ERR    PIC X(001).
004068       15 C6SP01A-NRDIMENS-ERR    PIC X(001).
004069       15 C6SP01A-CDTPRICH-ERR    PIC X(001).
004070       15 C6SP01A-CDTPLST-ERR     PIC X(001).
004071       15 C6SP01A-CDLISTA-ERR     PIC X(001).
004072       15 C6SP01A-DSCDZBR-ERR     PIC X(001).
004073       15 C6SP01A-DSLEGBR-ERR     PIC X(001).
004074*
004075    10 C6SP01A-GRDTOUTS.
004076     15 C6SP01A-CDUTIRIP-OUT     PIC X(01).
004077     15 C6SP01A-ELDIMOUT-OUT     PIC 9(03).
004078     15 C6SP01A-TBCDZOUT-OUT     OCCURS 210.
004079       20 C6SP01A-DTINIVAL-OUT   PIC 9(08).
004080       20 C6SP01A-DTFINVAL-OUT   PIC 9(08).
004081       20 C6SP01A-DSCDZBR-OUT    PIC X(15).
004082       20 C6SP01A-DSLEGBR-OUT    PIC X(15).
004083       20 C6SP01A-NRPRELEM-OUT   PIC 9(03).
004084       20 C6SP01A-NRPREGOL-OUT   PIC 9(03).
004085       20 C6SP01A-CDNATCDZ-OUT   PIC X(01).
004086       20 C6SP01A-CDAPPLIV-OUT   PIC X(01).
004087       20 C6SP01A-CDFORVAL-OUT   PIC X(01).
004088       20 C6SP01A-NMDIMEN-OUT    PIC 9(02).
004089       20 C6SP01A-NMDECIMA-OUT   PIC 9(02).
004090       20 C6SP01A-DSVAL-OUT      PIC X(15).
004091       20 C6SP01A-NRVAL-OUT      PIC S9(18).
004092       20 C6SP01A-NRPRCOMP-OUT   PIC 9(03).
004093       20 C6SP01A-CDINDICE-OUT   PIC X(05).
004094     15 C6SP01A-CDESITO          PIC X(004).
004095     15 C6SP01A-DSERTEXT-BREVE   PIC X(030).
004096     15 C6SP01A-DSERTEXT-MEDIO   PIC X(070).
004097*
004098
004099
004100 PROCEDURE DIVISION USING DFHCOMMAREA.
004101 DECLARATIVES.
004102 DBG SECTION.
004103       USE FOR DEBUGGING ON ALL PROCEDURES.
004104 DBG0. DISPLAY WS-GEN-PGMNOME '*' DEBUG-ITEM.
004105 DBG1. EXIT.
004106 END DECLARATIVES.
004107*
004108     MOVE '************** INIZIO C6SP01AX************************'
004109       TO WS-MESSAGGIO
004110     PERFORM TRACCIA
004111     MOVE SPACES TO WS-MESSAGGIO
004112     STRING 'CDSERBAN : ' C6SP01A-CDSERBAN DELIMITED BY SIZE
004113       INTO WS-MESSAGGIO
004114     PERFORM TRACCIA
004115     MOVE SPACES TO WS-MESSAGGIO
004116     STRING 'CDTPENT  : ' C6SP01A-CDTPENT ' '
004117            'CDENTITA : ' C6SP01A-CDENTITA DELIMITED BY SIZE
004118       INTO WS-MESSAGGIO
004119     PERFORM TRACCIA
004120     MOVE SPACES TO WS-MESSAGGIO
004121     STRING 'DTINIRIC : ' C6SP01A-DTINIRIC ' '
004122            'DTFINRIC : ' C6SP01A-DTFINRIC DELIMITED BY SIZE
004123       INTO WS-MESSAGGIO
004124     PERFORM TRACCIA
004125     MOVE SPACES TO WS-MESSAGGIO
004126     STRING 'CDQUALIT : ' C6SP01A-CDQUALIT DELIMITED BY SIZE
004127       INTO WS-MESSAGGIO
004128     PERFORM TRACCIA
004129     MOVE SPACES TO WS-MESSAGGIO
004130     STRING 'CDUTIREG : ' C6SP01A-CDUTIREG ' '
004131            'CDUTISPR : ' C6SP01A-CDUTISPR ' '
004132            'CDTPRICH : ' C6SP01A-CDTPRICH ' '
004133            'NRDIMENS : ' C6SP01A-NRDIMENS DELIMITED BY SIZE
004134       INTO WS-MESSAGGIO
004135     PERFORM TRACCIA
004136     MOVE SPACES TO WS-MESSAGGIO
004137     STRING 'CDTPLST  : ' C6SP01A-CDTPLST  ' '
004138            'CDLISTA  : ' C6SP01A-CDLISTA DELIMITED BY SIZE
004139       INTO WS-MESSAGGIO
004140     PERFORM TRACCIA
004141     MOVE SPACES TO WS-MESSAGGIO
004142     STRING 'DSCDZBR  : ' C6SP01A-DSCDZBR  ' '
004143            'DSLEGBR  : ' C6SP01A-DSLEGBR DELIMITED BY SIZE
004144       INTO WS-MESSAGGIO
004145     PERFORM TRACCIA
004146*
004147     PERFORM A-OPER-INIZIALI
004148     PERFORM C-CTRL-INIZ-PGM
004149     PERFORM E-ELABORAZIONE
004150*
004151     MOVE '************** FINE   C6SP01AX************************'
004152       TO WS-MESSAGGIO
004153     PERFORM TRACCIA
004154*
004155     GOBACK.
004156     .
004157*****************
004158 A-OPER-INIZIALI.
004159*****************
004160* INIZIALIZZAZIONE AREA DI OUTPUT
004161     INITIALIZE                       C6SP01A-GRDATIOU.
004162*
004163* INIZIALIZZAZIONE AREE DI WORKING
004164     MOVE ZEROES                   TO WS-IND-RIP
004165     MOVE ZEROES                   TO WS-IND-OUT
004166*
004167     MOVE 210                      TO WS-IND-MAX
004168     MOVE 500                      TO WS-IND-OUT-MAX
004169*
004170     MOVE ZEROES                   TO WC-INDM
004171     MOVE 100                      TO WC-IND-MAX
004172*
004173     MOVE ZEROES                   TO WQ-INDM
004174     MOVE 50                       TO WQ-IND-MAX
004175     INITIALIZE                       WQ-TAB-QUALIF
004176     INITIALIZE                       WQ-TAB-CRQL
004177     MOVE ZEROES                   TO WD-INDM
004178*
004179     MOVE ZEROES                   TO WL-INDM
004180     MOVE 10                       TO WL-IND-MAX
004181     MOVE ZEROES                   TO WL-INDR
004182     MOVE 10                       TO WL-INDR-MAX
004183     INITIALIZE                       WL-TAB-LISTIN
004184     INITIALIZE                       WL-TAB-CRTZ
004185*
004186     MOVE 150                      TO WVA-IND-MAX
004187     MOVE 1000                     TO WD-IND-MAX
004188*
004189     MOVE ZEROES                   TO WV-INDDM
004190     MOVE ZEROES                   TO WV-INDCM
004191     MOVE 50                       TO WV-INDD-MAX
004192     MOVE 10                       TO WV-INDC-MAX
004193     INITIALIZE                       WV-TAB-CONVEN
004194*
004195     MOVE ZEROES                   TO WB-INDM
004196     MOVE 300                      TO WB-IND-MAX
004197     MOVE 50                       TO WI-IND-MAX
004198     MOVE ZEROES                   TO WI-INDM
004199     MOVE ZEROES                   TO WI-IDCDZ
004200     MOVE 300                      TO WP-IND-MAX
004201*
004202     MOVE ZEROES                   TO WG-INDM
004203     MOVE 150                      TO WG-IND-MAX
004204     MOVE ZEROES                   TO WK-INDM
004205     MOVE 300                      TO WK-IND-MAX
004206     MOVE 366                      TO WJ-IND-MAX
004207*
004208     MOVE ZEROES                   TO WS-CDSERINT
004209     MOVE ZEROES                   TO WS-CDOGGETT
004210*
004211     MOVE ZEROES                   TO W-INDY
004212     MOVE ZEROES                   TO W-INDZ
004213     MOVE ZEROES                   TO W-INDW
004214     MOVE ZEROES                   TO W-INDX
004215     MOVE ZEROES                   TO W-INDS-CONTATORE
004216     MOVE ZEROES                   TO W-INDS-CONTATORE-TOT
004217     MOVE ZEROES                   TO W-INDS-DA-APP
004218     MOVE ZEROES                   TO W-INDS-A-APP
004219     MOVE ZEROES                   TO W-INDS-D-APP
004220     MOVE ZEROES                   TO W-INDS
004221     MOVE ZEROES                   TO W-INDS2
004222     MOVE ZEROES                   TO W-INDSM
004223     MOVE 10                       TO W-INDS-MAX
004224     MOVE 50                       TO W-INDS2-MAX
004225     MOVE ZEROES                   TO W-INDC-DA
004226     MOVE ZEROES                   TO W-INDC-A
004227     MOVE ZEROES                   TO W-INDC
004228     MOVE ZEROES                   TO W-INDCM
004229     MOVE 50                       TO W-INDC-MAX
004230     MOVE ZEROES                   TO W-INDF-DA
004231     MOVE ZEROES                   TO W-INDF-A
004232     MOVE ZEROES                   TO W-INDF
004233     MOVE ZEROES                   TO W-INDFM
004234     MOVE 50                       TO W-INDF-MAX
004235     SET  WS-NO-FINE-RIPARTENZA    TO TRUE
004236     .
004237****************
004238 C-CTRL-INIZ-PGM.
004239*****************
004240*
004241* CODICE ISTITUTO NON VALORIZZATO
004242     IF  C6SP01A-CDESITO = SPACES
004243     AND C6SP01A-CDISTITU NOT > SPACES
004244        MOVE 'EB02'                TO C6SP01A-CDESITO
004245        MOVE 'ISTITUTO NON VALORIZZATO'
004246                                   TO C6SP01A-DSERTEXT-BREVE
004247        MOVE 'CODICE ISTITUTO NON VALORIZZATO'
004248                                   TO C6SP01A-DSERTEXT-MEDIO
004249     END-IF
004250*
004251* CODICE SERVIZIO NON VALORIZZATO
004252     IF  C6SP01A-CDESITO = SPACES
004253     AND C6SP01A-CDSERBAN NOT > SPACES
004254        MOVE 'E215'                TO C6SP01A-CDESITO
004255        MOVE 'COD.SERVIZIO NON VALORIZZATO'
004256                                   TO C6SP01A-DSERTEXT-BREVE
004257        MOVE 'CODICE SERVIZIO NON VALORIZZATO'
004258                                   TO C6SP01A-DSERTEXT-MEDIO
004259     END-IF
004260*
004261* RECUPERO DEL CODICE SERVIZIO
004262     IF C6SP01A-CDESITO = SPACES
004263        PERFORM UT-CTRL-CDSERBAN
004264        IF C6SP01A-CDESITO = SPACES
004265           MOVE C6TBSRBA-CDSERINT  TO WS-CDSERINT
004266        END-IF
004267     END-IF
004268*
004269* QUALIFICATORE NON RICHIESTO SE NON PREVISTO PER SERVIZIO
004270     IF  C6SP01A-CDESITO   = SPACES
004271     AND C6TBSRBA-SNUTIQUA = 'N'
004272     AND C6SP01A-CDQUALIT  > SPACES
004273        MOVE 'EB43'                TO C6SP01A-CDESITO
004274        MOVE 'QUALIFICATORE KO PER SERVIZIO'
004275                                   TO C6SP01A-DSERTEXT-BREVE
004276        MOVE 'QUALIFICATORE NON PREVISTO PER SERVIZIO'
004277                                   TO C6SP01A-DSERTEXT-MEDIO
004278     END-IF
004279*
004280* TIPO ENTITA' NON VALORIZZATO
004281     IF  C6SP01A-CDESITO = SPACES
004282     AND C6SP01A-CDTPENT NOT > SPACES
004283        MOVE 'E260'                TO C6SP01A-CDESITO
004284        MOVE 'TIPO ENTITA NON VALORIZZATO'
004285                                   TO C6SP01A-DSERTEXT-BREVE
004286        MOVE 'TIPO ENTITA NON VALORIZZATO'
004287                                   TO C6SP01A-DSERTEXT-MEDIO
004288     END-IF
004289*
004290* TIPO ENTITA' PREVISTO
004291     IF  C6SP01A-CDESITO = SPACES
004292     AND NOT (C6SP01A-CDTPENT = '0' OR '1' OR '2' OR '3' OR '4')
004293        MOVE 'E282'                TO C6SP01A-CDESITO
004294        MOVE 'TIPO ENTITA NON PREVISTO'
004295                                   TO C6SP01A-DSERTEXT-BREVE
004296        MOVE 'TIPO ENTITA NON PREVISTO'
004297                                   TO C6SP01A-DSERTEXT-MEDIO
004298     END-IF
004299*
004300* CODICE ENTITA' VALORIZZATO
004301     IF   C6SP01A-CDESITO = SPACES
004302     AND (C6SP01A-CDTPENT = '1' OR '2' OR '3' OR '4')
004303     AND  C6SP01A-CDENTITA NOT > SPACES
004304        MOVE 'E262'                TO C6SP01A-CDESITO
004305        MOVE 'CODICE ENTITA NON VALORIZZATO'
004306                                   TO C6SP01A-DSERTEXT-BREVE
004307        MOVE 'CODICE ENTITA NON VALORIZZATO'
004308                                   TO C6SP01A-DSERTEXT-MEDIO
004309     END-IF
004310*
004311* DATA INIZIO RICERCA NUMERICO
004312     IF  C6SP01A-CDESITO = SPACES
004313     AND C6SP01A-DTINIRIC NOT NUMERIC
004314        MOVE 'E464'                TO C6SP01A-CDESITO
004315        MOVE 'DT.INIZIO RICERCA NON NUMERICA'
004316                                   TO C6SP01A-DSERTEXT-BREVE
004317        MOVE 'DATA INIZIO RICERCA NON NUMERICA'
004318                                   TO C6SP01A-DSERTEXT-MEDIO
004319     END-IF
004320*
004321* DATA INIZIO RICERCA VALORIZZATA
004322     IF  C6SP01A-CDESITO = SPACES
004323     AND C6SP01A-DTINIRIC NOT > ZEROES
004324        MOVE 'E465'                TO C6SP01A-CDESITO
004325        MOVE 'DATA INIZIO RICERCA NON VALIDA'
004326                                   TO C6SP01A-DSERTEXT-BREVE
004327        MOVE 'DATA INIZIO RICERCA NON VALIDA'
004328                                   TO C6SP01A-DSERTEXT-MEDIO
004329     END-IF
004330     IF C6SP01A-CDESITO = SPACES
004331        MOVE C6SP01A-DTINIRIC(1:4) TO WS-DTINIZIO-DB2(1:4)
004332        MOVE '-'                   TO WS-DTINIZIO-DB2(5:1)
004333        MOVE C6SP01A-DTINIRIC(5:2) TO WS-DTINIZIO-DB2(6:2)
004334        MOVE '-'                   TO WS-DTINIZIO-DB2(8:1)
004335        MOVE C6SP01A-DTINIRIC(7:2) TO WS-DTINIZIO-DB2(9:2)
004336     END-IF
004337*
004338* DATA FINE RICERCA NUMERICO
004339     IF  C6SP01A-CDESITO = SPACES
004340     AND C6SP01A-DTFINRIC NOT NUMERIC
004341        MOVE 'E466'                TO C6SP01A-CDESITO
004342        MOVE 'DT.FINE RICERCA NON NUMERICA'
004343                                   TO C6SP01A-DSERTEXT-BREVE
004344        MOVE 'DATA FINE RICERCA NON NUMERICA'
004345                                   TO C6SP01A-DSERTEXT-MEDIO
004346     END-IF
004347*
004348* DATA INIZIO <= DATA FINE
004349     IF  C6SP01A-CDESITO = SPACES
004350     AND C6SP01A-DTFINRIC > ZEROES
004351     AND C6SP01A-DTINIRIC > C6SP01A-DTFINRIC
004352        MOVE 'E468'                TO C6SP01A-CDESITO
004353        MOVE 'DT.INIZIO > DT.FINE RICERCA'
004354                                   TO C6SP01A-DSERTEXT-BREVE
004355        MOVE 'DATA INIZIO RICERCA > DATA FINE RICERCA'
004356                                   TO C6SP01A-DSERTEXT-MEDIO
004357     END-IF
004358*
004359     IF C6SP01A-CDESITO = SPACES
004360        IF C6SP01A-DTFINRIC >= 99991231
004361        OR C6SP01A-DTFINRIC <= 10000101
004362           MOVE '9999-12-31'       TO WS-DTFINE-DB2
004363        ELSE
004364           MOVE C6SP01A-DTFINRIC(1:4)
004365                                   TO WS-DTFINE-DB2(1:4)
004366           MOVE '-'                TO WS-DTFINE-DB2(5:1)
004367           MOVE C6SP01A-DTFINRIC(5:2)
004368                                   TO WS-DTFINE-DB2(6:2)
004369           MOVE '-'                TO WS-DTFINE-DB2(8:1)
004370           MOVE C6SP01A-DTFINRIC(7:2)
004371                                   TO WS-DTFINE-DB2(9:2)
004372        END-IF
004373     END-IF
004374*
004375* FLAG UTILIZZO REGOLATE VALORIZZATO
004376     IF  C6SP01A-CDESITO = SPACES
004377     AND C6SP01A-CDUTIREG NOT > SPACES
004378        MOVE 'E446'                TO C6SP01A-CDESITO
004379        MOVE 'IND.REGOLATE NON VALORIZZATO'
004380                                   TO C6SP01A-DSERTEXT-BREVE
004381        MOVE 'INDICATORE REGOLATE NON VALORIZZATO'
004382                                   TO C6SP01A-DSERTEXT-MEDIO
004383     END-IF
004384*
004385* FLAG UTILIZZO REGOLATE PREVISTO
004386     IF  C6SP01A-CDESITO = SPACES
004387     AND C6SP01A-CDUTIREG NOT = '1'
004388        MOVE 'E447'                TO C6SP01A-CDESITO
004389        MOVE 'IND.REGOLATE ERRATO' TO C6SP01A-DSERTEXT-BREVE
004390        MOVE 'INDICATORE REGOLATE VALORIZZATO ERRATO'
004391                                   TO C6SP01A-DSERTEXT-MEDIO
004392     END-IF
004393*
004394* FLAG UTILIZZO SPREAD VALORIZZATO
004395     IF  C6SP01A-CDESITO = SPACES
004396     AND C6SP01A-CDUTISPR NOT > SPACES
004397        MOVE 'E448'                TO C6SP01A-CDESITO
004398        MOVE 'IND.SPREAD NON VALORIZZATO'
004399                                   TO C6SP01A-DSERTEXT-BREVE
004400        MOVE 'INDICATORE SPREAD NON VALORIZZATO'
004401                                   TO C6SP01A-DSERTEXT-MEDIO
004402     END-IF
004403*
004404* FLAG UTILIZZO SPREAD PREVISTO
004405     IF  C6SP01A-CDESITO = SPACES
004406     AND NOT (C6SP01A-CDUTISPR = '0' OR '1')
004407        MOVE 'E449'                TO C6SP01A-CDESITO
004408        MOVE 'IND.SPREAD ERRATO'   TO C6SP01A-DSERTEXT-BREVE
004409        MOVE 'INDICATORE SPREAD VALORIZZATO ERRATO'
004410                                   TO C6SP01A-DSERTEXT-MEDIO
004411     END-IF
004412*
004413* NR. OCCORRENZE NUMERICO
004414     IF  C6SP01A-CDESITO = SPACES
004415     AND C6SP01A-NRDIMENS NOT NUMERIC
004416        MOVE 'E474'                TO C6SP01A-CDESITO
004417        MOVE 'NR.OCCORRENZE NON NUMERICO'
004418                                   TO C6SP01A-DSERTEXT-BREVE
004419        MOVE 'NR.OCCORRENZE NON NUMERICO'
004420                                   TO C6SP01A-DSERTEXT-MEDIO
004421     END-IF
004422*
004423     IF  C6SP01A-CDESITO = SPACES
004424     AND C6SP01A-NRDIMENS NOT > ZEROES
004425        MOVE WS-IND-MAX            TO C6SP01A-NRDIMENS
004426     END-IF
004427*
004428* NR. OCCORRENZE > LIMITE MASSIMO
004429     IF  C6SP01A-CDESITO = SPACES
004430     AND C6SP01A-NRDIMENS > WS-IND-MAX
004431        MOVE 'E373'                TO C6SP01A-CDESITO
004432        MOVE 'NR.OCCORRENZE > LIMITE MAX'
004433                                   TO C6SP01A-DSERTEXT-BREVE
004434        MOVE 'NR.OCCORRENZE SUPERIORE AL LIMITE MASSIMO'
004435                                   TO C6SP01A-DSERTEXT-MEDIO
004436     END-IF
004437*
004438* TIPO RICHIESTA VALORIZZATO
004439     IF  C6SP01A-CDESITO = SPACES
004440     AND C6SP01A-CDTPRICH NOT > SPACES
004441        MOVE 'E439'                TO C6SP01A-CDESITO
004442        MOVE 'TIPO RICHIESTA NON VALORIZZATO'
004443                                   TO C6SP01A-DSERTEXT-BREVE
004444        MOVE 'CODICE TIPO RICHIESTA NON VALORIZZATO'
004445                                   TO C6SP01A-DSERTEXT-MEDIO
004446     END-IF
004447*
004448* TIPO RICHIESTA VALIDO
004449     IF  C6SP01A-CDESITO = SPACES
004450     AND NOT (C6SP01A-CDTPRICH = '0' OR '1' OR '2')
004451        MOVE 'E440'                TO C6SP01A-CDESITO
004452        MOVE 'TIPO RICHIESTA ERRATO'
004453                                   TO C6SP01A-DSERTEXT-BREVE
004454        MOVE 'CODICE TIPO RICHIESTA ERRATO'
004455                                   TO C6SP01A-DSERTEXT-MEDIO
004456     END-IF
004457*
004458* SE CDTPRICH = '0' -> CHIAVE LISTA OBBLIGATORIA
004459     IF  C6SP01A-CDESITO = SPACES
004460     AND C6SP01A-CDTPRICH = '0'
004461        IF C6SP01A-CDTPLST NOT > SPACES
004462           MOVE 'E023'             TO C6SP01A-CDESITO
004463           MOVE 'TIPO LISTA NON VALORIZZATO'
004464                                   TO C6SP01A-DSERTEXT-BREVE
004465           MOVE 'TIPO LISTA NON VALORIZZATO'
004466                                   TO C6SP01A-DSERTEXT-MEDIO
004467        END-IF
004468        IF  C6SP01A-CDESITO = SPACES
004469        AND C6SP01A-CDLISTA NOT > SPACES
004470           MOVE 'E022'             TO C6SP01A-CDESITO
004471           MOVE 'CODICE LISTA NON VALORIZZATO'
004472                                   TO C6SP01A-DSERTEXT-BREVE
004473           MOVE 'CODICE LISTA NON VALORIZZATO'
004474                                   TO C6SP01A-DSERTEXT-MEDIO
004475        END-IF
004476     END-IF
004477*
004478* SE CDTPRICH = '1' OR '2' -> CODICE CONDIZIONE OBBLIGATORIO
004479     IF  C6SP01A-CDESITO = SPACES
004480     AND (C6SP01A-CDTPRICH = '1' OR '2')
004481     AND C6SP01A-DSCDZBR NOT > SPACES
004482        MOVE 'E307'                TO C6SP01A-CDESITO
004483        MOVE 'CODICE CONDIZIONE NON VALORIZZATO'
004484                                   TO C6SP01A-DSERTEXT-BREVE
004485        MOVE 'CODICE CONDIZIONE NON VALORIZZATO'
004486                                   TO C6SP01A-DSERTEXT-MEDIO
004487     END-IF
004488*
004489* SE CDTPRICH = '2' -> CODICE COMPONENTE OBBLIGATORIO
004490     IF  C6SP01A-CDESITO = SPACES
004491     AND C6SP01A-CDTPRICH = '2'
004492     AND C6SP01A-DSLEGBR NOT > SPACES
004493        MOVE 'E252'                TO C6SP01A-CDESITO
004494        MOVE 'CODICE COMPONENTE NON VALORIZZATO'
004495                                   TO C6SP01A-DSERTEXT-BREVE
004496        MOVE 'CODICE COMPONENTE NON VALORIZZATO'
004497                                   TO C6SP01A-DSERTEXT-MEDIO
004498     END-IF
004499     .
004500****************
004501 E-ELABORAZIONE.
004502*****************
004503*
004504* RECUPERO DEL QUALIFICATORE E DEI PADRI
004505     IF  C6SP01A-CDESITO = SPACES
004506     AND C6SP01A-CDQUALIT > SPACES
004507        PERFORM UT-REPER-QUALIF-PADRI
004508     END-IF
004509*
004510* RECUPERO DEL CODICE ENTITA'
004511     IF  C6SP01A-CDESITO  = SPACES
004512     AND C6SP01A-CDENTITA > SPACES
004513        PERFORM UT-REPER-CDENTITA
004514     END-IF
004515*
004516* RECUPERO DELLE CONDIZIONI/COMPONENTI
004517     IF C6SP01A-CDESITO  = SPACES
004518        PERFORM UT-REPER-CONDIZIONI
004519     END-IF
004520*
004521* PER CIASCUNA CONDIZIONE/COMPONENTE REPERIMENTO VALORI
004522     PERFORM VARYING WC-IND FROM 1 BY 1
004523       UNTIL WC-IND > WC-INDM
004524          OR C6SP01A-CDESITO > SPACES
004525          OR WS-SI-FINE-RIPARTENZA
004526        IF  WC-CDSPREAD(WC-IND) = 'S'
004527        AND NOT (WI-IDCDZ = WC-IDCDZ(WC-IND)
004528            AND  WI-INDM  > ZEROES)
004529*          DISPLAY "PROVA-REPERISCI STORIA INDICE"
004530           PERFORM UT-REPER-STORIA-INDICE
004531        END-IF
004532        IF C6SP01A-CDESITO = SPACES
004533           MOVE WC-EL-CDZCMP(WC-IND) TO WAPP-CDZCMP
004534           MOVE WS-DTINIZIO-DB2      TO WA-DTINIZIO
004535           MOVE WS-DTFINE-DB2        TO WA-DTFINE
004536           MOVE ZEROES               TO WA-NRPRREGO
004537           PERFORM UT-REPER-VALORI
004538           IF WC-CDNATCDZ(WC-IND) = '1' OR '3'
004539* SE REGOLA REPERIMENTO REGOLATE ATTIVE E RELATIVI VALORI
004540              IF C6SP01A-DTINIRIC = C6SP01A-DTFINRIC
004541* ... CARICO IN TABOUT L'OCCORRENZA DELLA REGOLA
004542                 PERFORM CARICA-TABOUT-APP
004543                 IF  C6SP01A-CDESITO = SPACES
004544                 AND WS-NO-FINE-RIPARTENZA
004545                    PERFORM UT-REPER-REGOLATE-PUNTUALE
004546                 END-IF
004547              ELSE
004548                 PERFORM UT-REPER-REGOLATE-STORICO
004549              END-IF
004550           ELSE
004551* ALTRIMENTI CARICO LA TABELLA DI OUTPUT
004552              PERFORM CARICA-TABOUT-APP
004553           END-IF
004554        END-IF
004555     END-PERFORM
004556*
004557*    DISPLAY"WS-IND-OUT" WS-IND-OUT
004558*    PERFORM VARYING W-INDO FROM 1 BY 1
004559*       UNTIL W-INDO > WS-IND-OUT
004560*         DISPLAY"W-INDO" W-INDO
004561*         DISPLAY"WS-DTINIVAL-OUT " WS-DTINIVAL-OUT(W-INDO)
004562*         DISPLAY"WS-DTFINVAL-OUT "WS-DTFINVAL-OUT(W-INDO)
004563*         DISPLAY"WS-DSCDZBR-OUT  "WS-DSCDZBR-OUT(W-INDO)
004564*         DISPLAY"WS-DSLEGBR-OUT  "WS-DSLEGBR-OUT(W-INDO)
004565*         DISPLAY"WS-NRPRELEM-OUT "WS-NRPRELEM-OUT(W-INDO)
004566*         DISPLAY"WS-NRPREGOL-OUT "WS-NRPREGOL-OUT(W-INDO)
004567*         DISPLAY"WS-CDNATCDZ-OUT "WS-CDNATCDZ-OUT(W-INDO)
004568*         DISPLAY"WS-CDTPCAR-OUT  "WS-CDTPCAR-OUT(W-INDO)
004569*         DISPLAY"WS-CDSPREAD-OUT "WS-CDSPREAD-OUT(W-INDO)
004570*         DISPLAY"WS-CDAPPLIV-OUT "WS-CDAPPLIV-OUT(W-INDO)
004571*         DISPLAY"WS-CDFORVAL-OUT "WS-CDFORVAL-OUT(W-INDO)
004572*         DISPLAY"WS-NMDIMEN-OUT  "WS-NMDIMEN-OUT(W-INDO)
004573*         DISPLAY"WS-NMDECIMA-OUT "WS-NMDECIMA-OUT(W-INDO)
004574*         DISPLAY"WS-DSVAL-OUT    "WS-DSVAL-OUT(W-INDO)
004575*         DISPLAY"WS-NRVAL-OUT    "WS-NRVAL-OUT(W-INDO)
004576*         DISPLAY"WS-NRPRCOMP-OUT "WS-NRPRCOMP-OUT(W-INDO)
004577*         DISPLAY"WS-CDINDICE-OUT "WS-CDINDICE-OUT(W-INDO)
004578*    END-PERFORM
004579
004580     IF  C6SP01A-CDUTISPR = '1'
004581     AND C6SP01A-CDESITO = SPACES
004582*       DISPLAY "CALCOLATO"
004583        PERFORM VARYING W-INDO FROM 1 BY 1
004584          UNTIL W-INDO > WS-IND-OUT
004585
004586           IF  WS-CDNATCDZ-OUT(W-INDO) = '2'
004587           AND WS-CDSPREAD-OUT(W-INDO) = 'S'
004588           AND WS-CDTPCAR-OUT (W-INDO) = 'N'
004589*             DISPLAY "REGOLATA A SPREAD"
004590*             DISPLAY "WS-DSCDZBR-OUT(W-INDO)"
004591*                      WS-DSCDZBR-OUT(W-INDO)
004592*             DISPLAY "WS-DSCDZBR-OUT(W-INDO - 1)"
004593*                      WS-DSCDZBR-OUT(W-INDO - 1)
004594*             DISPLAY "WS-DSLEGBR-OUT(W-INDO)"
004595*                      WS-DSLEGBR-OUT(W-INDO)
004596*             DISPLAY "WS-DSLEGBR-OUT(W-INDO - 1)"
004597*                      WS-DSLEGBR-OUT(W-INDO - 1)
004598              IF  WS-DSCDZBR-OUT(W-INDO) NOT =
004599                  WS-DSCDZBR-OUT(W-INDO - 1)
004600              OR (WS-DSCDZBR-OUT(W-INDO)  =
004601                  WS-DSCDZBR-OUT(W-INDO - 1)
004602              AND WS-DSLEGBR-OUT(W-INDO) NOT =
004603                  WS-DSLEGBR-OUT(W-INDO - 1) )
004604                MOVE ZEROES          TO W-INDS2
004605                ADD  1               TO W-INDS
004606                MOVE W-INDO          TO W-INDS-DA(W-INDS)
004607              END-IF
004608                ADD  1               TO W-INDS2
004609              MOVE WS-DTINIVAL-OUT(W-INDO)
004610                TO W-DTINIZIO-S(W-INDS,W-INDS2)
004611              MOVE WS-DTFINVAL-OUT(W-INDO)
004612                TO W-DTFINE-S(W-INDS,W-INDS2)
004613              MOVE WS-NRVAL-OUT(W-INDO)
004614                TO W-CDVALNUM-S(W-INDS,W-INDS2)
004615              COMPUTE W-INDS-A(W-INDS) = (W-INDS-DA(W-INDS)
004616                                       + W-INDS2) - 1
004617              MOVE W-INDS2           TO W-INDS2M(W-INDS)
004618*             DISPLAY "W-INDS"    W-INDS
004619*             DISPLAY "W-INDS2"   W-INDS2
004620*             DISPLAY "W-INDS2M"  W-INDS2M(W-INDS)
004621*             DISPLAY "W-INDS-A"  W-INDS-A(W-INDS)
004622*             DISPLAY "W-INDS-DA" W-INDS-DA(W-INDS)
004623           END-IF
004624
004625           IF  WS-CDNATCDZ-OUT(W-INDO) = '2'
004626           AND (WS-CDSPREAD-OUT(W-INDO) = 'S'
004627            OR  WS-CDSPREAD-OUT(W-INDO) = 'N')
004628           AND WS-CDTPCAR-OUT (W-INDO) = 'C'
004629*             DISPLAY "CAP"
004630              IF W-INDC-DA NOT > ZEROES
004631                MOVE W-INDO          TO W-INDC-DA
004632              END-IF
004633              ADD  1               TO W-INDC
004634              MOVE WS-DTINIVAL-OUT(W-INDO)
004635                TO W-DTINIZIO-C(W-INDC)
004636              MOVE WS-DTFINVAL-OUT(W-INDO)
004637                TO W-DTFINE-C(W-INDC)
004638              MOVE WS-NRVAL-OUT(W-INDO)
004639                TO W-CDVALNUM-C(W-INDC)
004640              COMPUTE W-INDC-A = (W-INDC-DA + W-INDC) - 1
004641*             DISPLAY "W-INDC"    W-INDC
004642*             DISPLAY "W-INDC-A"  W-INDC-A
004643*             DISPLAY "W-INDC-DA" W-INDC-DA
004644           END-IF
004645
004646           IF  WS-CDNATCDZ-OUT(W-INDO) = '2'
004647           AND (WS-CDSPREAD-OUT(W-INDO) = 'S'
004648            OR  WS-CDSPREAD-OUT(W-INDO) = 'N')
004649           AND WS-CDTPCAR-OUT (W-INDO) = 'F'
004650*             DISPLAY "FLOOR"
004651              IF W-INDF-DA NOT > ZEROES
004652                MOVE W-INDO          TO W-INDF-DA
004653              END-IF
004654              ADD  1               TO W-INDF
004655              MOVE WS-DTINIVAL-OUT(W-INDO)
004656                TO W-DTINIZIO-F(W-INDF)
004657              MOVE WS-DTFINVAL-OUT(W-INDO)
004658                TO W-DTFINE-F(W-INDF)
004659              MOVE WS-NRVAL-OUT(W-INDO)
004660                TO W-CDVALNUM-F(W-INDF)
004661              COMPUTE W-INDF-A = (W-INDF-DA + W-INDF) - 1
004662*             DISPLAY "W-INDF"    W-INDF
004663*             DISPLAY "W-INDF-A"  W-INDF-A
004664*             DISPLAY "W-INDF-DA" W-INDF-DA
004665           END-IF
004666
004667           IF WS-CDNATCDZ-OUT(W-INDO) NOT = '2'
004668           OR W-INDO = WS-IND-OUT
004669*             DISPLAY "ROTTURA REGOLA"
004670              IF W-INDC    > ZEROES
004671              OR W-INDF    > ZEROES
004672                 PERFORM UT-ELABORA-CAP-FLOOR
004673              END-IF
004674
004675              INITIALIZE   W-INDC-DA
004676              INITIALIZE   W-INDC-A
004677              INITIALIZE   W-INDC
004678              INITIALIZE   W-INDF-DA
004679              INITIALIZE   W-INDF-A
004680              INITIALIZE   W-INDF
004681              INITIALIZE   W-INDS
004682              INITIALIZE   W-INDS2
004683
004684           END-IF
004685
004686        END-PERFORM
004687     END-IF
004688
004689     PERFORM CARICA-TABOUT
004690
004691*    DISPLAY"WS-IND-OUT" WS-IND-OUT
004692*    PERFORM VARYING W-INDO FROM 1 BY 1
004693*       UNTIL W-INDO > WS-IND-OUT
004694*         DISPLAY"W-INDO" W-INDO
004695*         DISPLAY"P1-DTINIVAL-OUT " C6SP01A-DTINIVAL-OUT(W-INDO)
004696*         DISPLAY"P1-DTFINVAL-OUT " C6SP01A-DTFINVAL-OUT(W-INDO)
004697*         DISPLAY"P1-DSCDZBR-OUT  " C6SP01A-DSCDZBR-OUT(W-INDO)
004698*         DISPLAY"P1-DSLEGBR-OUT  " C6SP01A-DSLEGBR-OUT(W-INDO)
004699*         DISPLAY"P1-NRPRELEM-OUT " C6SP01A-NRPRELEM-OUT(W-INDO)
004700*         DISPLAY"P1-NRPREGOL-OUT " C6SP01A-NRPREGOL-OUT(W-INDO)
004701*         DISPLAY"P1-CDNATCDZ-OUT " C6SP01A-CDNATCDZ-OUT(W-INDO)
004702*         DISPLAY"P1-CDAPPLIV-OUT " C6SP01A-CDAPPLIV-OUT(W-INDO)
004703*         DISPLAY"P1-CDFORVAL-OUT " C6SP01A-CDFORVAL-OUT(W-INDO)
004704*         DISPLAY"P1-NMDIMEN-OUT  " C6SP01A-NMDIMEN-OUT(W-INDO)
004705*         DISPLAY"P1-NMDECIMA-OUT " C6SP01A-NMDECIMA-OUT(W-INDO)
004706*         DISPLAY"P1-DSVAL-OUT    " C6SP01A-DSVAL-OUT(W-INDO)
004707*         DISPLAY"P1-NRVAL-OUT    " C6SP01A-NRVAL-OUT(W-INDO)
004708*         DISPLAY"P1-NRPRCOMP-OUT " C6SP01A-NRPRCOMP-OUT(W-INDO)
004709*         DISPLAY"P1-CDINDICE-OUT " C6SP01A-CDINDICE-OUT(W-INDO)
004710*    END-PERFORM
004711
004712     IF C6SP01A-CDESITO = SPACES
004713        MOVE ALL '0'               TO C6SP01A-CDESITO
004714     END-IF
004715     .
004716******************
004717 UT-CTRL-CDSERBAN.
004718******************
004719     MOVE '*** UT-CTRL-CDSERBAN' TO WS-MESSAGGIO
004720     PERFORM TRACCIA
004721*
004722     MOVE C6SP01A-CDSERBAN         TO C6TBSRBA-CDSEREST
004723*
004724  EXEC SQL
004725  SELECT  CDSERINT
004726  ,SNUTIQUA
004727  INTO :C6TBSRBA-CDSERINT
004728  ,:C6TBSRBA-SNUTIQUA
004729  FROM  C6TBSRBA
004730  WHERE  CDSEREST = :C6TBSRBA-CDSEREST
004731  WITH  UR
004732  END-EXEC 
004733*
004734     EVALUATE SQLCODE
004735         WHEN ZEROES CONTINUE
004736         WHEN +100
004737              MOVE 'E216'          TO C6SP01A-CDESITO
004738              MOVE 'SERVIZIO NON ESISTENTE'
004739                                   TO C6SP01A-DSERTEXT-BREVE
004740              MOVE 'SERVIZIO NON ESISTENTE'
004741                                   TO C6SP01A-DSERTEXT-MEDIO
004742         WHEN OTHER
004743              MOVE 'SLSRBA  '      TO WS-SQLACC
004744              PERFORM ERRORE-SQL
004745     END-EVALUATE.
004746*
004747***********************
004748 UT-REPER-QUALIF-PADRI.
004749***********************
004750     MOVE '*** UT-REPER-QUALIF-PADRI' TO WS-MESSAGGIO
004751     PERFORM TRACCIA
004752*
004753* RICERCA PARAMETRI DI QUALIFICATORE ASSOCIATI AL SERVIZIO
004754     MOVE WS-CDSERINT              TO C6TBCRQL-CDSERINT
004755*
004756  EXEC SQL OPEN CD_CRQL END-EXEC 
004757     IF SQLCODE NOT = ZEROES
004758        MOVE 'OCCRQL' TO WS-SQLACC
004759        PERFORM ERRORE-SQL
004760     END-IF
004761*
004762     PERFORM UT-FETCH-CD-CRQL
004763     PERFORM UNTIL SQLCODE = +100
004764        EVALUATE C6TBCRQL-NRPRIOR
004765            WHEN 1  MOVE C6TBCRQL-CDTPQUA TO WQ-CDTPQUA1
004766            WHEN 2  MOVE C6TBCRQL-CDTPQUA TO WQ-CDTPQUA2
004767            WHEN 3  MOVE C6TBCRQL-CDTPQUA TO WQ-CDTPQUA3
004768            WHEN 4  MOVE C6TBCRQL-CDTPQUA TO WQ-CDTPQUA4
004769            WHEN 5  MOVE C6TBCRQL-CDTPQUA TO WQ-CDTPQUA5
004770            WHEN 6  MOVE C6TBCRQL-CDTPQUA TO WQ-CDTPQUA6
004771            WHEN 7  MOVE C6TBCRQL-CDTPQUA TO WQ-CDTPQUA7
004772            WHEN 8  MOVE C6TBCRQL-CDTPQUA TO WQ-CDTPQUA8
004773            WHEN 9  MOVE C6TBCRQL-CDTPQUA TO WQ-CDTPQUA9
004774            WHEN 10 MOVE C6TBCRQL-CDTPQUA TO WQ-CDTPQUA10
004775        END-EVALUATE
004776        PERFORM UT-FETCH-CD-CRQL
004777     END-PERFORM
004778*
004779  EXEC SQL CLOSE CD_CRQL END-EXEC 
004780     IF SQLCODE NOT = ZEROES
004781        MOVE 'CLCRQL' TO WS-SQLACC
004782        PERFORM ERRORE-SQL
004783     END-IF
004784*
004785* CONTROLLO VALORI
004786     IF C6SP01A-CDQUALIT(1:12) > SPACES
004787        MOVE WQ-CDTPQUA1           TO C6TBVLQL-CDTPQUA
004788        MOVE C6SP01A-CDQUALIT(1:12)
004789                                   TO C6TBVLQL-DSVAL
004790        PERFORM UT-SELECT-VLQL
004791        IF SQLCODE = ZEROES
004792           MOVE C6TBVLQL-CDVLPRQL  TO WQ-CDVLPRQL1
004793        ELSE
004794           MOVE 'E429'             TO C6SP01A-CDESITO
004795           STRING 'VALORE KO PAR.QL.:' C6SP01A-CDQUALIT(1:12)
004796               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
004797           STRING 'VALORE KO PER PARAM.QUALIFIC.: '
004798                                      C6SP01A-CDQUALIT(1:12)
004799               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
004800        END-IF
004801     END-IF
004802*
004803     IF  C6SP01A-CDESITO = SPACES
004804     AND C6SP01A-CDQUALIT(13:12) > SPACES
004805        MOVE WQ-CDTPQUA2           TO C6TBVLQL-CDTPQUA
004806        MOVE C6SP01A-CDQUALIT(13:12)
004807                                   TO C6TBVLQL-DSVAL
004808        PERFORM UT-SELECT-VLQL
004809        IF SQLCODE = ZEROES
004810           MOVE C6TBVLQL-CDVLPRQL  TO WQ-CDVLPRQL2
004811        ELSE
004812           MOVE 'E429'             TO C6SP01A-CDESITO
004813           STRING 'VALORE KO PAR.QL.:' C6SP01A-CDQUALIT(13:12)
004814               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
004815           STRING 'VALORE KO PER PARAM.QUALIFIC.: '
004816                                      C6SP01A-CDQUALIT(13:12)
004817               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
004818        END-IF
004819     END-IF
004820*
004821     IF  C6SP01A-CDESITO = SPACES
004822     AND C6SP01A-CDQUALIT(25:12) > SPACES
004823        MOVE WQ-CDTPQUA3           TO C6TBVLQL-CDTPQUA
004824        MOVE C6SP01A-CDQUALIT(25:12)
004825                                   TO C6TBVLQL-DSVAL
004826        PERFORM UT-SELECT-VLQL
004827        IF SQLCODE = ZEROES
004828           MOVE C6TBVLQL-CDVLPRQL  TO WQ-CDVLPRQL3
004829        ELSE
004830           MOVE 'E429'             TO C6SP01A-CDESITO
004831           STRING 'VALORE KO PAR.QL.:' C6SP01A-CDQUALIT(25:12)
004832               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
004833           STRING 'VALORE KO PER PARAM.QUALIFIC.: '
004834                                      C6SP01A-CDQUALIT(25:12)
004835               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
004836        END-IF
004837     END-IF
004838*
004839     IF  C6SP01A-CDESITO = SPACES
004840     AND C6SP01A-CDQUALIT(37:12) > SPACES
004841        MOVE WQ-CDTPQUA4           TO C6TBVLQL-CDTPQUA
004842        MOVE C6SP01A-CDQUALIT(37:12)
004843                                   TO C6TBVLQL-DSVAL
004844        PERFORM UT-SELECT-VLQL
004845        IF SQLCODE = ZEROES
004846           MOVE C6TBVLQL-CDVLPRQL  TO WQ-CDVLPRQL4
004847        ELSE
004848           MOVE 'E429'             TO C6SP01A-CDESITO
004849           STRING 'VALORE KO PAR.QL.:' C6SP01A-CDQUALIT(37:12)
004850               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
004851           STRING 'VALORE KO PER PARAM.QUALIFIC.: '
004852                                      C6SP01A-CDQUALIT(37:12)
004853               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
004854        END-IF
004855     END-IF
004856*
004857     IF  C6SP01A-CDESITO = SPACES
004858     AND C6SP01A-CDQUALIT(49:12) > SPACES
004859        MOVE WQ-CDTPQUA5           TO C6TBVLQL-CDTPQUA
004860        MOVE C6SP01A-CDQUALIT(49:12)
004861                                   TO C6TBVLQL-DSVAL
004862        PERFORM UT-SELECT-VLQL
004863        IF SQLCODE = ZEROES
004864           MOVE C6TBVLQL-CDVLPRQL  TO WQ-CDVLPRQL5
004865        ELSE
004866           MOVE 'E429'             TO C6SP01A-CDESITO
004867           STRING 'VALORE KO PAR.QL.:' C6SP01A-CDQUALIT(49:12)
004868               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
004869           STRING 'VALORE KO PER PARAM.QUALIFIC.: '
004870                                      C6SP01A-CDQUALIT(49:12)
004871               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
004872        END-IF
004873     END-IF
004874*
004875     IF  C6SP01A-CDESITO = SPACES
004876     AND C6SP01A-CDQUALIT(61:12) > SPACES
004877        MOVE WQ-CDTPQUA6           TO C6TBVLQL-CDTPQUA
004878        MOVE C6SP01A-CDQUALIT(61:12)
004879                                   TO C6TBVLQL-DSVAL
004880        PERFORM UT-SELECT-VLQL
004881        IF SQLCODE = ZEROES
004882           MOVE C6TBVLQL-CDVLPRQL  TO WQ-CDVLPRQL6
004883        ELSE
004884           MOVE 'E429'             TO C6SP01A-CDESITO
004885           STRING 'VALORE KO PAR.QL.:' C6SP01A-CDQUALIT(61:12)
004886               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
004887           STRING 'VALORE KO PER PARAM.QUALIFIC.: '
004888                                      C6SP01A-CDQUALIT(61:12)
004889               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
004890        END-IF
004891     END-IF
004892*
004893     IF  C6SP01A-CDESITO = SPACES
004894     AND C6SP01A-CDQUALIT(73:12) > SPACES
004895        MOVE WQ-CDTPQUA7           TO C6TBVLQL-CDTPQUA
004896        MOVE C6SP01A-CDQUALIT(73:12)
004897                                   TO C6TBVLQL-DSVAL
004898        PERFORM UT-SELECT-VLQL
004899        IF SQLCODE = ZEROES
004900           MOVE C6TBVLQL-CDVLPRQL  TO WQ-CDVLPRQL7
004901        ELSE
004902           MOVE 'E429'             TO C6SP01A-CDESITO
004903           STRING 'VALORE KO PAR.QL.:' C6SP01A-CDQUALIT(73:12)
004904               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
004905           STRING 'VALORE KO PER PARAM.QUALIFIC.: '
004906                                      C6SP01A-CDQUALIT(73:12)
004907               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
004908        END-IF
004909     END-IF
004910*
004911     IF  C6SP01A-CDESITO = SPACES
004912     AND C6SP01A-CDQUALIT(85:12) > SPACES
004913        MOVE WQ-CDTPQUA8           TO C6TBVLQL-CDTPQUA
004914        MOVE C6SP01A-CDQUALIT(85:12)
004915                                   TO C6TBVLQL-DSVAL
004916        PERFORM UT-SELECT-VLQL
004917        IF SQLCODE = ZEROES
004918           MOVE C6TBVLQL-CDVLPRQL  TO WQ-CDVLPRQL8
004919        ELSE
004920           MOVE 'E429'             TO C6SP01A-CDESITO
004921           STRING 'VALORE KO PAR.QL.:' C6SP01A-CDQUALIT(85:12)
004922               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
004923           STRING 'VALORE KO PER PARAM.QUALIFIC.: '
004924                                      C6SP01A-CDQUALIT(85:12)
004925               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
004926        END-IF
004927     END-IF
004928*
004929     IF  C6SP01A-CDESITO = SPACES
004930     AND C6SP01A-CDQUALIT(97:12) > SPACES
004931        MOVE WQ-CDTPQUA9           TO C6TBVLQL-CDTPQUA
004932        MOVE C6SP01A-CDQUALIT(97:12)
004933                                   TO C6TBVLQL-DSVAL
004934        PERFORM UT-SELECT-VLQL
004935        IF SQLCODE = ZEROES
004936           MOVE C6TBVLQL-CDVLPRQL  TO WQ-CDVLPRQL9
004937        ELSE
004938           MOVE 'E429'             TO C6SP01A-CDESITO
004939           STRING 'VALORE KO PAR.QL.:' C6SP01A-CDQUALIT(97:12)
004940               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
004941           STRING 'VALORE KO PER PARAM.QUALIFIC.: '
004942                                      C6SP01A-CDQUALIT(97:12)
004943               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
004944        END-IF
004945     END-IF
004946*
004947     IF  C6SP01A-CDESITO = SPACES
004948     AND C6SP01A-CDQUALIT(109:12) > SPACES
004949        MOVE WQ-CDTPQUA10          TO C6TBVLQL-CDTPQUA
004950        MOVE C6SP01A-CDQUALIT(109:12)
004951                                   TO C6TBVLQL-DSVAL
004952        PERFORM UT-SELECT-VLQL
004953        IF SQLCODE = ZEROES
004954           MOVE C6TBVLQL-CDVLPRQL  TO WQ-CDVLPRQL10
004955        ELSE
004956           MOVE 'E429'             TO C6SP01A-CDESITO
004957           STRING 'VALORE KO PAR.QL.:' C6SP01A-CDQUALIT(109:12)
004958               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
004959           STRING 'VALORE KO PER PARAM.QUALIFIC.: '
004960                                      C6SP01A-CDQUALIT(109:12)
004961               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
004962        END-IF
004963     END-IF
004964*
004965* REPERIMENTO QUALIFICATORI PADRI
004966     MOVE ZEROES                   TO WQ-INDM
004967     MOVE WS-CDSERINT              TO C6TBSTQL-CDSERINT
004968     MOVE WQ-CDVLPRQL1             TO C6TBSTQL-CDVLPRQL1
004969     MOVE WQ-CDVLPRQL2             TO C6TBSTQL-CDVLPRQL2
004970     MOVE WQ-CDVLPRQL3             TO C6TBSTQL-CDVLPRQL3
004971     MOVE WQ-CDVLPRQL4             TO C6TBSTQL-CDVLPRQL4
004972     MOVE WQ-CDVLPRQL5             TO C6TBSTQL-CDVLPRQL5
004973     MOVE WQ-CDVLPRQL6             TO C6TBSTQL-CDVLPRQL6
004974     MOVE WQ-CDVLPRQL7             TO C6TBSTQL-CDVLPRQL7
004975     MOVE WQ-CDVLPRQL8             TO C6TBSTQL-CDVLPRQL8
004976     MOVE WQ-CDVLPRQL9             TO C6TBSTQL-CDVLPRQL9
004977     MOVE WQ-CDVLPRQL10            TO C6TBSTQL-CDVLPRQL10
004978  EXEC SQL OPEN CD_QUALIF END-EXEC 
004979     IF SQLCODE NOT = ZEROES
004980        MOVE 'OCQUALIF' TO WS-SQLACC
004981        PERFORM ERRORE-SQL
004982     END-IF
004983*
004984     PERFORM UT-FETCH-CD-QUALIF
004985     PERFORM UNTIL SQLCODE = +100
004986                OR C6SP01A-CDESITO > SPACES
004987        IF WQ-INDM = WQ-IND-MAX
004988           MOVE 'E098'             TO C6SP01A-CDESITO
004989           MOVE 'SFONDAMENTO TAB.QUALIFICATORI'
004990                                   TO C6SP01A-DSERTEXT-BREVE
004991           MOVE 'SFONDAMENTO TAB.QUALIFICATORI'
004992                                   TO C6SP01A-DSERTEXT-MEDIO
004993        ELSE
004994           ADD 1                   TO WQ-INDM
004995           EVALUATE WQ-INDM
004996               WHEN 1  MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF1
004997               WHEN 2  MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF2
004998               WHEN 3  MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF3
004999               WHEN 4  MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF4
005000               WHEN 5  MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF5
005001               WHEN 6  MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF6
005002               WHEN 7  MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF7
005003               WHEN 8  MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF8
005004               WHEN 9  MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF9
005005               WHEN 10 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF10
005006               WHEN 11 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF11
005007               WHEN 12 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF12
005008               WHEN 13 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF13
005009               WHEN 14 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF14
005010               WHEN 15 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF15
005011               WHEN 16 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF16
005012               WHEN 17 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF17
005013               WHEN 18 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF18
005014               WHEN 19 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF19
005015               WHEN 20 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF20
005016               WHEN 21 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF21
005017               WHEN 22 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF22
005018               WHEN 23 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF23
005019               WHEN 24 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF24
005020               WHEN 25 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF25
005021               WHEN 26 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF26
005022               WHEN 27 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF27
005023               WHEN 28 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF28
005024               WHEN 29 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF29
005025               WHEN 30 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF30
005026               WHEN 31 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF31
005027               WHEN 32 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF32
005028               WHEN 33 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF33
005029               WHEN 34 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF34
005030               WHEN 35 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF35
005031               WHEN 36 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF36
005032               WHEN 37 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF37
005033               WHEN 38 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF38
005034               WHEN 39 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF39
005035               WHEN 40 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF40
005036               WHEN 41 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF41
005037               WHEN 42 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF42
005038               WHEN 43 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF43
005039               WHEN 44 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF44
005040               WHEN 45 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF45
005041               WHEN 46 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF46
005042               WHEN 47 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF47
005043               WHEN 48 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF48
005044               WHEN 49 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF49
005045               WHEN 50 MOVE C6TBSTQL-IDQUALIF TO WQ-IDQUALIF50
005046           END-EVALUATE
005047           PERFORM UT-FETCH-CD-QUALIF
005048        END-IF
005049     END-PERFORM
005050*
005051  EXEC SQL CLOSE CD_QUALIF END-EXEC 
005052     IF SQLCODE NOT = ZEROES
005053        MOVE 'CLQUALIF' TO WS-SQLACC
005054        PERFORM ERRORE-SQL
005055     END-IF.
005056*
005057******************
005058 UT-FETCH-CD-CRQL.
005059******************
005060*
005061  EXEC SQL FETCH CD_CRQL
005062  INTO :C6TBCRQL-CDTPQUA
005063  ,:C6TBCRQL-NRPRIOR
005064  END-EXEC 
005065     IF NOT (SQLCODE = ZEROES OR +100)
005066        MOVE 'FTCRQL'   TO WS-SQLACC
005067        PERFORM ERRORE-SQL
005068     END-IF.
005069*
005070****************
005071 UT-SELECT-VLQL.
005072****************
005073*
005074  EXEC SQL
005075  SELECT CDVLPRQL
005076  INTO :C6TBVLQL-CDVLPRQL
005077  FROM C6TBVLQL
005078  WHERE CDTPQUA = :C6TBVLQL-CDTPQUA
005079  AND DSVAL   = :C6TBVLQL-DSVAL
005080  END-EXEC 
005081     IF NOT (SQLCODE = ZEROES OR +100)
005082        MOVE 'SLVLQL'   TO WS-SQLACC
005083        PERFORM ERRORE-SQL
005084     END-IF.
005085*
005086********************
005087 UT-FETCH-CD-QUALIF.
005088********************
005089*
005090  EXEC SQL FETCH CD_QUALIF
005091  INTO :C6TBSTQL-IDQUALIF
005092  END-EXEC 
005093     IF NOT (SQLCODE = ZEROES OR +100)
005094        MOVE 'FTQUALIF' TO WS-SQLACC
005095        PERFORM ERRORE-SQL
005096     END-IF.
005097*
005098*******************
005099 UT-REPER-CDENTITA.
005100*******************
005101     MOVE '*** UT-REPER-CDENTITA' TO WS-MESSAGGIO
005102     PERFORM TRACCIA
005103*
005104     MOVE ZEROES                   TO WL-INDM
005105*
005106* TIPO ENTITA' = OGGETTO/SUB-OGGETTO
005107     IF C6SP01A-CDTPENT = '3' OR '4'
005108        PERFORM UT-REPER-CDOGGETT
005109     END-IF
005110*
005111* TIPO ENTITA' = CONVENZIONE
005112     IF C6SP01A-CDTPENT = '2'
005113        PERFORM UT-REPER-CDCNV
005114     END-IF
005115*
005116* TIPO ENTITA' = LISTINO
005117     IF C6SP01A-CDTPENT = '1'
005118        PERFORM UT-REPER-LISTIN-PADRI
005119     END-IF
005120     .
005121*******************
005122 UT-REPER-CDOGGETT.
005123*******************
005124     MOVE '*** UT-REPER-CDOGGETT' TO WS-MESSAGGIO
005125     PERFORM TRACCIA
005126*
005127     MOVE SPACES                   TO WS-DTINIZIO-OLD
005128* REPERIMENTO LISTINO DELL'OGGETTO ED EVENTUALI PADRI
005129     MOVE WS-CDSERINT              TO C6TBLCOG-CDSERINT
005130     MOVE WS-DTINIZIO-DB2          TO C6TBLCOG-DTINIZIO
005131     MOVE WS-DTFINE-DB2            TO C6TBLCOG-DTFINE
005132     MOVE C6SP01A-CDENTITA(1:30)   TO C6TBOGCZ-CDOGGEST
005133  EXEC SQL OPEN CD_LCOG END-EXEC 
005134     IF SQLCODE NOT = ZEROES
005135        MOVE 'OCLCOG' TO WS-SQLACC
005136        PERFORM ERRORE-SQL
005137     END-IF
005138*
005139     PERFORM UT-FETCH-CD-LCOG
005140     IF SQLCODE = ZEROES
005141        MOVE C6TBLCOG-CDOGGETT     TO WS-CDOGGETT
005142     END-IF
005143     PERFORM UNTIL SQLCODE = +100
005144                OR C6SP01A-CDESITO > SPACES
005145        IF C6TBLCOG-DTINIZIO NOT = WS-DTINIZIO-OLD
005146        AND WL-INDM = WL-IND-MAX
005147           MOVE 'E098'             TO C6SP01A-CDESITO
005148           MOVE 'SFOND.TAB.LISTINI LCOG'
005149                                   TO C6SP01A-DSERTEXT-BREVE
005150           MOVE 'SFONDAMENTO TAB.LISTINI LCOG'
005151                                   TO C6SP01A-DSERTEXT-MEDIO
005152        END-IF
005153        IF C6TBLCOG-DTINIZIO = WS-DTINIZIO-OLD
005154        AND WL-INDR = WL-INDR-MAX
005155           MOVE 'E098'             TO C6SP01A-CDESITO
005156           MOVE 'SFOND.TAB.LISTINI PADRI'
005157                                   TO C6SP01A-DSERTEXT-BREVE
005158           MOVE 'SFONDAMENTO TAB.LISTINI PADRI'
005159                                   TO C6SP01A-DSERTEXT-MEDIO
005160        END-IF
005161        IF C6SP01A-CDESITO = SPACES
005162           IF C6TBLCOG-DTINIZIO NOT = WS-DTINIZIO-OLD
005163              MOVE C6TBLCOG-DTINIZIO
005164                                   TO WS-DTINIZIO-OLD
005165              ADD 1                TO WL-INDM
005166              MOVE ZEROES          TO WL-INDR
005167              MOVE C6TBLCOG-DTINIZIO
005168                                   TO WL-DTINIZIO-LCOG(WL-INDM)
005169              MOVE C6TBLCOG-DTFINE TO WL-DTFINE-LCOG(WL-INDM)
005170           END-IF
005171           ADD 1                   TO WL-INDR
005172           MOVE C6TBLCOG-CDCOMB
005173             TO WL-CDCOMB(WL-INDM, WL-INDR)
005174           PERFORM UT-FETCH-CD-LCOG
005175        END-IF
005176     END-PERFORM
005177*
005178  EXEC SQL CLOSE CD_LCOG END-EXEC 
005179     IF SQLCODE NOT = ZEROES
005180        MOVE 'CLLCOG' TO WS-SQLACC
005181        PERFORM ERRORE-SQL
005182     END-IF
005183     IF WL-INDM = ZEROES
005184        MOVE 'E462'                TO C6SP01A-CDESITO
005185        MOVE 'OGGETTO/LISTINO NON TROVATO'
005186                                   TO C6SP01A-DSERTEXT-BREVE
005187        MOVE 'OGGETTO/LISTINO NON TROVATO'
005188                                   TO C6SP01A-DSERTEXT-MEDIO
005189     END-IF.
005190*
005191* ESTRAZIONE LEGAMI A CONVENZIONE
005192     IF C6SP01A-CDESITO = SPACES
005193*       MOVE ZEROES                TO WV-INDM
005194*
005195*       MOVE WS-CDOGGETT           TO C6TBCVOG-CDOGGETT
005196*       MOVE WS-CDSERINT           TO C6TBCVOG-CDSERINT
005197*       MOVE WS-DTINIZIO-DB2       TO C6TBCVOG-DTINIZIO
005198*       MOVE WS-DTFINE-DB2         TO C6TBCVOG-DTFINE
005199*       EXEC SQL OPEN CD_CVOG END-EXEC
005200*       IF SQLCODE NOT = ZEROES
005201*          MOVE "OCCVOG" TO WS-SQLACC
005202*          PERFORM ERRORE-SQL
005203*       END-IF
005204*       PERFORM UT-FETCH-CD-CVOG
005205*       PERFORM UNTIL SQLCODE = +100
005206*                  OR C6SP01A-CDESITO > SPACES
005207*          IF WV-INDM = WV-IND-MAX
005208*             MOVE "E098"          TO C6SP01A-CDESITO
005209*             MOVE "SFOND.TAB.CONVENZIONI"
005210*                                  TO C6SP01A-DSERTEXT-BREVE
005211*             MOVE "SFONDAMENTO TAB.CONVENZIONI"
005212*                                  TO C6SP01A-DSERTEXT-MEDIO
005213*          ELSE
005214*             ADD 1                TO WV-INDM
005215*             MOVE C6TBCVOG-CDCNV  TO WV-CDCNV(WV-INDM)
005216*             MOVE C6TBCVOG-DTINIZIO
005217*                                  TO WV-DTINIZIO-CVOG(WV-INDM)
005218*             MOVE C6TBCVOG-DTFINE TO WV-DTFINE-CVOG(WV-INDM)
005219*             PERFORM UT-FETCH-CD-CVOG
005220*          END-IF
005221*       END-PERFORM
005222*       EXEC SQL CLOSE CD_CVOG END-EXEC
005223*       IF SQLCODE NOT = ZEROES
005224*          MOVE "CLCVOG" TO WS-SQLACC
005225*          PERFORM ERRORE-SQL
005226*       END-IF
005227        PERFORM UT-REPER-LEGAMI-CNV
005228     END-IF
005229     .
005230******************
005231 UT-FETCH-CD-LCOG.
005232******************
005233*
005234  EXEC SQL FETCH CD_LCOG
005235  INTO :C6TBLCOG-CDOGGETT
005236  ,:C6TBLCOG-DTINIZIO
005237  ,:C6TBLCOG-DTFINE
005238  ,:C6TBLCOG-CDCOMB
005239  END-EXEC 
005240     IF NOT (SQLCODE = ZEROES OR +100)
005241        MOVE 'FTLCOG'   TO WS-SQLACC
005242        PERFORM ERRORE-SQL
005243     END-IF.
005244*
005245******************
005246 UT-FETCH-CD-CVOG.
005247******************
005248*
005249  EXEC SQL FETCH CD_CVOG
005250  INTO :C6TBCVOG-CDCNV
005251  ,:C6TBCVOG-DTINIZIO
005252  ,:C6TBCVOG-DTFINE
005253  END-EXEC 
005254     IF NOT (SQLCODE = ZEROES OR +100)
005255        MOVE 'FTCVOG'   TO WS-SQLACC
005256        PERFORM ERRORE-SQL
005257     END-IF.
005258*
005259*********************
005260 UT-REPER-LEGAMI-CNV.
005261*********************
005262     MOVE '*** UT-REPER-LEGAMI-CNV'    TO WS-MESSAGGIO
005263     PERFORM TRACCIA
005264*
005265* CARICO TAB. APPOGGIO TAB. CVOG
005266     MOVE ZEROES                   TO WVA-INDM
005267*
005268     MOVE WS-CDOGGETT              TO C6TBCVOG-CDOGGETT
005269     MOVE WS-CDSERINT              TO C6TBCVOG-CDSERINT
005270     MOVE WS-DTINIZIO-DB2          TO C6TBCVOG-DTINIZIO
005271     MOVE WS-DTFINE-DB2            TO C6TBCVOG-DTFINE
005272  EXEC SQL OPEN CD_CVOG END-EXEC 
005273     IF SQLCODE NOT = ZEROES
005274        MOVE 'OCCVOG' TO WS-SQLACC
005275        PERFORM ERRORE-SQL
005276     END-IF
005277     PERFORM UT-FETCH-CD-CVOG
005278     PERFORM UNTIL SQLCODE = +100
005279                OR C6SP01A-CDESITO > SPACES
005280        IF WVA-INDM = WVA-IND-MAX
005281           MOVE 'E098'             TO C6SP01A-CDESITO
005282           MOVE 'SFOND.TAB.CVOG APPO'
005283                                   TO C6SP01A-DSERTEXT-BREVE
005284           MOVE 'SFONDAMENTO TAB. CVOG APPO'
005285                                   TO C6SP01A-DSERTEXT-MEDIO
005286        ELSE
005287           ADD 1                   TO WVA-INDM
005288           MOVE C6TBCVOG-CDCNV     TO WVA-CDCNV-CVOG   (WVA-INDM)
005289           MOVE C6TBCVOG-DTINIZIO  TO WVA-DTINIZIO-CVOG(WVA-INDM)
005290           MOVE C6TBCVOG-DTFINE    TO WVA-DTFINE-CVOG  (WVA-INDM)
005291           PERFORM UT-FETCH-CD-CVOG
005292        END-IF
005293     END-PERFORM
005294  EXEC SQL CLOSE CD_CVOG END-EXEC 
005295     IF SQLCODE NOT = ZEROES
005296        MOVE 'CLCVOG' TO WS-SQLACC
005297        PERFORM ERRORE-SQL
005298     END-IF
005299*
005300* CARICO TAB. DATE
005301     MOVE 1                        TO WD-IND-POS
005302     PERFORM VARYING WVA-IND FROM 1 BY 1
005303       UNTIL WVA-IND > WVA-INDM
005304          OR C6SP01A-CDESITO > SPACES
005305        MOVE SPACES                TO WD-SNDATE
005306        PERFORM VARYING WD-IND FROM WD-IND-POS BY 1
005307          UNTIL WD-IND > WD-INDM
005308             OR WD-SIDATE
005309             OR C6SP01A-CDESITO > SPACES
005310           IF WD-DTINIZIO(WD-IND) = WVA-DTINIZIO-CVOG(WVA-IND)
005311              SET  WD-SIDATE       TO TRUE
005312              MOVE WD-IND          TO WD-IND-POS
005313           END-IF
005314           IF WD-DTINIZIO(WD-IND) > WVA-DTINIZIO-CVOG(WVA-IND)
005315              SET  WD-SIDATE       TO TRUE
005316              IF WD-INDM = WD-IND-MAX
005317                 MOVE 'E098'       TO C6SP01A-CDESITO
005318                 MOVE 'SFOND.TAB.DATE'
005319                                   TO C6SP01A-DSERTEXT-BREVE
005320                 MOVE 'SFONDAMENTO TAB. DATE'
005321                                   TO C6SP01A-DSERTEXT-MEDIO
005322              ELSE
005323* CREA SPAZIO WD
005324                 PERFORM VARYING WS-SC FROM WD-INDM BY -1
005325                   UNTIL WS-SC < WD-IND
005326                    MOVE WD-DTINIZIO(WS-SC)
005327                                   TO WD-DTINIZIO(WS-SC + 1)
005328                    MOVE WD-DTFINE(WS-SC)
005329                                   TO WD-DTFINE  (WS-SC + 1)
005330                 END-PERFORM
005331                 ADD 1             TO WD-INDM
005332*
005333                 MOVE WVA-DTINIZIO-CVOG(WVA-IND)
005334                                   TO WD-DTINIZIO(WD-IND)
005335                 MOVE WD-IND       TO WD-IND-POS
005336              END-IF
005337           END-IF
005338        END-PERFORM
005339        IF  C6SP01A-CDESITO = SPACES
005340        AND NOT WD-SIDATE
005341           IF WD-INDM = WD-IND-MAX
005342              MOVE 'E098'          TO C6SP01A-CDESITO
005343              MOVE 'SFOND.TAB.DATE'
005344                                   TO C6SP01A-DSERTEXT-BREVE
005345              MOVE 'SFONDAMENTO TAB. DATE'
005346                                   TO C6SP01A-DSERTEXT-MEDIO
005347           ELSE
005348              ADD 1                TO WD-INDM
005349              MOVE WVA-DTINIZIO-CVOG(WVA-IND)
005350                                   TO WD-DTINIZIO(WD-INDM)
005351              MOVE WD-INDM         TO WD-IND-POS
005352           END-IF
005353        END-IF
005354        IF  C6SP01A-CDESITO = SPACES
005355        AND WVA-DTFINE-CVOG(WVA-IND) < '9999-12-31'
005356           MOVE WVA-DTFINE-CVOG(WVA-IND)
005357                                   TO WS-UTDATA-DATA-1-DB2
005358           PERFORM UTDATA-SOMMA
005359           MOVE WS-UTDATA-DATA-2-DB2
005360                                   TO WS-DTINIZIO-APP
005361        END-IF
005362        IF  C6SP01A-CDESITO = SPACES
005363        AND WVA-DTFINE-CVOG(WVA-IND) < '9999-12-31'
005364           MOVE SPACES             TO WD-SNDATE
005365           PERFORM VARYING WD-IND2 FROM WD-IND BY 1
005366             UNTIL WD-IND2 > WD-INDM
005367                OR WD-SIDATE
005368                OR C6SP01A-CDESITO > SPACES
005369              IF WD-DTINIZIO(WD-IND2) = WS-DTINIZIO-APP
005370                 SET WD-SIDATE     TO TRUE
005371              END-IF
005372              IF WD-DTINIZIO(WD-IND2) > WS-DTINIZIO-APP
005373                 SET WD-SIDATE     TO TRUE
005374                 IF WD-INDM = WD-IND-MAX
005375                    MOVE 'E098'    TO C6SP01A-CDESITO
005376                    MOVE 'SFOND.TAB.DATE'
005377                                   TO C6SP01A-DSERTEXT-BREVE
005378                    MOVE 'SFONDAMENTO TAB. DATE'
005379                                   TO C6SP01A-DSERTEXT-MEDIO
005380                 ELSE
005381* CREA SPAZIO WD
005382                    PERFORM VARYING WS-SC FROM WD-INDM BY -1
005383                      UNTIL WS-SC < WD-IND2
005384                       MOVE WD-DTINIZIO(WS-SC)
005385                                   TO WD-DTINIZIO(WS-SC + 1)
005386                       MOVE WD-DTFINE(WS-SC)
005387                                   TO WD-DTFINE(WS-SC + 1)
005388                    END-PERFORM
005389                    ADD 1          TO WD-INDM
005390                    MOVE WS-DTINIZIO-APP TO WD-DTINIZIO(WD-IND2)
005391                 END-IF
005392              END-IF
005393           END-PERFORM
005394           IF  C6SP01A-CDESITO = SPACES
005395           AND NOT WD-SIDATE
005396              IF WD-INDM = WD-IND-MAX
005397                 MOVE 'E098'       TO C6SP01A-CDESITO
005398                 MOVE 'SFOND.TAB.DATE'
005399                                   TO C6SP01A-DSERTEXT-BREVE
005400                 MOVE 'SFONDAMENTO TAB. DATE'
005401                                   TO C6SP01A-DSERTEXT-MEDIO
005402              ELSE
005403                 ADD 1             TO WD-INDM
005404                 MOVE WS-DTINIZIO-APP TO WD-DTINIZIO(WD-INDM)
005405              END-IF
005406           END-IF
005407        END-IF
005408     END-PERFORM
005409*
005410* PREPARAZIONE INTERVALLI MINIMI
005411     IF  C6SP01A-CDESITO = SPACES
005412     AND WD-INDM > ZEROES
005413        PERFORM VARYING WD-IND FROM 2 BY 1
005414          UNTIL WD-IND > WD-INDM
005415           MOVE WD-DTINIZIO(WD-IND)  TO WS-UTDATA-DATA-1-DB2
005416           PERFORM UTDATA-SOTTR
005417           MOVE WS-UTDATA-DATA-2-DB2 TO WD-DTFINE(WD-IND - 1)
005418        END-PERFORM
005419*
005420        MOVE '9999-12-31'            TO WD-DTFINE(WD-INDM)
005421        MOVE ZEROES                  TO WV-INDDM
005422        PERFORM VARYING WD-IND FROM 1 BY 1
005423          UNTIL WD-IND > WD-INDM
005424             OR C6SP01A-CDESITO > SPACES
005425           PERFORM VARYING WVA-IND FROM 1 BY 1
005426             UNTIL WVA-IND > WVA-INDM
005427                OR WVA-DTINIZIO-CVOG(WVA-IND) > WD-DTFINE(WD-IND)
005428                OR C6SP01A-CDESITO > SPACES
005429              IF (WVA-DTINIZIO-CVOG(WVA-IND) <= WD-DTFINE(WD-IND)
005430              AND WVA-DTFINE-CVOG(WVA-IND) >= WD-DTINIZIO(WD-IND))
005431                 IF WD-IND > WV-INDD-MAX
005432                    MOVE 'E098'    TO C6SP01A-CDESITO
005433                    MOVE 'SFOND.TAB.DATE'
005434                                   TO C6SP01A-DSERTEXT-BREVE
005435                    MOVE 'SFONDAMENTO TAB. DATE'
005436                                   TO C6SP01A-DSERTEXT-MEDIO
005437                 ELSE
005438                    IF WD-IND NOT = WV-INDDM
005439                       MOVE WD-IND TO WV-INDDM
005440                       MOVE ZEROES TO WV-INDCM
005441                       MOVE WD-DTINIZIO(WD-IND)
005442                                   TO WV-DTINIZIO-CVOG(WV-INDDM)
005443                       MOVE WD-DTFINE(WD-IND)
005444                                   TO WV-DTFINE-CVOG(WV-INDDM)
005445                    END-IF
005446                    IF WV-INDCM > WV-INDC-MAX
005447                       MOVE 'E098' TO C6SP01A-CDESITO
005448                       MOVE 'SFOND.TAB.CONVENZIONI'
005449                                   TO C6SP01A-DSERTEXT-BREVE
005450                       MOVE 'SFONDAMENTO TAB. CONVENZIONI'
005451                                   TO C6SP01A-DSERTEXT-MEDIO
005452                    ELSE
005453                       ADD 1       TO WV-INDCM
005454                       MOVE WVA-CDCNV-CVOG(WVA-IND)
005455                                   TO WV-CDCNV(WV-INDDM WV-INDCM)
005456                    END-IF
005457                 END-IF
005458              END-IF
005459           END-PERFORM
005460        END-PERFORM
005461     END-IF.
005462*
005463****************
005464 UT-REPER-CDCNV.
005465****************
005466     MOVE '*** UT-REPER-CDCNV'         TO WS-MESSAGGIO
005467     PERFORM TRACCIA
005468*
005469*    MOVE C6SP01A-CDENTITA         TO C6TBACNV-CDCNV
005470     MOVE C6SP01A-CDENTITA         TO C6TBACNV-CDCNVEST
005471*
005472  EXEC SQL
005473  SELECT CDCNV
005474  INTO :C6TBACNV-CDCNV
005475  FROM C6TBACNV
005476  WHERE CDCNVEST = :C6TBACNV-CDCNVEST
005477  WITH UR
005478  END-EXEC 
005479     IF SQLCODE NOT = ZEROES
005480        MOVE 'SLACNV' TO WS-SQLACC
005481        PERFORM ERRORE-SQL
005482     END-IF
005483*
005484     IF SQLCODE = ZEROES
005485*       MOVE 1                     TO WV-INDM
005486        MOVE 1                     TO WV-INDDM
005487*       MOVE C6TBACNV-CDCNV        TO WV-CDCNV(WV-INDM)
005488        MOVE C6TBACNV-CDCNV        TO WV-CDCNV(WV-INDDM 1)
005489*       MOVE WS-DTINIZIO-DB2       TO WV-DTINIZIO-CVOG(WV-INDM)
005490*       MOVE WS-DTFINE-DB2         TO WV-DTFINE-CVOG  (WV-INDM)
005491        MOVE WS-DTINIZIO-DB2       TO WV-DTINIZIO-CVOG(WV-INDDM)
005492        MOVE WS-DTFINE-DB2         TO WV-DTFINE-CVOG  (WV-INDDM)
005493     ELSE
005494        MOVE 'ED29'                TO C6SP01A-CDESITO
005495        MOVE 'CONVENZIONE NON ESISTENTE'
005496                                   TO C6SP01A-DSERTEXT-BREVE
005497        MOVE 'CONVENZIONE NON ESISTENTE'
005498                                   TO C6SP01A-DSERTEXT-MEDIO
005499     END-IF.
005500*
005501***********************
005502 UT-REPER-LISTIN-PADRI.
005503***********************
005504     MOVE '*** UT-REPER-LISTIN-PADRI' TO WS-MESSAGGIO
005505     PERFORM TRACCIA
005506*
005507* RICERCA PARAMETRI DI LISTINO ASSOCIATI AL SERVIZIO
005508     MOVE WS-CDSERINT              TO C6TBCRTZ-CDSERINT
005509*
005510  EXEC SQL OPEN CD_CRTZ END-EXEC 
005511     IF SQLCODE NOT = ZEROES
005512        MOVE 'OCCRTZ' TO WS-SQLACC
005513        PERFORM ERRORE-SQL
005514     END-IF
005515*
005516     PERFORM UT-FETCH-CD-CRTZ
005517     PERFORM UNTIL SQLCODE = +100
005518        EVALUATE C6TBCRTZ-NRPRIOR
005519            WHEN 1  MOVE C6TBCRTZ-CDTPGRP TO WL-CDTPGRP1
005520            WHEN 2  MOVE C6TBCRTZ-CDTPGRP TO WL-CDTPGRP2
005521            WHEN 3  MOVE C6TBCRTZ-CDTPGRP TO WL-CDTPGRP3
005522            WHEN 4  MOVE C6TBCRTZ-CDTPGRP TO WL-CDTPGRP4
005523            WHEN 5  MOVE C6TBCRTZ-CDTPGRP TO WL-CDTPGRP5
005524        END-EVALUATE
005525        PERFORM UT-FETCH-CD-CRTZ
005526     END-PERFORM
005527*
005528  EXEC SQL CLOSE CD_CRTZ END-EXEC 
005529     IF SQLCODE NOT = ZEROES
005530        MOVE 'CLCRTZ' TO WS-SQLACC
005531        PERFORM ERRORE-SQL
005532     END-IF
005533*
005534* CONTROLLO VALORI
005535     IF C6SP01A-CDENTITA(1:12) > SPACES
005536        MOVE WL-CDTPGRP1           TO C6TBGRCZ-CDTPGRP
005537        MOVE C6SP01A-CDENTITA(1:12)
005538                                   TO C6TBGRCZ-DSVAL
005539        PERFORM UT-SELECT-GRCZ
005540        IF SQLCODE = ZEROES
005541           MOVE C6TBGRCZ-CDGRP     TO WL-CDGRP1
005542        ELSE
005543           MOVE 'E429'             TO C6SP01A-CDESITO
005544           STRING 'VALORE KO PAR.LS.:' C6SP01A-CDENTITA(1:12)
005545               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
005546           STRING 'VALORE KO PER PARAM. LISTINO : '
005547                                      C6SP01A-CDENTITA(1:12)
005548               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
005549        END-IF
005550     END-IF
005551*
005552     IF  C6SP01A-CDESITO = SPACES
005553     AND C6SP01A-CDENTITA(13:12) > SPACES
005554        MOVE WL-CDTPGRP2           TO C6TBGRCZ-CDTPGRP
005555        MOVE C6SP01A-CDENTITA(13:12)
005556                                   TO C6TBGRCZ-DSVAL
005557        PERFORM UT-SELECT-GRCZ
005558        IF SQLCODE = ZEROES
005559           MOVE C6TBGRCZ-CDGRP     TO WL-CDGRP2
005560        ELSE
005561           MOVE 'E429'             TO C6SP01A-CDESITO
005562           STRING 'VALORE KO PAR.LS.:' C6SP01A-CDENTITA(13:12)
005563               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
005564           STRING 'VALORE KO PER PARAM. LISTINO : '
005565                                      C6SP01A-CDENTITA(13:12)
005566               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
005567        END-IF
005568     END-IF
005569*
005570     IF  C6SP01A-CDESITO = SPACES
005571     AND C6SP01A-CDENTITA(25:12) > SPACES
005572        MOVE WL-CDTPGRP3           TO C6TBGRCZ-CDTPGRP
005573        MOVE C6SP01A-CDENTITA(25:12)
005574                                   TO C6TBGRCZ-DSVAL
005575        PERFORM UT-SELECT-GRCZ
005576        IF SQLCODE = ZEROES
005577           MOVE C6TBGRCZ-CDGRP     TO WL-CDGRP3
005578        ELSE
005579           MOVE 'E429'             TO C6SP01A-CDESITO
005580           STRING 'VALORE KO PAR.LS.:' C6SP01A-CDENTITA(25:12)
005581               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
005582           STRING 'VALORE KO PER PARAM. LISTINO : '
005583                                      C6SP01A-CDENTITA(25:12)
005584               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
005585        END-IF
005586     END-IF
005587*
005588     IF  C6SP01A-CDESITO = SPACES
005589     AND C6SP01A-CDENTITA(37:12) > SPACES
005590        MOVE WL-CDTPGRP4           TO C6TBGRCZ-CDTPGRP
005591        MOVE C6SP01A-CDENTITA(37:12)
005592                                   TO C6TBGRCZ-DSVAL
005593        PERFORM UT-SELECT-GRCZ
005594        IF SQLCODE = ZEROES
005595           MOVE C6TBGRCZ-CDGRP     TO WL-CDGRP4
005596        ELSE
005597           MOVE 'E429'             TO C6SP01A-CDESITO
005598           STRING 'VALORE KO PAR.LS.:' C6SP01A-CDENTITA(37:12)
005599               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
005600           STRING 'VALORE KO PER PARAM. LISTINO : '
005601                                      C6SP01A-CDENTITA(37:12)
005602               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
005603        END-IF
005604     END-IF
005605*
005606     IF  C6SP01A-CDESITO = SPACES
005607     AND C6SP01A-CDENTITA(49:12) > SPACES
005608        MOVE WL-CDTPGRP5           TO C6TBGRCZ-CDTPGRP
005609        MOVE C6SP01A-CDENTITA(49:12)
005610                                   TO C6TBGRCZ-DSVAL
005611        PERFORM UT-SELECT-GRCZ
005612        IF SQLCODE = ZEROES
005613           MOVE C6TBGRCZ-CDGRP     TO WL-CDGRP5
005614        ELSE
005615           MOVE 'E429'             TO C6SP01A-CDESITO
005616           STRING 'VALORE KO PAR.LS.:' C6SP01A-CDENTITA(49:12)
005617               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
005618           STRING 'VALORE KO PER PARAM. LISTINO : '
005619                                      C6SP01A-CDENTITA(49:12)
005620               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
005621        END-IF
005622     END-IF
005623*
005624* REPERIMENTO LISTINI PADRI
005625     IF C6SP01A-CDESITO = SPACES
005626*       MOVE 1                     TO WL-INDM
005627        MOVE ZEROES                TO WL-INDM
005628        MOVE ZEROES                TO WL-INDR
005629        MOVE WS-CDSERINT           TO C6TBPRFM-CDSERINT
005630        MOVE WL-CDGRP1             TO C6TBSTCB-CDGRP1
005631        MOVE WL-CDGRP2             TO C6TBSTCB-CDGRP2
005632        MOVE WL-CDGRP3             TO C6TBSTCB-CDGRP3
005633        MOVE WL-CDGRP4             TO C6TBSTCB-CDGRP4
005634        MOVE WL-CDGRP5             TO C6TBSTCB-CDGRP5
005635  EXEC SQL OPEN CD_LISTIN END-EXEC 
005636        IF SQLCODE NOT = ZEROES
005637           MOVE 'OCLISTIN' TO WS-SQLACC
005638           PERFORM ERRORE-SQL
005639        END-IF
005640        PERFORM UT-FETCH-CD-LISTIN
005641        PERFORM UNTIL SQLCODE = +100
005642                   OR C6SP01A-CDESITO > SPACES
005643           IF WL-INDR = WL-INDR-MAX
005644              MOVE 'E098'          TO C6SP01A-CDESITO
005645              MOVE 'SFOND.TAB.LISTINI PADRI'
005646                                   TO C6SP01A-DSERTEXT-BREVE
005647              MOVE 'SFONDAMENTO TAB.LISTINI PADRI'
005648                                   TO C6SP01A-DSERTEXT-MEDIO
005649           ELSE
005650              MOVE 1               TO WL-INDM
005651              MOVE WS-DTINIZIO-DB2 TO WL-DTINIZIO-LCOG(WL-INDM)
005652              MOVE WS-DTFINE-DB2   TO WL-DTFINE-LCOG(WL-INDM)
005653              ADD 1                TO WL-INDR
005654              MOVE C6TBSTCB-CDCOMB
005655                TO WL-CDCOMB(WL-INDM, WL-INDR)
005656              PERFORM UT-FETCH-CD-LISTIN
005657           END-IF
005658        END-PERFORM
005659  EXEC SQL CLOSE CD_LISTIN END-EXEC 
005660        IF SQLCODE NOT = ZEROES
005661           MOVE 'CLLISTIN' TO WS-SQLACC
005662           PERFORM ERRORE-SQL
005663        END-IF
005664     END-IF.
005665*
005666******************
005667 UT-FETCH-CD-CRTZ.
005668******************
005669*
005670  EXEC SQL FETCH CD_CRTZ
005671  INTO :C6TBCRTZ-CDTPGRP
005672  ,:C6TBCRTZ-NRPRIOR
005673  END-EXEC 
005674     IF NOT (SQLCODE = ZEROES OR +100)
005675        MOVE 'FTCRTZ'   TO WS-SQLACC
005676        PERFORM ERRORE-SQL
005677     END-IF.
005678*
005679****************
005680 UT-SELECT-GRCZ.
005681****************
005682*
005683  EXEC SQL
005684  SELECT CDGRP
005685  INTO :C6TBGRCZ-CDGRP
005686  FROM C6TBGRCZ
005687  WHERE CDTPGRP = :C6TBGRCZ-CDTPGRP
005688  AND DSVAL   = :C6TBGRCZ-DSVAL
005689  END-EXEC 
005690     IF NOT (SQLCODE = ZEROES OR +100)
005691        MOVE 'SLGRCZ'   TO WS-SQLACC
005692        PERFORM ERRORE-SQL
005693     END-IF.
005694*
005695********************
005696 UT-FETCH-CD-LISTIN.
005697********************
005698*
005699  EXEC SQL FETCH CD_LISTIN
005700  INTO :C6TBSTCB-CDCOMB
005701  END-EXEC 
005702     IF NOT (SQLCODE = ZEROES OR +100)
005703        MOVE 'FTLISTIN' TO WS-SQLACC
005704        PERFORM ERRORE-SQL
005705     END-IF.
005706*
005707*********************
005708 UT-REPER-CONDIZIONI.
005709*********************
005710     MOVE '*** UT-REPER-CONDIZIONI'    TO WS-MESSAGGIO
005711     PERFORM TRACCIA
005712*
005713     MOVE ZEROES                   TO WC-INDM
005714*
005715* ESTRAZIONE PER LISTA
005716     IF C6SP01A-CDTPRICH = '0'
005717        MOVE C6SP01A-CDTPLST       TO C6TBLSCZ-CDTPLST
005718        MOVE C6SP01A-CDLISTA       TO C6TBLSCZ-CDLISTA
005719  EXEC SQL OPEN CD_LISTA END-EXEC 
005720        IF SQLCODE NOT = ZEROES
005721           MOVE 'OCLISTA'  TO WS-SQLACC
005722           PERFORM ERRORE-SQL
005723        END-IF
005724        PERFORM UT-FETCH-CD-LISTA
005725        PERFORM UNTIL SQLCODE = +100
005726                   OR C6SP01A-CDESITO > SPACES
005727           IF WC-INDM = WC-IND-MAX
005728              MOVE 'E098'          TO C6SP01A-CDESITO
005729              MOVE 'SFONDAMENTO TAB.CONDIZIONI'
005730                                   TO C6SP01A-DSERTEXT-BREVE
005731              MOVE 'SFONDAMENTO TAB.CONDIZIONI'
005732                                   TO C6SP01A-DSERTEXT-MEDIO
005733           ELSE
005734              ADD 1                TO WC-INDM
005735              MOVE C6TBELCZ-NRPRELEM
005736                                   TO WC-NRPRELEM(WC-INDM)
005737              MOVE C6TBCDZI-IDCDZ  TO WC-IDCDZ(WC-INDM)
005738              IF C6TBCDZI-DSCDZBR-LEN > ZEROES
005739                 MOVE C6TBCDZI-DSCDZBR-TEXT
005740                                          (1:C6TBCDZI-DSCDZBR-LEN)
005741                                   TO WC-DSCDZBR(WC-INDM)
005742              ELSE
005743                 MOVE SPACES       TO WC-DSCDZBR(WC-INDM)
005744              END-IF
005745              MOVE C6TBCZCO-NRPRIOR
005746                                   TO WC-NRPRCOMP(WC-INDM)
005747              MOVE C6TBCZCO-IDCOMP TO WC-IDCOMP  (WC-INDM)
005748              IF C6TBCZCO-DSLEGBR-LEN > ZEROES
005749                 MOVE C6TBCZCO-DSLEGBR-TEXT
005750                                          (1:C6TBCZCO-DSLEGBR-LEN)
005751                                   TO WC-DSLEGBR(WC-INDM)
005752              ELSE
005753                 MOVE SPACES       TO WC-DSLEGBR(WC-INDM)
005754              END-IF
005755              MOVE C6TBCDZI-CDNATCDZ
005756                                   TO WC-CDNATCDZ(WC-INDM)
005757              MOVE C6TBCOMP-CDTPFORM
005758                                   TO WC-CDTPFORM(WC-INDM)
005759              MOVE C6TBCOMP-NRDECIM
005760                                   TO WC-NRDECIM (WC-INDM)
005761              MOVE C6TBCOMP-NRDIMENS
005762                                   TO WC-NRDIMENS(WC-INDM)
005763              MOVE C6TBCZCO-CDSPREAD
005764                                   TO WC-CDSPREAD(WC-INDM)
005765              MOVE C6TBCZCO-CDCALCSPR
005766                                   TO WC-CDCALCSPR(WC-INDM)
005767              MOVE C6TBCZCO-CDESTREM
005768                                   TO WC-CDESTREM(WC-INDM)
005769              MOVE C6TBCZCO-SNSUPSTD
005770                                   TO WC-SNSUPSTD(WC-INDM)
005771*             TEMP. ELIM. DEL TRATTAMENTO DI CAP&FLOOR
005772*             MOVE "N"
005773*                                  TO WC-CDTPCAR(WC-INDM)
005774*             RIPRISTINO  DEL TRATTAMENTO DI CAP&FLOOR
005775              MOVE C6TBCDZI-CDTPCAR
005776                                   TO WC-CDTPCAR(WC-INDM)
005777             PERFORM UT-FETCH-CD-LISTA
005778           END-IF
005779        END-PERFORM
005780  EXEC SQL CLOSE CD_LISTA END-EXEC 
005781        IF SQLCODE NOT = ZEROES
005782           MOVE 'CLLISTA'  TO WS-SQLACC
005783           PERFORM ERRORE-SQL
005784        END-IF
005785     END-IF
005786*
005787* ESTRAZIONE PER CONDIZIONE
005788     IF C6SP01A-CDTPRICH = '1'
005789        MOVE WS-CDSERINT           TO C6TBCDZI-CDSERINT
005790        MOVE C6SP01A-DSCDZBR       TO WS-DAO-CDCAMPO
005791        PERFORM CALCOLA-LUNGHEZZA
005792        MOVE WS-DAO-NRIND          TO C6TBCDZI-DSCDZBR-LEN
005793        MOVE WS-DAO-CDCAMPO        TO C6TBCDZI-DSCDZBR-TEXT
005794  EXEC SQL OPEN CD_CDZCMP END-EXEC 
005795        IF SQLCODE NOT = ZEROES
005796           MOVE 'OCCDZCMP' TO WS-SQLACC
005797           PERFORM ERRORE-SQL
005798        END-IF
005799        PERFORM UT-FETCH-CD-CDZCMP
005800        PERFORM UNTIL SQLCODE = +100
005801                   OR C6SP01A-CDESITO > SPACES
005802           IF WC-INDM= WC-IND-MAX
005803              MOVE 'E098'          TO C6SP01A-CDESITO
005804              MOVE 'SFONDAMENTO TAB.CONDIZIONI'
005805                                   TO C6SP01A-DSERTEXT-BREVE
005806              MOVE 'SFONDAMENTO TAB.CONDIZIONI'
005807                                   TO C6SP01A-DSERTEXT-MEDIO
005808           ELSE
005809              ADD 1                TO WC-INDM
005810              MOVE 1               TO WC-NRPRELEM(WC-INDM)
005811              MOVE C6TBCDZI-IDCDZ  TO WC-IDCDZ(WC-INDM)
005812              MOVE C6SP01A-DSCDZBR TO WC-DSCDZBR(WC-INDM)
005813              MOVE C6TBCZCO-NRPRIOR
005814                                   TO WC-NRPRCOMP(WC-INDM)
005815              MOVE C6TBCZCO-IDCOMP TO WC-IDCOMP  (WC-INDM)
005816              IF C6TBCZCO-DSLEGBR-LEN > ZEROES
005817                 MOVE C6TBCZCO-DSLEGBR-TEXT
005818                                          (1:C6TBCZCO-DSLEGBR-LEN)
005819                                   TO WC-DSLEGBR(WC-INDM)
005820              ELSE
005821                 MOVE SPACES       TO WC-DSLEGBR(WC-INDM)
005822              END-IF
005823              MOVE C6TBCDZI-CDNATCDZ
005824                                   TO WC-CDNATCDZ(WC-INDM)
005825              MOVE C6TBCOMP-CDTPFORM
005826                                   TO WC-CDTPFORM(WC-INDM)
005827              MOVE C6TBCOMP-NRDECIM
005828                                   TO WC-NRDECIM (WC-INDM)
005829              MOVE C6TBCOMP-NRDIMENS
005830                                   TO WC-NRDIMENS(WC-INDM)
005831              MOVE C6TBCZCO-CDSPREAD
005832                                   TO WC-CDSPREAD(WC-INDM)
005833              MOVE C6TBCZCO-CDCALCSPR
005834                                   TO WC-CDCALCSPR(WC-INDM)
005835              MOVE C6TBCZCO-CDESTREM
005836                                   TO WC-CDESTREM(WC-INDM)
005837              MOVE C6TBCZCO-SNSUPSTD
005838                                   TO WC-SNSUPSTD(WC-INDM)
005839*             TEMP. ELIM. DEL TRATTAMENTO DI CAP&FLOOR
005840*             MOVE "N"
005841*                                  TO WC-CDTPCAR (WC-INDM)
005842*             RIPRISTINO DEL TRATTAMENTO DI CAP&FLOOR
005843              MOVE C6TBCDZI-CDTPCAR
005844                                   TO WC-CDTPCAR (WC-INDM)
005845             PERFORM UT-FETCH-CD-CDZCMP
005846           END-IF
005847        END-PERFORM
005848  EXEC SQL CLOSE CD_CDZCMP END-EXEC 
005849        IF SQLCODE NOT = ZEROES
005850           MOVE 'CLCDZCMP' TO WS-SQLACC
005851           PERFORM ERRORE-SQL
005852        END-IF
005853     END-IF
005854*
005855* ESTRAZIONE PER CONDIZIONE-COMPONENTE
005856     IF C6SP01A-CDTPRICH = '2'
005857        MOVE WS-CDSERINT           TO C6TBCDZI-CDSERINT
005858        MOVE C6SP01A-DSCDZBR       TO WS-DAO-CDCAMPO
005859        PERFORM CALCOLA-LUNGHEZZA
005860        MOVE WS-DAO-NRIND          TO C6TBCDZI-DSCDZBR-LEN
005861        MOVE WS-DAO-CDCAMPO        TO C6TBCDZI-DSCDZBR-TEXT
005862        MOVE C6SP01A-DSLEGBR       TO WS-DAO-CDCAMPO
005863        PERFORM CALCOLA-LUNGHEZZA
005864        MOVE WS-DAO-NRIND          TO C6TBCZCO-DSLEGBR-LEN
005865        MOVE WS-DAO-CDCAMPO        TO C6TBCZCO-DSLEGBR-TEXT
005866  EXEC SQL
005867  SELECT CDZI.IDCDZ
005868  ,CZCO.NRPRIOR
005869  ,CZCO.IDCOMP
005870  ,CDZI.CDNATCDZ
005871  ,COMP.CDTPFORM
005872  ,COMP.NRDECIM
005873  ,COMP.NRDIMENS
005874  ,CZCO.CDSPREAD
005875  ,CZCO.CDCALCSPR
005876  ,CZCO.CDESTREM
005877  ,CZCO.SNSUPSTD
005878  ,CDZI.CDTPCAR
005879  INTO :C6TBCDZI-IDCDZ
005880  ,:C6TBCZCO-NRPRIOR
005881  ,:C6TBCZCO-IDCOMP
005882  ,:C6TBCDZI-CDNATCDZ
005883  ,:C6TBCOMP-CDTPFORM
005884  ,:C6TBCOMP-NRDECIM
005885  ,:C6TBCOMP-NRDIMENS
005886  ,:C6TBCZCO-CDSPREAD
005887  ,:C6TBCZCO-CDCALCSPR
005888  ,:C6TBCZCO-CDESTREM
005889  ,:C6TBCZCO-SNSUPSTD
005890  ,:C6TBCDZI-CDTPCAR
005891  FROM C6TBCDZI CDZI,
005892  C6TBCZCO CZCO,
005893  C6TBCOMP COMP
005894  WHERE CDZI.DSCDZBR  = :C6TBCDZI-DSCDZBR
005895  AND CZCO.DSLEGBR  = :C6TBCZCO-DSLEGBR
005896  AND CDZI.CDSERINT = :C6TBCDZI-CDSERINT
005897  AND CDZI.IDCDZ    = CZCO.IDCDZ
005898  AND CZCO.IDCOMPEL = COMP.IDCOMPEL
005899  END-EXEC 
005900        IF SQLCODE NOT = ZEROES
005901           MOVE 'SLCDZCMP' TO WS-SQLACC
005902           PERFORM ERRORE-SQL
005903        END-IF
005904        ADD 1                      TO WC-INDM
005905        MOVE 1                     TO WC-NRPRELEM(WC-INDM)
005906        MOVE C6TBCDZI-IDCDZ        TO WC-IDCDZ(WC-INDM)
005907        MOVE C6SP01A-DSCDZBR       TO WC-DSCDZBR(WC-INDM)
005908        MOVE C6TBCZCO-NRPRIOR      TO WC-NRPRCOMP(WC-INDM)
005909        MOVE C6TBCZCO-IDCOMP       TO WC-IDCOMP(WC-INDM)
005910        MOVE C6SP01A-DSLEGBR       TO WC-DSLEGBR(WC-INDM)
005911        MOVE C6TBCDZI-CDNATCDZ     TO WC-CDNATCDZ(WC-INDM)
005912        MOVE C6TBCOMP-CDTPFORM     TO WC-CDTPFORM(WC-INDM)
005913        MOVE C6TBCOMP-NRDECIM      TO WC-NRDECIM (WC-INDM)
005914        MOVE C6TBCOMP-NRDIMENS     TO WC-NRDIMENS(WC-INDM)
005915        MOVE C6TBCZCO-CDSPREAD     TO WC-CDSPREAD(WC-INDM)
005916        MOVE C6TBCZCO-CDCALCSPR    TO WC-CDCALCSPR(WC-INDM)
005917        MOVE C6TBCZCO-CDESTREM     TO WC-CDESTREM (WC-INDM)
005918        MOVE C6TBCZCO-SNSUPSTD     TO WC-SNSUPSTD (WC-INDM)
005919*       TEMP. ELIM. DEL TRATTAMENTO DI CAP&FLOOR
005920*       MOVE "N"                   TO WC-CDTPCAR  (WC-INDM)
005921*       RIPRISTINO  DEL TRATTAMENTO DI CAP&FLOOR
005922        MOVE C6TBCDZI-CDTPCAR      TO WC-CDTPCAR  (WC-INDM)
005923     END-IF
005924*
005925     IF WC-INDM = ZEROES
005926        MOVE 'E110'                TO C6SP01A-CDESITO
005927        MOVE 'NESSUNA CONDIZIONE ESTRATTA'
005928                                   TO C6SP01A-DSERTEXT-BREVE
005929        MOVE 'NESSUNA CONDIZIONE ESTRATTA'
005930                                   TO C6SP01A-DSERTEXT-MEDIO
005931     END-IF.
005932*
005933*******************
005934 UT-FETCH-CD-LISTA.
005935*******************
005936*
005937  EXEC SQL FETCH CD_LISTA
005938  INTO :C6TBELCZ-NRPRELEM
005939  ,:C6TBCDZI-IDCDZ
005940  ,:C6TBCDZI-DSCDZBR
005941  ,:C6TBCZCO-NRPRIOR
005942  ,:C6TBCZCO-IDCOMP
005943  ,:C6TBCZCO-DSLEGBR
005944  ,:C6TBCDZI-CDNATCDZ
005945  ,:C6TBCOMP-CDTPFORM
005946  ,:C6TBCOMP-NRDECIM
005947  ,:C6TBCOMP-NRDIMENS
005948  ,:C6TBCZCO-CDSPREAD
005949  ,:C6TBCZCO-CDCALCSPR
005950  ,:C6TBCZCO-CDESTREM
005951  ,:C6TBCZCO-SNSUPSTD
005952  ,:C6TBCDZI-CDTPCAR
005953  END-EXEC 
005954     IF NOT (SQLCODE = ZEROES OR +100)
005955        MOVE 'FTLISTA ' TO WS-SQLACC
005956        PERFORM ERRORE-SQL
005957     END-IF.
005958*
005959********************
005960 UT-FETCH-CD-CDZCMP.
005961********************
005962*
005963  EXEC SQL FETCH CD_CDZCMP
005964  INTO :C6TBCDZI-IDCDZ
005965  ,:C6TBCDZI-DSCDZBR
005966  ,:C6TBCZCO-NRPRIOR
005967  ,:C6TBCZCO-IDCOMP
005968  ,:C6TBCZCO-DSLEGBR
005969  ,:C6TBCDZI-CDNATCDZ
005970  ,:C6TBCOMP-CDTPFORM
005971  ,:C6TBCOMP-NRDECIM
005972  ,:C6TBCOMP-NRDIMENS
005973  ,:C6TBCZCO-CDSPREAD
005974  ,:C6TBCZCO-CDCALCSPR
005975  ,:C6TBCZCO-CDESTREM
005976  ,:C6TBCZCO-SNSUPSTD
005977  ,:C6TBCDZI-CDTPCAR
005978  END-EXEC 
005979     IF NOT (SQLCODE = ZEROES OR +100)
005980        MOVE 'FTCDZCMP' TO WS-SQLACC
005981        PERFORM ERRORE-SQL
005982     END-IF.
005983*
005984************************
005985 UT-REPER-STORIA-INDICE.
005986************************
005987     MOVE '*** UT-REPER-STORIA-INDICE'   TO WS-MESSAGGIO
005988     PERFORM TRACCIA
005989*
005990     MOVE WC-EL-CDZCMP(WC-IND)     TO WAPP-CDZCMP
005991     MOVE WS-DTINIZIO-DB2          TO WA-DTINIZIO
005992     MOVE WS-DTFINE-DB2            TO WA-DTFINE
005993     MOVE ZEROES                   TO WA-NRPRREGO
005994*
005995* ESTRAZIONE PER CONDIZIONE
005996     MOVE WA-IDCDZ                 TO C6TBCZCO-IDCDZ
005997  EXEC SQL
005998  SELECT CZCO.NRPRIOR
005999  ,CZCO.IDCOMP
006000  ,CZCO.DSLEGBR
006001  ,COMP.CDTPFORM
006002  ,COMP.NRDECIM
006003  ,COMP.NRDIMENS
006004  ,CZCO.CDSPREAD
006005  ,CZCO.CDCALCSPR
006006  ,CZCO.CDESTREM
006007  INTO :C6TBCZCO-NRPRIOR
006008  ,:C6TBCZCO-IDCOMP
006009  ,:C6TBCZCO-DSLEGBR
006010  ,:C6TBCOMP-CDTPFORM
006011  ,:C6TBCOMP-NRDECIM
006012  ,:C6TBCOMP-NRDIMENS
006013  ,:C6TBCZCO-CDSPREAD
006014  ,:C6TBCZCO-CDCALCSPR
006015  ,:C6TBCZCO-CDESTREM
006016  ,:C6TBCZCO-SNSUPSTD
006017  FROM C6TBCZCO CZCO,
006018  C6TBCOMP COMP
006019  WHERE CZCO.IDCDZ    = :C6TBCZCO-IDCDZ
006020  AND CZCO.CDSPREAD = 'I'
006021  AND CZCO.IDCOMPEL = COMP.IDCOMPEL
006022  WITH UR
006023  END-EXEC 
006024     EVALUATE SQLCODE
006025         WHEN ZEROES
006026              MOVE C6TBCZCO-NRPRIOR  TO WA-NRPRELEM
006027              MOVE C6TBCZCO-IDCOMP   TO WA-IDCOMP
006028              IF C6TBCZCO-DSLEGBR-LEN > ZEROES
006029                 MOVE C6TBCZCO-DSLEGBR-TEXT
006030                                       (1:C6TBCZCO-DSLEGBR-LEN)
006031                                      TO WA-DSLEGBR
006032              ELSE
006033                 MOVE SPACES          TO WA-DSLEGBR
006034              END-IF
006035              MOVE C6TBCOMP-CDTPFORM  TO WA-CDTPFORM
006036              MOVE C6TBCOMP-NRDECIM   TO WA-NRDECIM
006037              MOVE C6TBCOMP-NRDIMENS  TO WA-NRDIMENS
006038              MOVE C6TBCZCO-CDSPREAD  TO WA-CDSPREAD
006039              MOVE C6TBCZCO-CDCALCSPR
006040                                      TO WA-CDCALCSPR
006041              MOVE C6TBCZCO-CDESTREM  TO WA-CDESTREM
006042              MOVE C6TBCZCO-CDESTREM  TO WA-SNSUPSTD
006043         WHEN +100
006044              MOVE 'EF44'       TO C6SP01A-CDESITO
006045              MOVE 'COMPONENTE INDICE NON PRESENTE'
006046                                TO C6SP01A-DSERTEXT-BREVE
006047              MOVE 'COMPONENTE INDICE NON PRESENTE'
006048                                TO C6SP01A-DSERTEXT-MEDIO
006049         WHEN OTHER
006050              MOVE 'SLCZCO'     TO WS-SQLACC
006051              PERFORM ERRORE-SQL
006052     END-EVALUATE.
006053*
006054     IF C6SP01A-CDESITO = SPACES
006055        PERFORM UT-REPER-VALORI
006056     END-IF
006057*
006058     PERFORM VARYING WP-IND FROM 1 BY 1
006059       UNTIL WP-IND > WP-INDM
006060          OR C6SP01A-CDESITO > SPACES
006061        IF WP-IND = 1
006062        OR WP-CDVALALF(WP-IND) NOT = WP-CDVALALF(WP-IND - 1)
006063        OR WP-CDVALNUM(WP-IND) NOT = WP-CDVALNUM(WP-IND - 1)
006064        OR WP-CDAPPLIV(WP-IND) NOT = WP-CDAPPLIV(WP-IND - 1)
006065        OR WP-CDINDICE(WP-IND) NOT = WP-CDINDICE(WP-IND - 1)
006066           IF WI-INDM >= WI-IND-MAX
006067              MOVE 'E098'                TO C6SP01A-CDESITO
006068              MOVE 'SFONDAMENTO TAB.APP WI'
006069                                         TO C6SP01A-DSERTEXT-BREVE
006070              MOVE 'SFONDAMENTO TAB.APP WI'
006071                                         TO C6SP01A-DSERTEXT-MEDIO
006072           ELSE
006073              ADD 1                      TO WI-INDM
006074              MOVE WP-DTINIZIO(WP-IND)   TO WI-DTINIZIO(WI-INDM)
006075              MOVE WP-DTFINE  (WP-IND)   TO WI-DTFINE  (WI-INDM)
006076              MOVE WP-CDVALALF(WP-IND)   TO WI-CDINDICE(WI-INDM)
006077           END-IF
006078        ELSE
006079*  COMPATTAMENTO
006080           MOVE WP-DTFINE (WP-IND)       TO WI-DTFINE  (WI-INDM)
006081        END-IF
006082     END-PERFORM.
006083*
006084     MOVE SPACES TO WS-MESSAGGIO
006085     STRING '---> WI-INDM : ' WI-INDM
006086             DELIMITED BY SIZE INTO WS-MESSAGGIO
006087     PERFORM TRACCIA.
006088*
006089*****************
006090 UT-REPER-VALORI.
006091*****************
006092     MOVE SPACES TO WS-MESSAGGIO
006093     STRING '*** UT-REPER-VALORI (' WA-DTINIZIO ' ' WA-DTFINE '/'
006094                                WA-DSCDZBR ' ' WA-IDCDZ '/'
006095                                WA-DSLEGBR ' ' WA-IDCOMP '/'
006096                                WA-CDSPREAD ')'
006097             DELIMITED BY '  '   INTO WS-MESSAGGIO
006098     PERFORM TRACCIA
006099*
006100* INIZIALIZZAZIONE COMODI
006101     MOVE SPACES                   TO WS-DTINIZIO-VALO
006102     MOVE SPACES                   TO WS-DTFINE-VALO
006103     MOVE SPACES                   TO WS-CDVALALF-VALO
006104     MOVE ZEROES                   TO WS-CDVALNUM-VALO
006105     MOVE SPACES                   TO WS-CDINDICE-VALO
006106     MOVE SPACES                   TO WS-CDAPPLIV-VALO
006107*
006108     SET  WS-NO-FINE-RISALITA      TO TRUE
006109*
006110     MOVE ZEROES                   TO WP-INDM
006111     IF WA-CDSPREAD = 'I'
006112        MOVE ZEROES                TO WI-INDM
006113        MOVE WA-IDCDZ              TO WI-IDCDZ
006114     END-IF
006115*
006116* CREAZIONE TABELLA BUCHI
006117     IF  WA-CDSPREAD = 'S'
006118     AND WI-INDM  > ZEROES
006119     AND WI-IDCDZ = WA-IDCDZ
006120        IF C6SP01A-CDUTISPR = '0'
006121           MOVE SPACES TO WS-MESSAGGIO
006122           STRING '... STACCO: CARICO BUCHI DA INDICI (' WI-INDM
006123                  ')' DELIMITED BY SIZE INTO WS-MESSAGGIO
006124           PERFORM TRACCIA
006125           PERFORM VARYING WI-IND FROM 1 BY 1
006126             UNTIL WI-IND > WI-INDM
006127              MOVE WI-IND          TO WB-INDM
006128              MOVE WI-DTINIZIO(WI-IND)
006129                                   TO WB-DTINIZIO(WB-INDM)
006130              MOVE WI-DTFINE(WI-IND)
006131                                   TO WB-DTFINE  (WB-INDM)
006132              MOVE WI-CDINDICE(WI-IND)
006133                                   TO WB-CDINDICE(WB-INDM)
006134              MOVE ZEROES          TO WB-NRDECIM-INDI (WB-INDM)
006135              MOVE ZEROES          TO WB-CDVALNUM-INDI(WB-INDM)
006136           END-PERFORM
006137        ELSE
006138           PERFORM UT-REPER-VALORI-INDICI
006139        END-IF
006140     ELSE
006141        MOVE 1                     TO WB-INDM
006142        MOVE WA-DTINIZIO           TO WB-DTINIZIO(WB-INDM)
006143        MOVE WA-DTFINE             TO WB-DTFINE  (WB-INDM)
006144        MOVE SPACES                TO WB-CDINDICE(WB-INDM)
006145        MOVE ZEROES                TO WB-NRDECIM-INDI (WB-INDM)
006146        MOVE ZEROES                TO WB-CDVALNUM-INDI(WB-INDM)
006147     END-IF
006148*
006149     IF C6SP01A-CDESITO = SPACES
006150        EVALUATE C6SP01A-CDTPENT
006151            WHEN '0' PERFORM UT-REPER-VALIST
006152            WHEN '1' PERFORM UT-REPER-VALLST
006153            WHEN '2' PERFORM UT-REPER-VALCNV
006154            WHEN '3' PERFORM UT-REPER-VALOGG
006155            WHEN '4' PERFORM UT-REPER-VALSUB
006156        END-EVALUATE
006157     END-IF
006158*
006159* VERIFICA ED EV. PREP. TABELLE PER ALLINEAMENTO A STD SU SPR
006160     IF  C6SP01A-CDESITO  = SPACES
006161     AND WA-CDSPREAD      = 'S'
006162     AND C6SP01A-CDUTISPR = '1'
006163     AND (C6SP01A-CDTPENT NOT = '0')
006164        PERFORM UT-VERIF-ALLINEAMENTO
006165     END-IF
006166     .
006167*****************
006168 UT-REPER-VALOGG.
006169*****************
006170     MOVE '>>> UT-REPER-VALOGG'        TO WS-MESSAGGIO
006171     PERFORM TRACCIA
006172*
006173     MOVE WS-CDOGGETT              TO C6TBVAOG-CDOGGETT
006174     MOVE WS-CDSERINT              TO C6TBVAOG-CDSERINT
006175     MOVE WA-IDCDZ                 TO C6TBVAOG-IDCDZ
006176     MOVE WA-IDCOMP                TO C6TBVAOG-IDCOMPON
006177     MOVE WB-DTINIZIO(1)           TO C6TBVAOG-DTINIZIO
006178     MOVE WB-DTFINE(WB-INDM)       TO C6TBVAOG-DTFINE
006179*
006180  EXEC SQL OPEN CD_VALOGG END-EXEC 
006181     IF SQLCODE NOT = ZEROES
006182        MOVE 'OCVALOGG' TO WS-SQLACC
006183        PERFORM ERRORE-SQL
006184     END-IF
006185*
006186     PERFORM UT-FETCH-CD-VALOGG
006187*
006188     PERFORM UNTIL SQLCODE = +100
006189                OR WS-SI-FINE-RISALITA
006190                OR C6SP01A-CDESITO > SPACES
006191        IF C6TBVAOG-CDVALALF-LEN > ZEROES
006192           MOVE C6TBVAOG-CDVALALF-TEXT(1:C6TBVAOG-CDVALALF-LEN)
006193             TO WS-CDVALALF-VALO
006194        ELSE
006195           MOVE SPACES             TO WS-CDVALALF-VALO
006196        END-IF
006197        MOVE C6TBVAOG-CDVALNUM     TO WS-CDVALNUM-VALO
006198        MOVE C6TBVAOG-DTINIZIO     TO WS-DTINIZIO-VALO
006199        MOVE C6TBVAOG-DTFINE       TO WS-DTFINE-VALO
006200        MOVE SPACES                TO WS-CDINDICE-VALO
006201        MOVE 'O'                   TO WS-CDAPPLIV-VALO
006202        PERFORM UT-CARICA-AREA-APPOGGIO
006203        IF C6SP01A-CDESITO = SPACES
006204           PERFORM UT-FETCH-CD-VALOGG
006205        END-IF
006206     END-PERFORM
006207*
006208  EXEC SQL CLOSE CD_VALOGG END-EXEC 
006209     IF SQLCODE NOT = ZEROES
006210        MOVE 'CLVALOGG' TO WS-SQLACC
006211        PERFORM ERRORE-SQL
006212     END-IF
006213*
006214* COMPLETO I BUCHI CON LE DEROGHE DI CONVENZIONE
006215     IF  C6SP01A-CDESITO = SPACES
006216     AND WS-NO-FINE-RISALITA
006217*    AND WV-INDM > ZEROES
006218     AND WV-INDDM > ZEROES
006219        PERFORM UT-REPER-VALCNV
006220     END-IF
006221*
006222* COMPLETO I BUCHI CON LE DEROGHE DI LISTINO
006223     IF  C6SP01A-CDESITO = SPACES
006224     AND WS-NO-FINE-RISALITA
006225     AND WL-INDM > ZEROES
006226        PERFORM UT-REPER-VALLST
006227     END-IF
006228*
006229* COMPLETO I BUCHI CON LE DEROGHE DI ISTITUTO
006230     IF  C6SP01A-CDESITO = SPACES
006231     AND WS-NO-FINE-RISALITA
006232        PERFORM UT-REPER-VALIST
006233     END-IF
006234     .
006235********************
006236 UT-FETCH-CD-VALOGG.
006237********************
006238*
006239  EXEC SQL FETCH CD_VALOGG
006240  INTO :C6TBVAOG-DTINIZIO
006241  ,:C6TBVAOG-DTFINE
006242  ,:C6TBVAOG-CDVALALF
006243  ,:C6TBVAOG-CDVALNUM
006244  ,:C6TBPRQL-NRPRIOR
006245  END-EXEC 
006246     IF NOT (SQLCODE = ZEROES OR +100)
006247        MOVE 'FTVALOGG' TO WS-SQLACC
006248        PERFORM ERRORE-SQL
006249     END-IF.
006250*
006251*************************
006252 UT-CARICA-AREA-APPOGGIO.
006253*************************
006254     MOVE SPACES TO WS-MESSAGGIO
006255     STRING '    UT-CARICA-AREA-APPOGGIO : '
006256             WS-DTINIZIO-VALO ' ' WS-DTFINE-VALO ' '
006257             WS-CDINDICE-VALO ' TOT. WB ' WB-INDM
006258             DELIMITED BY SIZE INTO WS-MESSAGGIO
006259     PERFORM TRACCIA
006260*
006261* RICERCA NELLA TABELLA BUCHI SE LA DEROGA NE COPRE QUALCUNO
006262     SET WS-NO-FINE-RICERCA            TO TRUE
006263*
006264     PERFORM VARYING WB-IND FROM 1 BY 1
006265       UNTIL WB-IND > WB-INDM
006266          OR WS-SI-FINE-RICERCA
006267          OR C6SP01A-CDESITO > SPACES
006268        MOVE SPACES TO WS-MESSAGGIO
006269        STRING WB-IND ' WB-DATE >' WB-DTINIZIO(WB-IND) ' '
006270                                   WB-DTFINE  (WB-IND)
006271                      ' INDICE  >' WB-CDINDICE(WB-IND)
006272                DELIMITED BY SIZE INTO WS-MESSAGGIO
006273        PERFORM TRACCIA
006274        IF WB-DTINIZIO(WB-IND) > WS-DTFINE-VALO
006275           SET WS-SI-FINE-RICERCA      TO TRUE
006276        END-IF
006277        IF   WS-DTINIZIO-VALO <= WB-DTFINE  (WB-IND)
006278        AND  WS-DTFINE-VALO   >= WB-DTINIZIO(WB-IND)
006279        AND (WS-CDINDICE-VALO  = SPACES
006280        OR   WS-CDINDICE-VALO  = WB-CDINDICE(WB-IND))
006281           MOVE WB-CDINDICE(WB-IND)    TO WS-CDINDICE-VALO
006282           MOVE WB-NRDECIM-INDI (WB-IND)
006283                                       TO WS-NRDECIM-INDI
006284           MOVE WB-CDVALNUM-INDI(WB-IND)
006285                                       TO WS-CDVALNUM-INDI
006286           IF C6SP01A-DTINIRIC = C6SP01A-DTFINRIC
006287              MOVE WS-DTINIZIO-VALO    TO WMIN-DTINIZIO
006288           ELSE
006289              IF WS-DTINIZIO-VALO < WB-DTINIZIO(WB-IND)
006290                 MOVE WB-DTINIZIO(WB-IND)
006291                                       TO WMIN-DTINIZIO
006292              ELSE
006293                 MOVE WS-DTINIZIO-VALO TO WMIN-DTINIZIO
006294              END-IF
006295           END-IF
006296           IF C6SP01A-DTINIRIC = C6SP01A-DTFINRIC
006297              MOVE WS-DTFINE-VALO      TO WMIN-DTFINE
006298           ELSE
006299              IF WS-DTFINE-VALO > WB-DTFINE(WB-IND)
006300                 MOVE WB-DTFINE(WB-IND)
006301                                       TO WMIN-DTFINE
006302              ELSE
006303                 MOVE WS-DTFINE-VALO   TO WMIN-DTFINE
006304              END-IF
006305           END-IF
006306           PERFORM CARICO-WAPP-VALORI
006307           IF C6SP01A-CDESITO = SPACES
006308              PERFORM SISTEMAZIONE-TAB-BUCHI
006309              IF WB-INDM = 0
006310                 SET WS-SI-FINE-RICERCA TO TRUE
006311                 SET WS-SI-FINE-RISALITA TO TRUE
006312              END-IF
006313           END-IF
006314        END-IF
006315     END-PERFORM.
006316*
006317********************
006318 CARICO-WAPP-VALORI.
006319********************
006320     MOVE SPACES TO WS-MESSAGGIO
006321     STRING '    CARICO-WAPP-VALORI MIN: '
006322             WMIN-DTINIZIO ' ' WMIN-DTFINE
006323            ' TOT. WP ' WP-INDM
006324            DELIMITED BY SIZE INTO WS-MESSAGGIO
006325     PERFORM TRACCIA
006326*
006327* INSERIMENTO VALORE IN WAPP
006328     IF WP-INDM = 0
006329        PERFORM INSERIM-WAPP
006330     ELSE
006331        SET WS-NO-FINE-CARICO      TO TRUE
006332        PERFORM VARYING WP-IND FROM 1 BY 1
006333          UNTIL WP-IND > WP-INDM
006334             OR WS-SI-FINE-CARICO
006335             OR C6SP01A-CDESITO > SPACES
006336* INSERIMENTO VALORE IN WAPP PERCHE' SONO ALLA FINE
006337           IF  WP-IND = WP-INDM
006338           AND WMIN-DTINIZIO > WP-DTFINE(WP-IND)
006339              MOVE SPACES TO WS-MESSAGGIO
006340              STRING WP-IND ' INS. ALLA FINE ' WP-INDM ' ('
006341                     WP-DTINIZIO(WP-IND) '-' WP-DTFINE (WP-IND)
006342                     ')' DELIMITED BY SIZE INTO WS-MESSAGGIO
006343              PERFORM TRACCIA
006344              PERFORM INSERIM-WAPP
006345              SET WS-SI-FINE-CARICO TO TRUE
006346           ELSE
006347* INSERIMENTO VALORE TRA DUE VALORI
006348              IF (WP-IND = 1
006349              AND WMIN-DTFINE   < WP-DTINIZIO(WP-IND))
006350              OR (WMIN-DTINIZIO > WP-DTFINE  (WP-IND)
006351              AND WMIN-DTFINE   < WP-DTINIZIO(WP-IND + 1))
006352                 IF WP-INDM >= WP-IND-MAX
006353                    MOVE 'E098'          TO C6SP01A-CDESITO
006354                    MOVE 'SFONDAMENTO TAB.APP WP'
006355                                         TO C6SP01A-DSERTEXT-BREVE
006356                    MOVE 'SFONDAMENTO TAB.APP WP'
006357                                         TO C6SP01A-DSERTEXT-MEDIO
006358                 ELSE
006359                    MOVE SPACES TO WS-MESSAGGIO
006360                    STRING WP-IND ' INS. IN MEZZO ' WP-INDM ' ('
006361                           WP-DTINIZIO(WP-IND) '-'
006362                           WP-DTFINE (WP-IND)  ')'
006363                           DELIMITED BY SIZE INTO WS-MESSAGGIO
006364                    PERFORM TRACCIA
006365                    IF WP-IND > 1
006366                    OR (WMIN-DTINIZIO > WP-DTFINE  (WP-IND)
006367                    AND WMIN-DTFINE   < WP-DTINIZIO(WP-IND + 1))
006368                       ADD 1              TO WP-IND
006369                    END-IF
006370* CREA SPAZIO WP
006371                    PERFORM VARYING WS-SC FROM WP-INDM BY -1
006372                      UNTIL WS-SC < WP-IND
006373                       MOVE WP-VALO(WS-SC) TO WP-VALO(WS-SC + 1)
006374                    END-PERFORM
006375                    ADD 1                 TO WP-INDM
006376*
006377                    MOVE WMIN-DTINIZIO    TO WP-DTINIZIO(WP-IND)
006378                    MOVE WMIN-DTFINE      TO WP-DTFINE  (WP-IND)
006379                    IF  WA-CDSPREAD = 'S'
006380                    AND C6SP01A-CDUTISPR = '1'
006381                       PERFORM UT-CALCOLA-FINITO
006382                       MOVE WS-NRFINITO-VALO
006383                                          TO WP-CDVALNUM(WP-IND)
006384                    ELSE
006385                       MOVE WS-CDVALNUM-VALO
006386                                          TO WP-CDVALNUM(WP-IND)
006387                    END-IF
006388                    MOVE WS-CDVALALF-VALO TO WP-CDVALALF(WP-IND)
006389                    MOVE WS-CDINDICE-VALO TO WP-CDINDICE(WP-IND)
006390                    MOVE WS-CDAPPLIV-VALO TO WP-CDAPPLIV(WP-IND)
006391                    SET WS-SI-FINE-CARICO TO TRUE
006392                 END-IF
006393              END-IF
006394           END-IF
006395        END-PERFORM
006396     END-IF
006397     .
006398**************
006399 INSERIM-WAPP.
006400**************
006401     MOVE SPACES TO WS-MESSAGGIO
006402     STRING '    INSERIM-WAPP - WP-INDM: ' WP-INDM
006403            DELIMITED BY SIZE INTO WS-MESSAGGIO
006404     PERFORM TRACCIA
006405*
006406     IF WP-INDM >= WP-IND-MAX
006407        MOVE 'E098'                    TO C6SP01A-CDESITO
006408        MOVE 'SFONDAMENTO TAB.APP WP'  TO C6SP01A-DSERTEXT-BREVE
006409        MOVE 'SFONDAMENTO TAB.APP WP'  TO C6SP01A-DSERTEXT-MEDIO
006410     ELSE
006411        ADD 1                          TO WP-INDM
006412        MOVE WMIN-DTINIZIO             TO WP-DTINIZIO(WP-INDM)
006413        MOVE WMIN-DTFINE               TO WP-DTFINE  (WP-INDM)
006414        IF  WA-CDSPREAD = 'S'
006415        AND C6SP01A-CDUTISPR = '1'
006416           PERFORM UT-CALCOLA-FINITO
006417           MOVE WS-NRFINITO-VALO       TO WP-CDVALNUM(WP-INDM)
006418        ELSE
006419           MOVE WS-CDVALNUM-VALO       TO WP-CDVALNUM(WP-INDM)
006420        END-IF
006421        MOVE WS-CDVALALF-VALO          TO WP-CDVALALF(WP-INDM)
006422        MOVE WS-CDINDICE-VALO          TO WP-CDINDICE(WP-INDM)
006423        MOVE WS-CDAPPLIV-VALO          TO WP-CDAPPLIV(WP-INDM)
006424     END-IF
006425     .
006426************************
006427 SISTEMAZIONE-TAB-BUCHI.
006428************************
006429     MOVE SPACES TO WS-MESSAGGIO
006430     STRING WB-IND ' STEMAZIONE-TAB-BUCHI ' WB-DTINIZIO(WB-IND)
006431                   ' ' WB-DTFINE(WB-IND) ' TOT. WB ' WB-INDM
006432            DELIMITED BY SIZE INTO WS-MESSAGGIO
006433     PERFORM TRACCIA
006434*
006435     MOVE 'N'                           TO WS-SIST-TAB.
006436*
006437* DEROGA INTERAMENTE CONTENUTA NEL BUCO
006438     IF  WS-DTINIZIO-VALO > WB-DTINIZIO(WB-IND)
006439     AND WS-DTFINE-VALO   < WB-DTFINE  (WB-IND)
006440         MOVE 'S'                       TO WS-SIST-TAB
006441*... CREAZIONE NUOVA RIGA IN TABELLA BUCHI
006442        IF WB-INDM >= WB-IND-MAX
006443           MOVE 'E098'                  TO C6SP01A-CDESITO
006444           MOVE 'SFONDAMENTO TAB.BUCHI WB'
006445                                        TO C6SP01A-DSERTEXT-BREVE
006446           MOVE 'SFONDAMENTO TAB.BUCHI WB'
006447                                        TO C6SP01A-DSERTEXT-MEDIO
006448        ELSE
006449           PERFORM VARYING WS-SC FROM WB-INDM BY -1
006450             UNTIL WS-SC < WB-IND
006451              MOVE WB-DATE(WS-SC)       TO WB-DATE(WS-SC + 1)
006452           END-PERFORM
006453           ADD 1                        TO WB-INDM
006454*... CALCOLO DATA FINE DEL RECORD ANTECEDENTE
006455           MOVE WS-DTINIZIO-VALO        TO WS-UTDATA-DATA-1-DB2
006456           PERFORM UTDATA-SOTTR
006457           MOVE WS-UTDATA-DATA-2-DB2    TO WB-DTFINE(WB-IND)
006458*... CALCOLO DATA INIZIO DEL RECORD SUCCESSIVO
006459           MOVE WS-DTFINE-VALO          TO WS-UTDATA-DATA-1-DB2
006460           PERFORM UTDATA-SOMMA
006461           MOVE WS-UTDATA-DATA-2-DB2    TO WB-DTINIZIO(WB-IND + 1)
006462        END-IF
006463     END-IF
006464*
006465* DEROGA A CAVALLO DELLA DATA INIZIO BUCO
006466     IF  C6SP01A-CDESITO = SPACES
006467     AND WS-SIST-TAB = 'N'
006468     AND WS-DTINIZIO-VALO <= WB-DTINIZIO(WB-IND)
006469     AND WS-DTFINE-VALO   <  WB-DTFINE(WB-IND)
006470         MOVE 'S'                       TO WS-SIST-TAB
006471* ... CALCOLO NUOVA DATA INIZIO DEL BUCO IN TABELLA
006472         MOVE WS-DTFINE-VALO            TO WS-UTDATA-DATA-1-DB2
006473         PERFORM UTDATA-SOMMA
006474         MOVE WS-UTDATA-DATA-2-DB2      TO WB-DTINIZIO(WB-IND)
006475     END-IF
006476*
006477* DEROGA A CAVALLO DELLA DATA FINE BUCO
006478     IF  C6SP01A-CDESITO = SPACES
006479     AND WS-SIST-TAB = 'N'
006480     AND WS-DTINIZIO-VALO >  WB-DTINIZIO(WB-IND)
006481     AND WS-DTFINE-VALO   >= WB-DTFINE(WB-IND)
006482         MOVE 'S'                       TO WS-SIST-TAB
006483* ... CALCOLO NUOVA DATA FINE DEL BUCO IN TABELLA
006484         MOVE WS-DTINIZIO-VALO          TO WS-UTDATA-DATA-1-DB2
006485         PERFORM UTDATA-SOTTR
006486         MOVE WS-UTDATA-DATA-2-DB2      TO WB-DTFINE(WB-IND)
006487     END-IF
006488*
006489* DEROGA CONTIENE INTERAMENTE IL BUCO
006490     IF  C6SP01A-CDESITO = SPACES
006491     AND WS-SIST-TAB = 'N'
006492     AND WS-DTINIZIO-VALO <= WB-DTINIZIO(WB-IND)
006493     AND WS-DTFINE-VALO   >= WB-DTFINE  (WB-IND)
006494         MOVE 'S'                       TO WS-SIST-TAB
006495* ... ELIMINAZIONE BUCO
006496         COMPUTE WS-SC-FROM = WB-IND + 1
006497         PERFORM VARYING WS-SC FROM  WS-SC-FROM BY 1
006498           UNTIL WS-SC > WB-INDM
006499            MOVE WB-DATE(WS-SC)          TO WB-DATE(WS-SC - 1)
006500         END-PERFORM
006501         SUBTRACT 1 FROM WB-INDM
006502* ... ARRETRAMENTO INDICE DI RICERCA
006503         SUBTRACT 1 FROM WB-IND
006504     END-IF.
006505*
006506     MOVE SPACES TO WS-MESSAGGIO
006507     STRING '---> WB-IND >' WB-IND ' ---> WB-INDM >' WB-INDM
006508            DELIMITED BY SIZE INTO WS-MESSAGGIO
006509     PERFORM TRACCIA.
006510*
006511*******************
006512 CALCOLA-LUNGHEZZA.
006513*******************
006514     MOVE LENGTH OF WS-DAO-CDCAMPO
006515                             TO WS-DAO-NRLEN
006516     PERFORM VARYING WS-DAO-NRIND FROM WS-DAO-NRLEN BY -1
006517       UNTIL WS-DAO-NRIND = ZERO
006518          OR WS-DAO-CDCAMPO(WS-DAO-NRIND:1) > SPACES
006519     END-PERFORM
006520     .
006521*****************
006522 UT-REPER-VALCNV.
006523*****************
006524     MOVE '>>> UT-REPER-VALCNV'        TO WS-MESSAGGIO
006525     PERFORM TRACCIA
006526*
006527     PERFORM VARYING WV-IND FROM 1 BY 1
006528*      UNTIL WV-IND > WV-INDM
006529       UNTIL WV-IND > WV-INDDM
006530          OR WS-SI-FINE-RISALITA
006531
006532        IF  WV-DTINIZIO-CVOG(WV-IND) <= WB-DTFINE  (WB-INDM)
006533        AND WV-DTFINE-CVOG  (WV-IND) >= WB-DTINIZIO(1)
006534*          MOVE WV-CDCNV(WV-IND)      TO C6TBVACN-CDCNV
006535           MOVE WV-CDCNV(WV-IND 1)    TO C6TBVACN-CDCNV1
006536           MOVE WV-CDCNV(WV-IND 2)    TO C6TBVACN-CDCNV2
006537           MOVE WV-CDCNV(WV-IND 3)    TO C6TBVACN-CDCNV3
006538           MOVE WV-CDCNV(WV-IND 4)    TO C6TBVACN-CDCNV4
006539           MOVE WV-CDCNV(WV-IND 5)    TO C6TBVACN-CDCNV5
006540           MOVE WV-CDCNV(WV-IND 6)    TO C6TBVACN-CDCNV6
006541           MOVE WV-CDCNV(WV-IND 7)    TO C6TBVACN-CDCNV7
006542           MOVE WV-CDCNV(WV-IND 8)    TO C6TBVACN-CDCNV8
006543           MOVE WV-CDCNV(WV-IND 9)    TO C6TBVACN-CDCNV9
006544           MOVE WV-CDCNV(WV-IND 10)   TO C6TBVACN-CDCNV10
006545           MOVE WS-CDSERINT           TO C6TBVACN-CDSERINT
006546           MOVE WA-IDCDZ              TO C6TBVACN-IDCDZ
006547           MOVE WA-IDCOMP             TO C6TBVACN-IDCOMPON
006548           IF WV-DTINIZIO-CVOG(WV-IND) < WB-DTINIZIO(1)
006549              MOVE WB-DTINIZIO(1)     TO C6TBVACN-DTINIZIO
006550           ELSE
006551              MOVE WV-DTINIZIO-CVOG(WV-IND)
006552                                      TO C6TBVACN-DTINIZIO
006553           END-IF
006554           IF WV-DTFINE-CVOG(WV-IND) > WB-DTFINE(WB-INDM)
006555              MOVE WB-DTFINE(WB-INDM) TO C6TBVACN-DTFINE
006556           ELSE
006557              MOVE WV-DTFINE-CVOG(WV-IND)
006558                                      TO C6TBVACN-DTFINE
006559           END-IF
006560*
006561  EXEC SQL OPEN CD_VALCNV END-EXEC 
006562           IF SQLCODE NOT = ZEROES
006563              MOVE 'OCVALCNV' TO WS-SQLACC
006564              PERFORM ERRORE-SQL
006565           END-IF
006566*
006567           PERFORM UT-FETCH-CD-VALCNV
006568*
006569           PERFORM UNTIL SQLCODE = +100
006570                      OR WS-SI-FINE-RISALITA
006571                      OR C6SP01A-CDESITO > SPACES
006572              IF C6TBVACN-CDVALALF-LEN > ZEROES
006573              MOVE C6TBVACN-CDVALALF-TEXT(1:C6TBVACN-CDVALALF-LEN)
006574                TO WS-CDVALALF-VALO
006575              ELSE
006576                 MOVE SPACES          TO WS-CDVALALF-VALO
006577              END-IF
006578              MOVE C6TBVACN-CDVALNUM  TO WS-CDVALNUM-VALO
006579              IF  C6TBVACN-DTINIZIO < WV-DTINIZIO-CVOG(WV-IND)
006580              AND C6SP01A-CDTPENT NOT = '2'
006581                 MOVE WV-DTINIZIO-CVOG(WV-IND)
006582                                      TO WS-DTINIZIO-VALO
006583              ELSE
006584                 MOVE C6TBVACN-DTINIZIO
006585                                      TO WS-DTINIZIO-VALO
006586              END-IF
006587              IF  C6TBVACN-DTFINE > WV-DTFINE-CVOG(WV-IND)
006588              AND C6SP01A-CDTPENT NOT = '2'
006589                 MOVE WV-DTFINE-CVOG(WV-IND)
006590                                      TO WS-DTFINE-VALO
006591              ELSE
006592                 MOVE C6TBVACN-DTFINE TO WS-DTFINE-VALO
006593              END-IF
006594              MOVE SPACES             TO WS-CDINDICE-VALO
006595              MOVE 'C'                TO WS-CDAPPLIV-VALO
006596              PERFORM UT-CARICA-AREA-APPOGGIO
006597              IF C6SP01A-CDESITO = SPACES
006598                 PERFORM UT-FETCH-CD-VALCNV
006599              END-IF
006600           END-PERFORM
006601*
006602  EXEC SQL CLOSE CD_VALCNV END-EXEC 
006603           IF SQLCODE NOT = ZEROES
006604              MOVE 'CLVALCNV' TO WS-SQLACC
006605              PERFORM ERRORE-SQL
006606           END-IF
006607        END-IF
006608     END-PERFORM
006609*
006610*... SUI VALORI D'ISTITUTO SE ESTRAZIONE PER TIPO CONVENZIONE
006611     IF  C6SP01A-CDESITO = SPACES
006612     AND WS-NO-FINE-RISALITA
006613     AND C6SP01A-CDTPENT = '2'
006614        PERFORM UT-REPER-VALIST
006615     END-IF
006616     .
006617********************
006618 UT-FETCH-CD-VALCNV.
006619********************
006620*
006621  EXEC SQL FETCH CD_VALCNV
006622  INTO :C6TBVACN-DTINIZIO
006623  ,:C6TBVACN-DTFINE
006624  ,:C6TBVACN-CDVALALF
006625  ,:C6TBVACN-CDVALNUM
006626  ,:C6TBPRQL-NRPRIOR
006627  END-EXEC 
006628     IF NOT (SQLCODE = ZEROES OR +100)
006629        MOVE 'FTVALCNV' TO WS-SQLACC
006630        PERFORM ERRORE-SQL
006631     END-IF.
006632*
006633*****************
006634 UT-REPER-VALLST.
006635*****************
006636     IF WA-CDSPREAD = 'S'
006637       PERFORM UT-REPER-VALLST-SPREAD
006638     ELSE
006639       PERFORM UT-REPER-VALLST-NO-SPREAD
006640     END-IF
006641     .
006642***************************
006643 UT-REPER-VALLST-NO-SPREAD.
006644***************************
006645     MOVE '>>> UT-REPER-VALLST-NO-SPREAD'       TO WS-MESSAGGIO
006646     PERFORM TRACCIA
006647*
006648     PERFORM VARYING WL-IND FROM 1 BY 1
006649       UNTIL WL-IND > WL-INDM
006650          OR WS-SI-FINE-RISALITA
006651        IF  WL-DTINIZIO-LCOG(WL-IND) <= WB-DTFINE  (WB-INDM)
006652        AND WL-DTFINE-LCOG  (WL-IND) >= WB-DTINIZIO(1)
006653           MOVE WL-CDCOMB(WL-IND, 1)  TO WL-CDCOMB1
006654           MOVE WL-CDCOMB(WL-IND, 2)  TO WL-CDCOMB2
006655           MOVE WL-CDCOMB(WL-IND, 3)  TO WL-CDCOMB3
006656           MOVE WL-CDCOMB(WL-IND, 4)  TO WL-CDCOMB4
006657           MOVE WL-CDCOMB(WL-IND, 5)  TO WL-CDCOMB5
006658           MOVE WL-CDCOMB(WL-IND, 6)  TO WL-CDCOMB6
006659           MOVE WL-CDCOMB(WL-IND, 7)  TO WL-CDCOMB7
006660           MOVE WL-CDCOMB(WL-IND, 8)  TO WL-CDCOMB8
006661           MOVE WL-CDCOMB(WL-IND, 9)  TO WL-CDCOMB9
006662           MOVE WL-CDCOMB(WL-IND, 10) TO WL-CDCOMB10
006663*
006664           MOVE WS-CDSERINT            TO C6TBPRFM-CDSERINT
006665           MOVE WA-IDCDZ               TO C6TBVACB-IDCDZ
006666           MOVE WA-IDCOMP              TO C6TBVACB-IDCOMPON
006667           IF WL-DTINIZIO-LCOG(WL-IND) < WB-DTINIZIO(1)
006668              MOVE WB-DTINIZIO(1)      TO C6TBVACB-DTINIZIO
006669           ELSE
006670              MOVE WL-DTINIZIO-LCOG(WL-IND)
006671                                       TO C6TBVACB-DTINIZIO
006672           END-IF
006673           IF WL-DTFINE-LCOG(WL-IND) > WB-DTFINE(WB-INDM)
006674              MOVE WB-DTFINE(WB-INDM)  TO C6TBVACB-DTFINE
006675           ELSE
006676              MOVE WL-DTFINE-LCOG(WL-IND)
006677                                       TO C6TBVACB-DTFINE
006678           END-IF
006679  EXEC SQL OPEN CD_VALLST END-EXEC 
006680           IF SQLCODE NOT = ZEROES
006681              MOVE 'OCVALLST' TO WS-SQLACC
006682              PERFORM ERRORE-SQL
006683           END-IF
006684           PERFORM UT-FETCH-CD-VALLST
006685           PERFORM UNTIL SQLCODE = +100
006686                      OR WS-SI-FINE-RISALITA
006687                      OR C6SP01A-CDESITO > SPACES
006688              IF C6TBVACB-CDVALALF-LEN > ZEROES
006689                 MOVE C6TBVACB-CDVALALF-TEXT
006690                     (1:C6TBVACB-CDVALALF-LEN) TO WS-CDVALALF-VALO
006691              ELSE
006692                 MOVE SPACES           TO WS-CDVALALF-VALO
006693              END-IF
006694              MOVE C6TBVACB-CDVALNUM   TO WS-CDVALNUM-VALO
006695              IF C6TBVACB-DTINIZIO < WL-DTINIZIO-LCOG(WL-IND)
006696              AND C6SP01A-CDTPENT NOT = '1'
006697                 MOVE WL-DTINIZIO-LCOG(WL-IND)
006698                                       TO WS-DTINIZIO-VALO
006699              ELSE
006700                 MOVE C6TBVACB-DTINIZIO
006701                                       TO WS-DTINIZIO-VALO
006702              END-IF
006703              IF C6TBVACB-DTFINE > WL-DTFINE-LCOG(WL-IND)
006704              AND C6SP01A-CDTPENT NOT = '1'
006705                 MOVE WL-DTFINE-LCOG(WL-IND)
006706                                       TO WS-DTFINE-VALO
006707              ELSE
006708                 MOVE C6TBVACB-DTFINE  TO WS-DTFINE-VALO
006709              END-IF
006710              MOVE SPACES              TO WS-CDINDICE-VALO
006711              MOVE 'L'                 TO WS-CDAPPLIV-VALO
006712              PERFORM UT-CARICA-AREA-APPOGGIO
006713              IF C6SP01A-CDESITO = SPACES
006714                 PERFORM UT-FETCH-CD-VALLST
006715              END-IF
006716           END-PERFORM
006717  EXEC SQL CLOSE CD_VALLST END-EXEC 
006718           IF SQLCODE NOT = ZEROES
006719              MOVE 'CLVALLST' TO WS-SQLACC
006720              PERFORM ERRORE-SQL
006721           END-IF
006722        END-IF
006723     END-PERFORM
006724*
006725*... SUI VALORI D'ISTITUTO SE ESTRAZIONE PER TIPO LISTINO
006726     IF  C6SP01A-CDESITO = SPACES
006727     AND WS-NO-FINE-RISALITA
006728     AND C6SP01A-CDTPENT = '1'
006729        PERFORM UT-REPER-VALIST
006730     END-IF
006731     .
006732********************
006733 UT-FETCH-CD-VALLST.
006734********************
006735*
006736  EXEC SQL FETCH CD_VALLST
006737  INTO :C6TBVACB-DTINIZIO
006738  ,:C6TBVACB-DTFINE
006739  ,:C6TBVACB-CDVALALF
006740  ,:C6TBVACB-CDVALNUM
006741  ,:C6TBPRFM-NRPRIOR
006742  ,:C6TBPRQL-NRPRIOR
006743  END-EXEC 
006744     IF NOT (SQLCODE = ZEROES OR +100)
006745        MOVE 'FTVALLST' TO WS-SQLACC
006746        PERFORM ERRORE-SQL
006747     END-IF.
006748*
006749************************
006750 UT-REPER-VALLST-SPREAD.
006751************************
006752     MOVE '>>> UT-REPER-VALLST-SPREAD'       TO WS-MESSAGGIO
006753     PERFORM TRACCIA
006754*
006755     PERFORM VARYING WL-IND FROM 1 BY 1
006756       UNTIL WL-IND > WL-INDM
006757          OR WS-SI-FINE-RISALITA
006758        IF  WL-DTINIZIO-LCOG(WL-IND) <= WB-DTFINE  (WB-INDM)
006759        AND WL-DTFINE-LCOG  (WL-IND) >= WB-DTINIZIO(1)
006760           MOVE WL-CDCOMB(WL-IND, 1)  TO WL-CDCOMB1
006761           MOVE WL-CDCOMB(WL-IND, 2)  TO WL-CDCOMB2
006762           MOVE WL-CDCOMB(WL-IND, 3)  TO WL-CDCOMB3
006763           MOVE WL-CDCOMB(WL-IND, 4)  TO WL-CDCOMB4
006764           MOVE WL-CDCOMB(WL-IND, 5)  TO WL-CDCOMB5
006765           MOVE WL-CDCOMB(WL-IND, 6)  TO WL-CDCOMB6
006766           MOVE WL-CDCOMB(WL-IND, 7)  TO WL-CDCOMB7
006767           MOVE WL-CDCOMB(WL-IND, 8)  TO WL-CDCOMB8
006768           MOVE WL-CDCOMB(WL-IND, 9)  TO WL-CDCOMB9
006769           MOVE WL-CDCOMB(WL-IND, 10) TO WL-CDCOMB10
006770*
006771           MOVE WS-CDSERINT            TO C6TBPRFM-CDSERINT
006772           MOVE WA-IDCDZ               TO C6TBVILS-IDCDZ
006773           MOVE WA-IDCOMP              TO C6TBVILS-IDCOMP
006774           IF WL-DTINIZIO-LCOG(WL-IND) < WB-DTINIZIO(1)
006775              MOVE WB-DTINIZIO(1)      TO C6TBVILS-DTINIZIO
006776           ELSE
006777              MOVE WL-DTINIZIO-LCOG(WL-IND)
006778                                       TO C6TBVILS-DTINIZIO
006779           END-IF
006780           IF WL-DTFINE-LCOG(WL-IND) > WB-DTFINE(WB-INDM)
006781              MOVE WB-DTFINE(WB-INDM)  TO C6TBVILS-DTFINE
006782           ELSE
006783              MOVE WL-DTFINE-LCOG(WL-IND)
006784                                       TO C6TBVILS-DTFINE
006785           END-IF
006786  EXEC SQL OPEN CD_VALLST_SPR END-EXEC 
006787           IF SQLCODE NOT = ZEROES
006788              MOVE 'OCLSTSPR' TO WS-SQLACC
006789              PERFORM ERRORE-SQL
006790           END-IF
006791           PERFORM UT-FETCH-CD-VALLST-SPR
006792           PERFORM UNTIL SQLCODE = +100
006793                      OR WS-SI-FINE-RISALITA
006794                      OR C6SP01A-CDESITO > SPACES
006795              IF C6TBVILS-DSVAL-LEN > ZEROES
006796                 MOVE C6TBVILS-DSVAL-TEXT(1:C6TBVILS-DSVAL-LEN)
006797                                       TO WS-CDVALALF-VALO
006798              ELSE
006799                 MOVE SPACES           TO WS-CDVALALF-VALO
006800              END-IF
006801              MOVE C6TBVILS-NRVAL      TO WS-CDVALNUM-VALO
006802              IF C6TBVILS-DTINIZIO < WL-DTINIZIO-LCOG(WL-IND)
006803              AND C6SP01A-CDTPENT NOT = '1'
006804                 MOVE WL-DTINIZIO-LCOG(WL-IND)
006805                                       TO WS-DTINIZIO-VALO
006806              ELSE
006807                 MOVE C6TBVILS-DTINIZIO
006808                                       TO WS-DTINIZIO-VALO
006809              END-IF
006810              IF C6TBVILS-DTFINE > WL-DTFINE-LCOG(WL-IND)
006811              AND C6SP01A-CDTPENT NOT = '1'
006812                 MOVE WL-DTFINE-LCOG(WL-IND)
006813                                       TO WS-DTFINE-VALO
006814              ELSE
006815                 MOVE C6TBVILS-DTFINE  TO WS-DTFINE-VALO
006816              END-IF
006817              MOVE C6TBVILS-CDINDICE   TO WS-CDINDICE-VALO
006818              MOVE 'L'                 TO WS-CDAPPLIV-VALO
006819              PERFORM UT-CARICA-AREA-APPOGGIO
006820              IF C6SP01A-CDESITO = SPACES
006821                 PERFORM UT-FETCH-CD-VALLST-SPR
006822              END-IF
006823           END-PERFORM
006824  EXEC SQL CLOSE CD_VALLST_SPR END-EXEC 
006825           IF SQLCODE NOT = ZEROES
006826              MOVE 'CLLSTSPR' TO WS-SQLACC
006827              PERFORM ERRORE-SQL
006828           END-IF
006829        END-IF
006830     END-PERFORM
006831*
006832*... SUI VALORI D'ISTITUTO SE ESTRAZIONE PER TIPO LISTINO
006833     IF  C6SP01A-CDESITO = SPACES
006834     AND WS-NO-FINE-RISALITA
006835     AND C6SP01A-CDTPENT = '1'
006836        PERFORM UT-REPER-VALIST
006837     END-IF
006838     .
006839************************
006840 UT-FETCH-CD-VALLST-SPR.
006841************************
006842*
006843  EXEC SQL FETCH CD_VALLST_SPR
006844  INTO :C6TBVILS-CDINDICE
006845  ,:C6TBVILS-DTINIZIO
006846  ,:C6TBVILS-DTFINE
006847  ,:C6TBVILS-DSVAL
006848  ,:C6TBVILS-NRVAL
006849  ,:C6TBPRFM-NRPRIOR
006850  ,:C6TBPRQL-NRPRIOR
006851  END-EXEC 
006852     IF NOT (SQLCODE = ZEROES OR +100)
006853        MOVE 'FTLSTSPR' TO WS-SQLACC
006854        PERFORM ERRORE-SQL
006855     END-IF.
006856*
006857*****************
006858 UT-REPER-VALIST.
006859*****************
006860     IF WA-CDSPREAD = 'S'
006861       PERFORM UT-REPER-VALIST-SPREAD
006862     ELSE
006863       PERFORM UT-REPER-VALIST-NO-SPREAD
006864     END-IF
006865     .
006866***************************
006867 UT-REPER-VALIST-NO-SPREAD.
006868***************************
006869     MOVE '>>> UT-REPER-VALIST-NO-SPREAD'      TO WS-MESSAGGIO
006870     PERFORM TRACCIA
006871*
006872     MOVE WS-CDSERINT              TO C6TBVISN-CDSERINT
006873     MOVE WA-IDCDZ                 TO C6TBVISN-IDCDZ
006874     MOVE WA-IDCOMP                TO C6TBVISN-IDCOMP
006875     MOVE WB-DTINIZIO(1)           TO C6TBVISN-DTINIZIO
006876     MOVE WB-DTFINE(WB-INDM)       TO C6TBVISN-DTFINE
006877*
006878  EXEC SQL OPEN CD_VALIST END-EXEC 
006879     IF SQLCODE NOT = ZEROES
006880        MOVE 'OCVALIST' TO WS-SQLACC
006881        PERFORM ERRORE-SQL
006882     END-IF
006883*
006884     PERFORM UT-FETCH-CD-VALIST
006885*
006886     PERFORM UNTIL SQLCODE = +100
006887                OR WS-SI-FINE-RISALITA
006888                OR C6SP01A-CDESITO > SPACES
006889        IF C6TBVISN-DSVAL-LEN > ZEROES
006890           MOVE C6TBVISN-DSVAL-TEXT(1:C6TBVISN-DSVAL-LEN)
006891             TO WS-CDVALALF-VALO
006892        ELSE
006893           MOVE SPACES             TO WS-CDVALALF-VALO
006894        END-IF
006895        MOVE C6TBVISN-NRVAL        TO WS-CDVALNUM-VALO
006896        MOVE C6TBVISN-DTINIZIO     TO WS-DTINIZIO-VALO
006897        MOVE C6TBVISN-DTFINE       TO WS-DTFINE-VALO
006898        MOVE SPACES                TO WS-CDINDICE-VALO
006899        MOVE 'S'                   TO WS-CDAPPLIV-VALO
006900        PERFORM UT-CARICA-AREA-APPOGGIO
006901        IF C6SP01A-CDESITO = SPACES
006902           PERFORM UT-FETCH-CD-VALIST
006903        END-IF
006904     END-PERFORM
006905*
006906  EXEC SQL CLOSE CD_VALIST END-EXEC 
006907     IF SQLCODE NOT = ZEROES
006908        MOVE 'CLVALIST' TO WS-SQLACC
006909        PERFORM ERRORE-SQL
006910     END-IF
006911     .
006912********************
006913 UT-FETCH-CD-VALIST.
006914********************
006915*
006916  EXEC SQL FETCH CD_VALIST
006917  INTO :C6TBVISN-DTINIZIO
006918  ,:C6TBVISN-DTFINE
006919  ,:C6TBVISN-DSVAL
006920  ,:C6TBVISN-NRVAL
006921  ,:C6TBPRQL-NRPRIOR
006922  END-EXEC 
006923     IF NOT (SQLCODE = ZEROES OR +100)
006924        MOVE 'FTVALIST' TO WS-SQLACC
006925        PERFORM ERRORE-SQL
006926     END-IF.
006927*
006928************************
006929 UT-REPER-VALIST-SPREAD.
006930************************
006931     MOVE '>>> UT-REPER-VALIST-SPREAD'      TO WS-MESSAGGIO
006932     PERFORM TRACCIA
006933*
006934     MOVE WS-CDSERINT              TO C6TBVISS-CDSERINT
006935     MOVE WA-IDCDZ                 TO C6TBVISS-IDCDZ
006936     MOVE WA-IDCOMP                TO C6TBVISS-IDCOMP
006937     MOVE WB-DTINIZIO(1)           TO C6TBVISS-DTINIZIO
006938     MOVE WB-DTFINE(WB-INDM)       TO C6TBVISS-DTFINE
006939*
006940  EXEC SQL OPEN CD_VALIST_SPR END-EXEC 
006941     IF SQLCODE NOT = ZEROES
006942        MOVE 'OCISTSPR' TO WS-SQLACC
006943        PERFORM ERRORE-SQL
006944     END-IF
006945*
006946     PERFORM UT-FETCH-CD-VALIST-SPR
006947*
006948     PERFORM UNTIL SQLCODE = +100
006949                OR WS-SI-FINE-RISALITA
006950                OR C6SP01A-CDESITO > SPACES
006951        IF C6TBVISS-DSVAL-LEN > ZEROES
006952           MOVE C6TBVISS-DSVAL-TEXT(1:C6TBVISS-DSVAL-LEN)
006953             TO WS-CDVALALF-VALO
006954        ELSE
006955           MOVE SPACES             TO WS-CDVALALF-VALO
006956        END-IF
006957        MOVE C6TBVISS-NRVAL        TO WS-CDVALNUM-VALO
006958        MOVE C6TBVISS-DTINIZIO     TO WS-DTINIZIO-VALO
006959        MOVE C6TBVISS-DTFINE       TO WS-DTFINE-VALO
006960        MOVE C6TBVISS-CDINDICE     TO WS-CDINDICE-VALO
006961        MOVE 'S'                   TO WS-CDAPPLIV-VALO
006962        PERFORM UT-CARICA-AREA-APPOGGIO
006963        IF C6SP01A-CDESITO = SPACES
006964           PERFORM UT-FETCH-CD-VALIST-SPR
006965        END-IF
006966     END-PERFORM
006967*
006968  EXEC SQL CLOSE CD_VALIST_SPR END-EXEC 
006969     IF SQLCODE NOT = ZEROES
006970        MOVE 'CLISTSPR' TO WS-SQLACC
006971        PERFORM ERRORE-SQL
006972     END-IF
006973     .
006974************************
006975 UT-FETCH-CD-VALIST-SPR.
006976************************
006977*
006978  EXEC SQL FETCH CD_VALIST_SPR
006979  INTO :C6TBVISS-CDINDICE
006980  ,:C6TBVISS-DTINIZIO
006981  ,:C6TBVISS-DTFINE
006982  ,:C6TBVISS-DSVAL
006983  ,:C6TBVISS-NRVAL
006984  ,:C6TBPRQL-NRPRIOR
006985  END-EXEC 
006986     IF NOT (SQLCODE = ZEROES OR +100)
006987        MOVE 'FTISTSPR' TO WS-SQLACC
006988        PERFORM ERRORE-SQL
006989     END-IF.
006990*
006991***************
006992*CARICA-TABOUT.
006993**************
006994*    MOVE SPACES TO WS-MESSAGGIO
006995*    STRING ">>> CARICA-TABOUT (WP-INDM " WP-INDM ")"
006996*            DELIMITED BY SIZE INTO WS-MESSAGGIO
006997*    PERFORM TRACCIA
006998*
006999*    PERFORM VARYING WP-IND FROM 1 BY 1
007000*      UNTIL WP-IND > WP-INDM
007001*         OR C6SP01A-CDESITO > SPACES
007002*         OR WS-SI-FINE-RIPARTENZA
007003*
007004*       IF WP-IND = 1
007005*       OR WP-CDVALALF(WP-IND) NOT = WP-CDVALALF(WP-IND - 1)
007006*       OR WP-CDVALNUM(WP-IND) NOT = WP-CDVALNUM(WP-IND - 1)
007007*       OR WP-CDAPPLIV(WP-IND) NOT = WP-CDAPPLIV(WP-IND - 1)
007008*       OR WP-CDINDICE(WP-IND) NOT = WP-CDINDICE(WP-IND - 1)
007009*          IF C6SP01A-ELDIMOUT-OUT = WS-IND-MAX
007010*             IF C6SP01A-CDKEYRIP > SPACES
007011*                MOVE "E098" TO C6SP01A-CDESITO
007012*                MOVE "SFONDAMENTO TAB.OUTPUT"
007013*                               TO C6SP01A-DSERTEXT-BREVE
007014*                MOVE "SFONDAMENTO TAB.OUTPUT"
007015*                               TO C6SP01A-DSERTEXT-MEDIO
007016*             ELSE
007017*                SET WS-SI-FINE-RIPARTENZA TO TRUE
007018*             END-IF
007019*          ELSE
007020*             IF C6SP01A-CDKEYRIP <= SPACES
007021*             OR (C6SP01A-CDKEYRIP > SPACES
007022*             AND WS-IND-RIP >= WS-IND-MAX)
007023*                ADD 1                 TO  C6SP01A-ELDIMOUT-OUT
007024*                MOVE WA-DSCDZBR
007025*                  TO C6SP01A-DSCDZBR-OUT (C6SP01A-ELDIMOUT-OUT)
007026*                MOVE WA-DSLEGBR
007027*                  TO C6SP01A-DSLEGBR-OUT (C6SP01A-ELDIMOUT-OUT)
007028*                MOVE WA-NRPRELEM
007029*                  TO C6SP01A-NRPRELEM-OUT (C6SP01A-ELDIMOUT-OUT)
007030*                MOVE WA-NRPRREGO
007031**                 TO C6SP01A-NRPREGOL-OUT (C6SP01A-ELDIMOUT-OUT)
007032*                MOVE WA-CDNATCDZ
007033**                 TO C6SP01A-CDNATCDZ-OUT (C6SP01A-ELDIMOUT-OUT)
007034*                IF  WA-CDSPREAD = "S"
007035*                AND C6SP01A-CDUTISPR = "1"
007036*                   MOVE "N"
007037*                  TO C6SP01A-CDFORVAL-OUT (C6SP01A-ELDIMOUT-OUT)
007038*                ELSE
007039*                   MOVE WA-CDTPFORM
007040*                  TO C6SP01A-CDFORVAL-OUT (C6SP01A-ELDIMOUT-OUT)
007041**               END-IF
007042*                MOVE WA-NRDIMENS
007043*                  TO C6SP01A-NMDIMEN-OUT (C6SP01A-ELDIMOUT-OUT)
007044*                MOVE WA-NRDECIM
007045*                  TO C6SP01A-NMDECIMA-OUT (C6SP01A-ELDIMOUT-OUT)
007046*                MOVE WA-NRPRIOR
007047*                  TO C6SP01A-NRPRCOMP-OUT (C6SP01A-ELDIMOUT-OUT)
007048*
007049*                STRING WP-DTINIZIO(WP-IND)(1:4)
007050*                       WP-DTINIZIO(WP-IND)(6:2)
007051*                       WP-DTINIZIO(WP-IND)(9:2)
007052*                       DELIMITED BY SIZE INTO
007053*                       C6SP01A-DTINIVAL-OUT(C6SP01A-ELDIMOUT-OUT)
007054*                IF WP-DTFINE(WP-IND) >= "9999-12-31"
007055*                   MOVE 99999999
007056**                   TO C6SP01A-DTFINVAL-OUT(C6SP01A-ELDIMOUT-OUT)
007057*                ELSE
007058*                   STRING WP-DTFINE(WP-IND)(1:4)
007059*                          WP-DTFINE(WP-IND)(6:2)
007060*                          WP-DTFINE(WP-IND)(9:2)
007061*                          DELIMITED BY SIZE INTO
007062*                       C6SP01A-DTFINVAL-OUT(C6SP01A-ELDIMOUT-OUT)
007063*                END-IF
007064*                MOVE WP-CDVALALF(WP-IND)
007065*                  TO C6SP01A-DSVAL-OUT (C6SP01A-ELDIMOUT-OUT)
007066*                MOVE WP-CDVALNUM(WP-IND)
007067*                  TO C6SP01A-NRVAL-OUT (C6SP01A-ELDIMOUT-OUT)
007068*                MOVE WP-CDINDICE(WP-IND)
007069*                  TO C6SP01A-CDINDICE-OUT (C6SP01A-ELDIMOUT-OUT)
007070*                MOVE WP-CDAPPLIV(WP-IND)
007071*                  TO C6SP01A-CDAPPLIV-OUT (C6SP01A-ELDIMOUT-OUT)
007072*                IF WA-CDSPREAD = "I"
007073*                   IF WI-INDM >= WI-IND-MAX
007074*                      MOVE "E098"       TO C6SP01A-CDESITO
007075*                      MOVE "SFONDAMENTO TAB.APP WI"
007076*                                        TO C6SP01A-DSERTEXT-BREVE
007077*                      MOVE "SFONDAMENTO TAB.APP WI"
007078*                                        TO C6SP01A-DSERTEXT-MEDIO
007079*                   ELSE
007080*                      ADD 1              TO WI-INDM
007081*                      MOVE WP-DTINIZIO(WP-IND)
007082*                        TO WI-DTINIZIO(WI-INDM)
007083*                      MOVE WP-DTFINE (WP-IND)
007084*                        TO WI-DTFINE (WI-INDM)
007085*                      MOVE WP-CDVALALF(WP-IND)
007086*                        TO WI-CDINDICE(WI-INDM)
007087*                   END-IF
007088*                END-IF
007089*             ELSE
007090*                IF C6SP01A-CDKEYRIP > SPACES
007091*                   ADD 1             TO WS-IND-RIP
007092*                END-IF
007093*             END-IF
007094*          END-IF
007095*       ELSE
007096*  COMPATTAMENTO
007097*          IF C6SP01A-ELDIMOUT-OUT > ZEROES
007098*             IF WP-DTFINE(WP-IND) >= "9999-12-31"
007099*                MOVE 99999999
007100*                 TO C6SP01A-DTFINVAL-OUT(C6SP01A-ELDIMOUT-OUT)
007101*             ELSE
007102*                STRING WP-DTFINE(WP-IND)(1:4)
007103*                       WP-DTFINE(WP-IND)(6:2)
007104*                       WP-DTFINE(WP-IND)(9:2)
007105*                       DELIMITED BY SIZE INTO
007106*                    C6SP01A-DTFINVAL-OUT(C6SP01A-ELDIMOUT-OUT)
007107*             END-IF
007108*             IF WA-CDSPREAD = "I"
007109*                MOVE WP-DTFINE (WP-IND) TO WI-DTFINE (WI-INDM)
007110*             END-IF
007111*          END-IF
007112*       END-IF
007113*    END-PERFORM
007114*
007115*    IF WS-SI-FINE-RIPARTENZA
007116*       MOVE "1" TO C6SP01A-CDUTIRIP-OUT
007117*    END-IF
007118*    .
007119***************
007120 CARICA-TABOUT-APP.
007121**************
007122     MOVE SPACES TO WS-MESSAGGIO
007123     STRING '>>> CARICA-TABOUT-APP (WP-INDM ' WP-INDM ')'
007124             DELIMITED BY SIZE INTO WS-MESSAGGIO
007125     PERFORM TRACCIA
007126
007127     PERFORM VARYING WP-IND FROM 1 BY 1
007128       UNTIL WP-IND > WP-INDM
007129*         OR C6SP01A-CDESITO > SPACES
007130*         OR WS-SI-FINE-RIPARTENZA
007131
007132        IF WP-IND = 1
007133        OR WP-CDVALALF(WP-IND) NOT = WP-CDVALALF(WP-IND - 1)
007134        OR WP-CDVALNUM(WP-IND) NOT = WP-CDVALNUM(WP-IND - 1)
007135        OR WP-CDAPPLIV(WP-IND) NOT = WP-CDAPPLIV(WP-IND - 1)
007136        OR WP-CDINDICE(WP-IND) NOT = WP-CDINDICE(WP-IND - 1)
007137           IF WS-IND-OUT = WS-IND-OUT-MAX
007138*             IF C6SP01A-CDKEYRIP > SPACES
007139                 MOVE 'E098' TO C6SP01A-CDESITO
007140                 MOVE 'SFONDAMENTO TAB.OUTPUT'
007141                                TO C6SP01A-DSERTEXT-BREVE
007142                 MOVE 'SFONDAMENTO TAB.OUTPUT'
007143                                TO C6SP01A-DSERTEXT-MEDIO
007144*             ELSE
007145*                SET WS-SI-FINE-RIPARTENZA TO TRUE
007146              END-IF
007147*          ELSE
007148*             IF C6SP01A-CDKEYRIP <= SPACES
007149*             OR (C6SP01A-CDKEYRIP > SPACES
007150*             AND WS-IND-RIP >= WS-IND-MAX)
007151                 ADD 1                 TO  WS-IND-OUT
007152                 MOVE WA-DSCDZBR
007153                   TO WS-DSCDZBR-OUT (WS-IND-OUT)
007154                 MOVE WA-DSLEGBR
007155                   TO WS-DSLEGBR-OUT (WS-IND-OUT)
007156                 MOVE WA-NRPRELEM
007157                   TO WS-NRPRELEM-OUT (WS-IND-OUT)
007158                 MOVE WA-NRPRREGO
007159                   TO WS-NRPREGOL-OUT (WS-IND-OUT)
007160                 MOVE WA-CDNATCDZ
007161                   TO WS-CDNATCDZ-OUT (WS-IND-OUT)
007162                 IF  WA-CDSPREAD = 'S'
007163                 AND C6SP01A-CDUTISPR = '1'
007164                    MOVE 'N'
007165                   TO WS-CDFORVAL-OUT (WS-IND-OUT)
007166                 ELSE
007167                    MOVE WA-CDTPFORM
007168                   TO WS-CDFORVAL-OUT (WS-IND-OUT)
007169                 END-IF
007170                 MOVE WA-NRDIMENS
007171                   TO WS-NMDIMEN-OUT (WS-IND-OUT)
007172                 MOVE WA-CDSPREAD
007173                   TO WS-CDSPREAD-OUT (WS-IND-OUT)
007174                 MOVE WA-CDTPCAR
007175                   TO WS-CDTPCAR-OUT (WS-IND-OUT)
007176                 MOVE WA-NRDECIM
007177                   TO WS-NMDECIMA-OUT (WS-IND-OUT)
007178                 MOVE WA-NRPRIOR
007179                   TO WS-NRPRCOMP-OUT (WS-IND-OUT)
007180
007181                 STRING WP-DTINIZIO(WP-IND)(1:4)
007182                        WP-DTINIZIO(WP-IND)(6:2)
007183                        WP-DTINIZIO(WP-IND)(9:2)
007184                        DELIMITED BY SIZE INTO
007185                        WS-DTINIVAL-OUT(WS-IND-OUT)
007186                 IF WP-DTFINE(WP-IND) >= '9999-12-31'
007187                    MOVE 99999999
007188                     TO WS-DTFINVAL-OUT(WS-IND-OUT)
007189*                    DISPLAY "WS-DTFINVAL-OUT(WS-IND-OUT)"
007190*                             WS-DTFINVAL-OUT(WS-IND-OUT)
007191                 ELSE
007192                    STRING WP-DTFINE(WP-IND)(1:4)
007193                           WP-DTFINE(WP-IND)(6:2)
007194                           WP-DTFINE(WP-IND)(9:2)
007195                           DELIMITED BY SIZE INTO
007196                        WS-DTFINVAL-OUT(WS-IND-OUT)
007197*                    DISPLAY "WS-DTFINVAL-OUT(WS-IND-OUT)"
007198*                             WS-DTFINVAL-OUT(WS-IND-OUT)
007199                 END-IF
007200                 MOVE WP-CDVALALF(WP-IND)
007201                   TO WS-DSVAL-OUT (WS-IND-OUT)
007202                 MOVE WP-CDVALNUM(WP-IND)
007203                   TO WS-NRVAL-OUT (WS-IND-OUT)
007204                 MOVE WP-CDINDICE(WP-IND)
007205                   TO WS-CDINDICE-OUT (WS-IND-OUT)
007206                 MOVE WP-CDAPPLIV(WP-IND)
007207                   TO WS-CDAPPLIV-OUT (WS-IND-OUT)
007208                 IF WA-CDSPREAD = 'I'
007209                    IF WI-INDM >= WI-IND-MAX
007210                       MOVE 'E098'       TO C6SP01A-CDESITO
007211                       MOVE 'SFONDAMENTO TAB.APP WI'
007212                                         TO C6SP01A-DSERTEXT-BREVE
007213                       MOVE 'SFONDAMENTO TAB.APP WI'
007214                                         TO C6SP01A-DSERTEXT-MEDIO
007215                    ELSE
007216                       ADD 1              TO WI-INDM
007217                       MOVE WP-DTINIZIO(WP-IND)
007218                         TO WI-DTINIZIO(WI-INDM)
007219                       MOVE WP-DTFINE (WP-IND)
007220                         TO WI-DTFINE (WI-INDM)
007221*                    DISPLAY "WI-DTFINE (WI-INDM)"
007222*                             WI-DTFINE (WI-INDM)
007223                       MOVE WP-CDVALALF(WP-IND)
007224                         TO WI-CDINDICE(WI-INDM)
007225                    END-IF
007226                 END-IF
007227*             ELSE
007228*                IF C6SP01A-CDKEYRIP > SPACES
007229*                   ADD 1             TO WS-IND-RIP
007230*                END-IF
007231*             END-IF
007232*          END-IF
007233        ELSE
007234*  COMPATTAMENTO
007235           IF WS-IND-OUT > ZEROES
007236              IF WP-DTFINE(WP-IND) >= '9999-12-31'
007237                 MOVE 99999999
007238                  TO WS-DTFINVAL-OUT(WS-IND-OUT)
007239*                    DISPLAY "WS-DTFINVAL-OUT(WS-IND-OUT)"
007240*                             WS-DTFINVAL-OUT(WS-IND-OUT)
007241              ELSE
007242                 STRING WP-DTFINE(WP-IND)(1:4)
007243                        WP-DTFINE(WP-IND)(6:2)
007244                        WP-DTFINE(WP-IND)(9:2)
007245                        DELIMITED BY SIZE INTO
007246                     WS-DTFINVAL-OUT(WS-IND-OUT)
007247*                    DISPLAY "WS-DTFINVAL-OUT(WS-IND-OUT)"
007248*                             WS-DTFINVAL-OUT(WS-IND-OUT)
007249              END-IF
007250              IF WA-CDSPREAD = 'I'
007251                 MOVE WP-DTFINE (WP-IND) TO WI-DTFINE (WI-INDM)
007252*                    DISPLAY "WI-DTFINE (WI-INDM)"
007253*                             WI-DTFINE (WI-INDM)
007254              END-IF
007255           END-IF
007256        END-IF
007257     END-PERFORM
007258*
007259*    IF WS-SI-FINE-RIPARTENZA
007260*       MOVE "1" TO C6SP01A-CDUTIRIP-OUT
007261*    END-IF
007262     .
007263****************************
007264 UT-REPER-REGOLATE-PUNTUALE.
007265****************************
007266     MOVE '*** UT-REPER-REGOLATE-PUNTUALE' TO WS-MESSAGGIO
007267     PERFORM TRACCIA
007268*
007269     MOVE WA-IDCDZ                 TO C6TBVINC-IDCDZ
007270                                      C6TBRELN-IDCDZREG
007271     MOVE WA-IDCOMP                TO C6TBVINC-IDCOMP
007272     IF WS-CDVALALF-VALO > SPACES
007273        MOVE WS-CDVALALF-VALO      TO WS-DAO-CDCAMPO
007274        PERFORM CALCOLA-LUNGHEZZA
007275        MOVE WS-DAO-NRIND          TO C6TBVINC-DSVALDA-LEN
007276        MOVE WS-DAO-CDCAMPO        TO C6TBVINC-DSVALDA-TEXT
007277     ELSE
007278        MOVE ZEROES                TO C6TBVINC-DSVALDA-LEN
007279        MOVE SPACES                TO C6TBVINC-DSVALDA-TEXT
007280     END-IF
007281     MOVE WS-DTINIZIO-DB2          TO WA-DTINIZIO
007282     MOVE WS-DTFINE-DB2            TO WA-DTFINE
007283*
007284  EXEC SQL OPEN CD_REGOLATE END-EXEC 
007285     IF SQLCODE NOT = ZEROES
007286        MOVE 'OCREGOLA' TO WS-SQLACC
007287        PERFORM ERRORE-SQL
007288     END-IF
007289*
007290     PERFORM UT-FETCH-CD-REGOLATE
007291     PERFORM UNTIL SQLCODE = +100
007292                OR C6SP01A-CDESITO > SPACES
007293        MOVE WC-NRPRELEM(WC-IND) TO WA-NRPRELEM
007294        MOVE C6TBRELN-NRPRIOR    TO WA-NRPRREGO
007295        MOVE C6TBCDZI-IDCDZ      TO WA-IDCDZ
007296        IF C6TBCDZI-DSCDZBR-LEN > ZEROES
007297           MOVE C6TBCDZI-DSCDZBR-TEXT(1:C6TBCDZI-DSCDZBR-LEN)
007298                                 TO WA-DSCDZBR
007299        ELSE
007300           MOVE SPACES           TO WA-DSCDZBR
007301        END-IF
007302        MOVE C6TBCZCO-NRPRIOR    TO WA-NRPRIOR
007303        MOVE C6TBCZCO-IDCOMP     TO WA-IDCOMP
007304        IF C6TBCZCO-DSLEGBR-LEN > ZEROES
007305           MOVE C6TBCZCO-DSLEGBR-TEXT(1:C6TBCZCO-DSLEGBR-LEN)
007306                                 TO WA-DSLEGBR
007307        ELSE
007308           MOVE SPACES           TO WA-DSLEGBR
007309        END-IF
007310        MOVE C6TBCDZI-CDNATCDZ   TO WA-CDNATCDZ
007311        MOVE C6TBCOMP-CDTPFORM   TO WA-CDTPFORM
007312        MOVE C6TBCOMP-NRDECIM    TO WA-NRDECIM
007313        MOVE C6TBCOMP-NRDIMENS   TO WA-NRDIMENS
007314        MOVE C6TBCZCO-CDSPREAD   TO WA-CDSPREAD
007315        MOVE C6TBCZCO-CDCALCSPR  TO WA-CDCALCSPR
007316        MOVE C6TBCZCO-CDESTREM   TO WA-CDESTREM
007317        MOVE C6TBCZCO-SNSUPSTD   TO WA-SNSUPSTD
007318*       TEMP. ELIM. DEL TRATTAMENTO DI CAP&FLOOR
007319*       MOVE "N"                 TO WA-CDTPCAR
007320*       RIPRISTINO  DEL TRATTAMENTO DI CAP&FLOOR
007321        MOVE C6TBCDZI-CDTPCAR    TO WA-CDTPCAR
007322        PERFORM UT-REPER-VALORI
007323        IF C6SP01A-CDESITO = SPACES
007324           PERFORM CARICA-TABOUT-APP
007325        END-IF
007326        IF C6SP01A-CDESITO = SPACES
007327           PERFORM UT-FETCH-CD-REGOLATE
007328        END-IF
007329     END-PERFORM
007330*
007331  EXEC SQL CLOSE CD_REGOLATE END-EXEC 
007332     IF SQLCODE NOT = ZEROES
007333        MOVE 'CLREGOLA' TO WS-SQLACC
007334        PERFORM ERRORE-SQL
007335     END-IF
007336     .
007337**********************
007338 UT-FETCH-CD-REGOLATE.
007339**********************
007340*
007341  EXEC SQL FETCH CD_REGOLATE
007342  INTO :C6TBRELN-NRPRIOR
007343  ,:C6TBCDZI-IDCDZ
007344  ,:C6TBCDZI-DSCDZBR
007345  ,:C6TBCZCO-NRPRIOR
007346  ,:C6TBCZCO-IDCOMP
007347  ,:C6TBCZCO-DSLEGBR
007348  ,:C6TBCDZI-CDNATCDZ
007349  ,:C6TBCOMP-CDTPFORM
007350  ,:C6TBCOMP-NRDECIM
007351  ,:C6TBCOMP-NRDIMENS
007352  ,:C6TBCZCO-CDSPREAD
007353  ,:C6TBCZCO-CDCALCSPR
007354  ,:C6TBCZCO-CDESTREM
007355  ,:C6TBCZCO-SNSUPSTD
007356  ,:C6TBCDZI-CDTPCAR
007357  END-EXEC 
007358     IF NOT (SQLCODE = ZEROES OR +100)
007359        MOVE 'FTREGOLA' TO WS-SQLACC
007360        PERFORM ERRORE-SQL
007361     END-IF.
007362*
007363***************************
007364*UT-REPER-REGOLATE-STORICO.
007365***************************
007366*    MOVE "*** UT-REPER-REGOLATE-STORICO" TO WS-MESSAGGIO
007367*    PERFORM TRACCIA
007368*
007369*    MOVE ZEROES                   TO WO-INDM
007370*
007371*    MOVE SPACES TO WS-MESSAGGIO
007372*    STRING "... COMPATTAMENTO WP REGOLA (TOT.VAL. " WP-INDM ")"
007373*            DELIMITED BY SIZE INTO WS-MESSAGGIO
007374*    PERFORM TRACCIA
007375*
007376* CICLO DI CARICO WO A PARTIRE DA WP CON COMPATTAMENTO
007377*    PERFORM VARYING WP-IND FROM 1 BY 1
007378*      UNTIL WP-IND > WP-INDM
007379*       IF WP-IND = 1
007380*          MOVE "... WP-IND = 1 -> SCRIVO" TO WS-MESSAGGIO
007381*          PERFORM TRACCIA
007382*       ELSE
007383*          MOVE SPACES TO WS-MESSAGGIO
007384*          STRING "... VALALF NEW " WP-CDVALALF(WP-IND) " OLD "
007385*                                   WP-CDVALALF(WP-IND - 1)
007386*            DELIMITED BY SIZE INTO WS-MESSAGGIO
007387*          PERFORM TRACCIA
007388*          MOVE SPACES TO WS-MESSAGGIO
007389*          STRING "... VALNUM NEW " WP-CDVALNUM(WP-IND) " OLD "
007390*                                   WP-CDVALNUM(WP-IND - 1)
007391*            DELIMITED BY SIZE INTO WS-MESSAGGIO
007392*          PERFORM TRACCIA
007393*       END-IF
007394*       IF WP-IND = 1
007395*       OR WP-CDVALALF(WP-IND) NOT = WP-CDVALALF(WP-IND - 1)
007396*       OR WP-CDVALNUM(WP-IND) NOT = WP-CDVALNUM(WP-IND - 1)
007397*       OR WP-CDAPPLIV(WP-IND) NOT = WP-CDAPPLIV(WP-IND - 1)
007398*          ADD 1                   TO WO-INDM
007399*          MOVE WP-VALO(WP-IND)    TO WO-VALO(WO-INDM)
007400*       ELSE
007401* COMPATTAMENTO
007402*          MOVE WP-DTFINE(WP-IND)  TO WO-DTFINE(WO-INDM)
007403*       END-IF
007404*    END-PERFORM
007405*    MOVE SPACES TO WS-MESSAGGIO
007406*    STRING "---> WO-INDM : " WO-INDM
007407*            DELIMITED BY SIZE INTO WS-MESSAGGIO
007408*    PERFORM TRACCIA
007409*
007410*    PERFORM VARYING WO-IND FROM 1 BY 1
007411*      UNTIL WO-IND > WO-INDM
007412*         OR WS-SI-FINE-RIPARTENZA
007413*         OR C6SP01A-CDESITO > SPACES
007414* SCRIVO IL RECORD DELLA REGOLA
007415*       IF C6SP01A-ELDIMOUT-OUT = WS-IND-MAX
007416*          IF C6SP01A-CDKEYRIP > SPACES
007417*             MOVE "E098"    TO C6SP01A-CDESITO
007418*             MOVE "SFONDAMENTO TAB.OUTPUT"
007419*                            TO C6SP01A-DSERTEXT-BREVE
007420*             MOVE "SFONDAMENTO TAB.OUTPUT"
007421*                            TO C6SP01A-DSERTEXT-MEDIO
007422*          ELSE
007423*             SET WS-SI-FINE-RIPARTENZA TO TRUE
007424*          END-IF
007425*       ELSE
007426*          IF  C6SP01A-CDKEYRIP <= SPACES
007427*          OR (C6SP01A-CDKEYRIP > SPACES
007428*          AND WS-IND-RIP >= WS-IND-MAX)
007429*             ADD 1                 TO  C6SP01A-ELDIMOUT-OUT
007430*             MOVE WC-DSCDZBR(WC-IND)
007431*               TO C6SP01A-DSCDZBR-OUT (C6SP01A-ELDIMOUT-OUT)
007432*             MOVE WC-DSLEGBR(WC-IND)
007433*               TO C6SP01A-DSLEGBR-OUT (C6SP01A-ELDIMOUT-OUT)
007434*             MOVE WC-NRPRELEM(WC-IND)
007435*               TO C6SP01A-NRPRELEM-OUT (C6SP01A-ELDIMOUT-OUT)
007436*             MOVE ZEROES
007437*               TO C6SP01A-NRPREGOL-OUT (C6SP01A-ELDIMOUT-OUT)
007438*             MOVE WC-CDNATCDZ(WC-IND)
007439*               TO C6SP01A-CDNATCDZ-OUT (C6SP01A-ELDIMOUT-OUT)
007440*             MOVE WC-CDTPFORM(WC-IND)
007441*               TO C6SP01A-CDFORVAL-OUT (C6SP01A-ELDIMOUT-OUT)
007442*             MOVE WC-NRDIMENS(WC-IND)
007443*               TO C6SP01A-NMDIMEN-OUT (C6SP01A-ELDIMOUT-OUT)
007444*             MOVE WC-NRDECIM(WC-IND)
007445*               TO C6SP01A-NMDECIMA-OUT (C6SP01A-ELDIMOUT-OUT)
007446*             MOVE WC-NRPRCOMP(WC-IND)
007447*               TO C6SP01A-NRPRCOMP-OUT (C6SP01A-ELDIMOUT-OUT)
007448*
007449*             STRING WO-DTINIZIO(WO-IND)(1:4)
007450*                    WO-DTINIZIO(WO-IND)(6:2)
007451*                    WO-DTINIZIO(WO-IND)(9:2)
007452*                    DELIMITED BY SIZE INTO
007453*                    C6SP01A-DTINIVAL-OUT(C6SP01A-ELDIMOUT-OUT)
007454*             IF WO-DTFINE(WO-IND) >= "9999-12-31"
007455*                MOVE 99999999
007456*                 TO C6SP01A-DTFINVAL-OUT(C6SP01A-ELDIMOUT-OUT)
007457*             ELSE
007458*                STRING WO-DTFINE(WO-IND)(1:4)
007459*                       WO-DTFINE(WO-IND)(6:2)
007460*                       WO-DTFINE(WO-IND)(9:2)
007461*                       DELIMITED BY SIZE INTO
007462*                    C6SP01A-DTFINVAL-OUT(C6SP01A-ELDIMOUT-OUT)
007463*             END-IF
007464*             MOVE WO-CDVALALF(WO-IND)
007465*               TO C6SP01A-DSVAL-OUT (C6SP01A-ELDIMOUT-OUT)
007466*             MOVE WO-CDVALNUM(WO-IND)
007467*               TO C6SP01A-NRVAL-OUT (C6SP01A-ELDIMOUT-OUT)
007468*             MOVE WO-CDINDICE(WO-IND)
007469*               TO C6SP01A-CDINDICE-OUT (C6SP01A-ELDIMOUT-OUT)
007470*             MOVE WO-CDAPPLIV(WO-IND)
007471*               TO C6SP01A-CDAPPLIV-OUT (C6SP01A-ELDIMOUT-OUT)
007472*          END-IF
007473*       END-IF
007474* SCRIVO IL RECORD DELLE REGOLATE
007475*       IF  C6SP01A-CDESITO = SPACES
007476*       AND WS-NO-FINE-RIPARTENZA
007477*          MOVE WC-IDCDZ(WC-IND)  TO C6TBVINC-IDCDZ
007478*                                    C6TBRELN-IDCDZREG
007479*          MOVE WC-IDCOMP(WC-IND) TO C6TBVINC-IDCOMP
007480*          MOVE WO-CDVALALF(WO-IND)
007481*                                 TO WS-DAO-CDCAMPO
007482*          PERFORM CALCOLA-LUNGHEZZA
007483*          MOVE WS-DAO-NRIND      TO C6TBVINC-DSVALDA-LEN
007484*          MOVE WS-DAO-CDCAMPO    TO C6TBVINC-DSVALDA-TEXT
007485*          EXEC SQL OPEN CD_REGOLATE END-EXEC
007486*          IF SQLCODE NOT = ZEROES
007487*             MOVE "OCREGOLA" TO WS-SQLACC
007488*             PERFORM ERRORE-SQL
007489*          END-IF
007490*          PERFORM UT-FETCH-CD-REGOLATE
007491*          PERFORM UNTIL SQLCODE = +100
007492*                     OR C6SP01A-CDESITO > SPACES
007493*                     OR WS-SI-FINE-RIPARTENZA
007494*             MOVE WC-NRPRELEM(WC-IND) TO WA-NRPRELEM
007495*             MOVE C6TBRELN-NRPRIOR    TO WA-NRPRREGO
007496*             MOVE C6TBCDZI-IDCDZ      TO WA-IDCDZ
007497*             IF C6TBCDZI-DSCDZBR-LEN > ZEROES
007498*                MOVE C6TBCDZI-DSCDZBR-TEXT
007499*                    (1:C6TBCDZI-DSCDZBR-LEN) TO WA-DSCDZBR
007500*             ELSE
007501*                MOVE SPACES           TO WA-DSCDZBR
007502*             END-IF
007503*             MOVE C6TBCZCO-NRPRIOR    TO WA-NRPRIOR
007504*             MOVE C6TBCZCO-IDCOMP     TO WA-IDCOMP
007505*             IF C6TBCZCO-DSLEGBR-LEN > ZEROES
007506*                MOVE C6TBCZCO-DSLEGBR-TEXT
007507*                    (1:C6TBCZCO-DSLEGBR-LEN) TO WA-DSLEGBR
007508*             ELSE
007509*                MOVE SPACES           TO WA-DSLEGBR
007510*             END-IF
007511*             MOVE C6TBCDZI-CDNATCDZ   TO WA-CDNATCDZ
007512*             MOVE C6TBCOMP-CDTPFORM   TO WA-CDTPFORM
007513*             MOVE C6TBCOMP-NRDECIM    TO WA-NRDECIM
007514*             MOVE C6TBCOMP-NRDIMENS   TO WA-NRDIMENS
007515*             MOVE C6TBCZCO-CDSPREAD   TO WA-CDSPREAD
007516*             MOVE C6TBCZCO-CDCALCSPR  TO WA-CDCALCSPR
007517*             MOVE C6TBCZCO-CDESTREM   TO WA-CDESTREM
007518*             MOVE WO-DTINIZIO(WO-IND) TO WA-DTINIZIO
007519*             MOVE WO-DTFINE  (WO-IND) TO WA-DTFINE
007520*             PERFORM UT-REPER-VALORI
007521*             IF C6SP01A-CDESITO = SPACES
007522*                PERFORM CARICA-TABOUT
007523*             END-IF
007524*             IF  C6SP01A-CDESITO = SPACES
007525*             AND WS-NO-FINE-RIPARTENZA
007526*                PERFORM UT-FETCH-CD-REGOLATE
007527*             END-IF
007528*          END-PERFORM
007529*          EXEC SQL CLOSE CD_REGOLATE END-EXEC
007530*          IF SQLCODE NOT = ZEROES
007531*             MOVE "CLREGOLA" TO WS-SQLACC
007532*             PERFORM ERRORE-SQL
007533*          END-IF
007534*       END-IF
007535*    END-PERFORM
007536     .
007537***************************
007538 UT-REPER-REGOLATE-STORICO.
007539***************************
007540     MOVE '*** UT-REPER-REGOLATE-STORICO' TO WS-MESSAGGIO
007541     PERFORM TRACCIA
007542*
007543     MOVE ZEROES                   TO WO-INDM
007544*
007545     MOVE SPACES TO WS-MESSAGGIO
007546     STRING '... COMPATTAMENTO WP REGOLA (TOT.VAL. ' WP-INDM ')'
007547             DELIMITED BY SIZE INTO WS-MESSAGGIO
007548     PERFORM TRACCIA
007549*
007550* CICLO DI CARICO WO A PARTIRE DA WP CON COMPATTAMENTO
007551     PERFORM VARYING WP-IND FROM 1 BY 1
007552       UNTIL WP-IND > WP-INDM
007553        IF WP-IND = 1
007554           MOVE '... WP-IND = 1 -> SCRIVO' TO WS-MESSAGGIO
007555           PERFORM TRACCIA
007556        ELSE
007557           MOVE SPACES TO WS-MESSAGGIO
007558           STRING '... VALALF NEW ' WP-CDVALALF(WP-IND) ' OLD '
007559                                    WP-CDVALALF(WP-IND - 1)
007560             DELIMITED BY SIZE INTO WS-MESSAGGIO
007561           PERFORM TRACCIA
007562           MOVE SPACES TO WS-MESSAGGIO
007563           STRING '... VALNUM NEW ' WP-CDVALNUM(WP-IND) ' OLD '
007564                                    WP-CDVALNUM(WP-IND - 1)
007565             DELIMITED BY SIZE INTO WS-MESSAGGIO
007566           PERFORM TRACCIA
007567        END-IF
007568        IF WP-IND = 1
007569        OR WP-CDVALALF(WP-IND) NOT = WP-CDVALALF(WP-IND - 1)
007570        OR WP-CDVALNUM(WP-IND) NOT = WP-CDVALNUM(WP-IND - 1)
007571        OR WP-CDAPPLIV(WP-IND) NOT = WP-CDAPPLIV(WP-IND - 1)
007572           ADD 1                   TO WO-INDM
007573           MOVE WP-VALO(WP-IND)    TO WO-VALO(WO-INDM)
007574        ELSE
007575* COMPATTAMENTO
007576           MOVE WP-DTFINE(WP-IND)  TO WO-DTFINE(WO-INDM)
007577        END-IF
007578     END-PERFORM
007579     MOVE SPACES TO WS-MESSAGGIO
007580     STRING '---> WO-INDM : ' WO-INDM
007581             DELIMITED BY SIZE INTO WS-MESSAGGIO
007582     PERFORM TRACCIA
007583*
007584     PERFORM VARYING WO-IND FROM 1 BY 1
007585       UNTIL WO-IND > WO-INDM
007586*         OR WS-SI-FINE-RIPARTENZA
007587*         OR C6SP01A-CDESITO > SPACES
007588* SCRIVO IL RECORD DELLA REGOLA
007589        IF WS-IND-OUT = WS-IND-OUT-MAX
007590*          IF C6SP01A-CDKEYRIP > SPACES
007591              MOVE 'E098'    TO C6SP01A-CDESITO
007592              MOVE 'SFONDAMENTO TAB.OUTPUT'
007593                             TO C6SP01A-DSERTEXT-BREVE
007594              MOVE 'SFONDAMENTO TAB.OUTPUT'
007595                             TO C6SP01A-DSERTEXT-MEDIO
007596*          ELSE
007597*             SET WS-SI-FINE-RIPARTENZA TO TRUE
007598           END-IF
007599*       ELSE
007600*          IF  C6SP01A-CDKEYRIP <= SPACES
007601*          OR (C6SP01A-CDKEYRIP > SPACES
007602*          AND WS-IND-RIP >= WS-IND-MAX)
007603              ADD 1                 TO  WS-IND-OUT
007604              MOVE WC-DSCDZBR(WC-IND)
007605                TO WS-DSCDZBR-OUT (WS-IND-OUT)
007606              MOVE WC-DSLEGBR(WC-IND)
007607                TO WS-DSLEGBR-OUT (WS-IND-OUT)
007608              MOVE WC-NRPRELEM(WC-IND)
007609                TO WS-NRPRELEM-OUT (WS-IND-OUT)
007610              MOVE ZEROES
007611                TO WS-NRPREGOL-OUT (WS-IND-OUT)
007612              MOVE WC-CDNATCDZ(WC-IND)
007613                TO WS-CDNATCDZ-OUT (WS-IND-OUT)
007614              MOVE WC-CDTPFORM(WC-IND)
007615                TO WS-CDFORVAL-OUT (WS-IND-OUT)
007616              MOVE WC-CDSPREAD(WC-IND)
007617                TO WS-CDSPREAD-OUT (WS-IND-OUT)
007618              MOVE WC-CDTPCAR(WC-IND)
007619                TO WS-CDTPCAR-OUT (WS-IND-OUT)
007620              MOVE WC-NRDIMENS(WC-IND)
007621                TO WS-NMDIMEN-OUT (WS-IND-OUT)
007622              MOVE WC-NRDECIM(WC-IND)
007623                TO WS-NMDECIMA-OUT (WS-IND-OUT)
007624              MOVE WC-NRPRCOMP(WC-IND)
007625                TO WS-NRPRCOMP-OUT (WS-IND-OUT)
007626
007627              STRING WO-DTINIZIO(WO-IND)(1:4)
007628                     WO-DTINIZIO(WO-IND)(6:2)
007629                     WO-DTINIZIO(WO-IND)(9:2)
007630                     DELIMITED BY SIZE INTO
007631                     WS-DTINIVAL-OUT(WS-IND-OUT)
007632              IF WO-DTFINE(WO-IND) >= '9999-12-31'
007633                 MOVE 99999999
007634                  TO WS-DTFINVAL-OUT(WS-IND-OUT)
007635              ELSE
007636                 STRING WO-DTFINE(WO-IND)(1:4)
007637                        WO-DTFINE(WO-IND)(6:2)
007638                        WO-DTFINE(WO-IND)(9:2)
007639                        DELIMITED BY SIZE INTO
007640                     WS-DTFINVAL-OUT(WS-IND-OUT)
007641              END-IF
007642              MOVE WO-CDVALALF(WO-IND)
007643                TO WS-DSVAL-OUT (WS-IND-OUT)
007644              MOVE WO-CDVALNUM(WO-IND)
007645                TO WS-NRVAL-OUT (WS-IND-OUT)
007646              MOVE WO-CDINDICE(WO-IND)
007647                TO WS-CDINDICE-OUT (WS-IND-OUT)
007648              MOVE WO-CDAPPLIV(WO-IND)
007649                TO WS-CDAPPLIV-OUT (WS-IND-OUT)
007650*          END-IF
007651*       END-IF
007652* SCRIVO IL RECORD DELLE REGOLATE
007653        IF  C6SP01A-CDESITO = SPACES
007654*       AND WS-NO-FINE-RIPARTENZA
007655           MOVE WC-IDCDZ(WC-IND)  TO C6TBVINC-IDCDZ
007656                                     C6TBRELN-IDCDZREG
007657           MOVE WC-IDCOMP(WC-IND) TO C6TBVINC-IDCOMP
007658           MOVE WO-CDVALALF(WO-IND)
007659                                  TO WS-DAO-CDCAMPO
007660           PERFORM CALCOLA-LUNGHEZZA
007661           MOVE WS-DAO-NRIND      TO C6TBVINC-DSVALDA-LEN
007662           MOVE WS-DAO-CDCAMPO    TO C6TBVINC-DSVALDA-TEXT
007663  EXEC SQL OPEN CD_REGOLATE END-EXEC 
007664           IF SQLCODE NOT = ZEROES
007665              MOVE 'OCREGOLA' TO WS-SQLACC
007666              PERFORM ERRORE-SQL
007667           END-IF
007668           PERFORM UT-FETCH-CD-REGOLATE
007669           PERFORM UNTIL SQLCODE = +100
007670                      OR C6SP01A-CDESITO > SPACES
007671*                     OR WS-SI-FINE-RIPARTENZA
007672              MOVE WC-NRPRELEM(WC-IND) TO WA-NRPRELEM
007673              MOVE C6TBRELN-NRPRIOR    TO WA-NRPRREGO
007674              MOVE C6TBCDZI-IDCDZ      TO WA-IDCDZ
007675              IF C6TBCDZI-DSCDZBR-LEN > ZEROES
007676                 MOVE C6TBCDZI-DSCDZBR-TEXT
007677                     (1:C6TBCDZI-DSCDZBR-LEN) TO WA-DSCDZBR
007678              ELSE
007679                 MOVE SPACES           TO WA-DSCDZBR
007680              END-IF
007681              MOVE C6TBCZCO-NRPRIOR    TO WA-NRPRIOR
007682              MOVE C6TBCZCO-IDCOMP     TO WA-IDCOMP
007683              IF C6TBCZCO-DSLEGBR-LEN > ZEROES
007684                 MOVE C6TBCZCO-DSLEGBR-TEXT
007685                     (1:C6TBCZCO-DSLEGBR-LEN) TO WA-DSLEGBR
007686              ELSE
007687                 MOVE SPACES           TO WA-DSLEGBR
007688              END-IF
007689              MOVE C6TBCDZI-CDNATCDZ   TO WA-CDNATCDZ
007690              MOVE C6TBCOMP-CDTPFORM   TO WA-CDTPFORM
007691              MOVE C6TBCOMP-NRDECIM    TO WA-NRDECIM
007692              MOVE C6TBCOMP-NRDIMENS   TO WA-NRDIMENS
007693              MOVE C6TBCZCO-CDSPREAD   TO WA-CDSPREAD
007694              MOVE C6TBCZCO-CDCALCSPR  TO WA-CDCALCSPR
007695              MOVE C6TBCZCO-CDESTREM   TO WA-CDESTREM
007696              MOVE C6TBCZCO-SNSUPSTD   TO WA-SNSUPSTD
007697*             TEMP. ELIM. DEL TRATTAMENTO DI CAP&FLOOR
007698*             MOVE "N"                 TO WA-CDTPCAR
007699*             RIPRISTINO  DEL TRATTAMENTO DI CAP&FLOOR
007700              MOVE C6TBCDZI-CDTPCAR    TO WA-CDTPCAR
007701              MOVE WO-DTINIZIO(WO-IND) TO WA-DTINIZIO
007702              MOVE WO-DTFINE  (WO-IND) TO WA-DTFINE
007703              PERFORM UT-REPER-VALORI
007704              IF C6SP01A-CDESITO = SPACES
007705                 PERFORM CARICA-TABOUT-APP
007706              END-IF
007707              IF  C6SP01A-CDESITO = SPACES
007708*             AND WS-NO-FINE-RIPARTENZA
007709                 PERFORM UT-FETCH-CD-REGOLATE
007710              END-IF
007711           END-PERFORM
007712  EXEC SQL CLOSE CD_REGOLATE END-EXEC 
007713           IF SQLCODE NOT = ZEROES
007714              MOVE 'CLREGOLA' TO WS-SQLACC
007715              PERFORM ERRORE-SQL
007716           END-IF
007717        END-IF
007718     END-PERFORM
007719     .
007720***************
007721 UTDATA-SOMMA.
007722***************
007723*
007724     MOVE ZEROES                   TO UTDATA-ERRORE
007725     MOVE SPACES                   TO UTDATA-GIORNO-SETT
007726                                      UTDATA-FESTIVO
007727     MOVE 3                        TO UTDATA-FUNZIONE
007728     MOVE 1                        TO UTDATA-GIORNI
007729*
007730     MOVE WS-UTDATA-DATA-1-DB2(1:4)
007731                                   TO UTDATA-SEC-ANNO-1
007732     MOVE WS-UTDATA-DATA-1-DB2(6:2)
007733                                   TO UTDATA-MESE-1
007734     MOVE WS-UTDATA-DATA-1-DB2(9:2)
007735                                   TO UTDATA-GIORNO-1
007736*
007737  EXEC CICS
007738  LINK PROGRAM('XSXDAT')
007739  COMMAREA(UTDATA-PARAM)
007740  END-EXEC 
007741*
007742     IF UTDATA-ERRORE NOT = ZERO
007743        MOVE 'E479'                TO C6SP01A-CDESITO
007744        STRING 'ERR.CALCOLO DATA SUCCESSIVA (' UTDATA-ERRORE ')'
007745               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
007746        STRING 'ERR.CALCOLO DATA SUCCESSIVA (' UTDATA-ERRORE ')'
007747               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
007748        GOBACK
007749     END-IF.
007750*
007751     STRING UTDATA-SEC-ANNO-2 '-' UTDATA-MESE-2 '-'
007752            UTDATA-GIORNO-2 DELIMITED BY SIZE
007753       INTO WS-UTDATA-DATA-2-DB2.
007754*
007755***************
007756 UTDATA-SOTTR.
007757***************
007758*
007759     MOVE ZEROES                   TO UTDATA-ERRORE
007760     MOVE SPACES                   TO UTDATA-GIORNO-SETT
007761                                      UTDATA-FESTIVO
007762     MOVE 4                        TO UTDATA-FUNZIONE
007763     MOVE 1                        TO UTDATA-GIORNI
007764*
007765     MOVE WS-UTDATA-DATA-1-DB2(1:4)
007766                                   TO UTDATA-SEC-ANNO-1
007767     MOVE WS-UTDATA-DATA-1-DB2(6:2)
007768                                   TO UTDATA-MESE-1
007769     MOVE WS-UTDATA-DATA-1-DB2(9:2)
007770                                   TO UTDATA-GIORNO-1
007771*
007772  EXEC CICS
007773  LINK PROGRAM('XSXDAT')
007774  COMMAREA(UTDATA-PARAM)
007775  END-EXEC 
007776*
007777     IF UTDATA-ERRORE NOT = ZERO
007778        MOVE 'E480'                TO C6SP01A-CDESITO
007779        STRING 'ERR.CALCOLO DATA PRECEDENTE (' UTDATA-ERRORE ')'
007780               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-BREVE
007781        STRING 'ERR.CALCOLO DATA PRECEDENTE (' UTDATA-ERRORE ')'
007782               DELIMITED BY SIZE INTO C6SP01A-DSERTEXT-MEDIO
007783        GOBACK
007784     END-IF.
007785*
007786     STRING UTDATA-SEC-ANNO-2 '-' UTDATA-MESE-2 '-'
007787            UTDATA-GIORNO-2 DELIMITED BY SIZE
007788       INTO WS-UTDATA-DATA-2-DB2.
007789*
007790*****************
007791 UT-REPER-VALSUB.
007792*****************
007793     MOVE '>>> UT-REPER-VALSUB'        TO WS-MESSAGGIO
007794     PERFORM TRACCIA
007795*
007796     MOVE WS-CDOGGETT              TO C6TBVASG-CDOGGETT
007797     MOVE WS-CDSERINT              TO C6TBVASG-CDSERINT
007798     MOVE C6SP01A-CDENTITA(31:25)  TO C6TBVASG-CDSUBOGG
007799     MOVE WA-IDCDZ                 TO C6TBVASG-IDCDZ
007800     MOVE WA-IDCOMP                TO C6TBVASG-IDCOMPON
007801     MOVE WB-DTINIZIO(1)           TO C6TBVASG-DTINIZIO
007802     MOVE WB-DTFINE(WB-INDM)       TO C6TBVASG-DTFINE
007803*
007804  EXEC SQL OPEN CD_VALSUB END-EXEC 
007805     IF SQLCODE NOT = ZEROES
007806        MOVE 'OCVALSUB' TO WS-SQLACC
007807        PERFORM ERRORE-SQL
007808     END-IF
007809*
007810     PERFORM UT-FETCH-CD-VALSUB
007811*
007812     PERFORM UNTIL SQLCODE = +100
007813                OR WS-SI-FINE-RISALITA
007814                OR C6SP01A-CDESITO > SPACES
007815        IF C6TBVASG-CDVALALF-LEN > ZEROES
007816           MOVE C6TBVASG-CDVALALF-TEXT(1:C6TBVASG-CDVALALF-LEN)
007817             TO WS-CDVALALF-VALO
007818        ELSE
007819           MOVE SPACES             TO WS-CDVALALF-VALO
007820        END-IF
007821        MOVE C6TBVASG-CDVALNUM     TO WS-CDVALNUM-VALO
007822        MOVE C6TBVASG-DTINIZIO     TO WS-DTINIZIO-VALO
007823        MOVE C6TBVASG-DTFINE       TO WS-DTFINE-VALO
007824        MOVE SPACES                TO WS-CDINDICE-VALO
007825        MOVE 'B'                   TO WS-CDAPPLIV-VALO
007826        PERFORM UT-CARICA-AREA-APPOGGIO
007827        IF C6SP01A-CDESITO = SPACES
007828           PERFORM UT-FETCH-CD-VALSUB
007829        END-IF
007830     END-PERFORM
007831*
007832  EXEC SQL CLOSE CD_VALSUB END-EXEC 
007833     IF SQLCODE NOT = ZEROES
007834        MOVE 'CLVALSUB' TO WS-SQLACC
007835        PERFORM ERRORE-SQL
007836     END-IF
007837*
007838* COMPLETO I BUCHI CON LE DEROGHE DI OGGETTO
007839     IF  C6SP01A-CDESITO = SPACES
007840     AND WS-NO-FINE-RISALITA
007841        PERFORM UT-REPER-VALOGG
007842     END-IF
007843*
007844* COMPLETO I BUCHI CON LE DEROGHE DI CONVENZIONE
007845     IF  C6SP01A-CDESITO = SPACES
007846     AND WS-NO-FINE-RISALITA
007847*    AND WV-INDM > ZEROES
007848     AND WV-INDDM > ZEROES
007849        PERFORM UT-REPER-VALCNV
007850     END-IF
007851*
007852* COMPLETO I BUCHI CON LE DEROGHE DI LISTINO
007853     IF  C6SP01A-CDESITO = SPACES
007854     AND WS-NO-FINE-RISALITA
007855     AND WL-INDM > ZEROES
007856        PERFORM UT-REPER-VALLST
007857     END-IF
007858*
007859* COMPLETO I BUCHI CON LE DEROGHE DI ISTITUTO
007860     IF  C6SP01A-CDESITO = SPACES
007861     AND WS-NO-FINE-RISALITA
007862        PERFORM UT-REPER-VALIST
007863     END-IF
007864     .
007865********************
007866 UT-FETCH-CD-VALSUB.
007867********************
007868*
007869  EXEC SQL FETCH CD_VALSUB
007870  INTO :C6TBVASG-DTINIZIO
007871  ,:C6TBVASG-DTFINE
007872  ,:C6TBVASG-CDVALALF
007873  ,:C6TBVASG-CDVALNUM
007874  ,:C6TBPRQL-NRPRIOR
007875  END-EXEC 
007876     IF NOT (SQLCODE = ZEROES OR +100)
007877        MOVE 'FTVALSUB' TO WS-SQLACC
007878        PERFORM ERRORE-SQL
007879     END-IF.
007880*
007881************************
007882 UT-REPER-VALORI-INDICI.
007883************************
007884     MOVE '... UT-REPER-VALORI-INDICI' TO WS-MESSAGGIO
007885     PERFORM TRACCIA
007886*
007887     MOVE ZEROES                       TO WB-INDM
007888*
007889     PERFORM VARYING WI-IND FROM 1 BY 1
007890       UNTIL WI-IND > WI-INDM
007891          OR C6SP01A-CDESITO > SPACES
007892        MOVE WI-CDINDICE(WI-IND)       TO C6TBVAIN-CDINDICE
007893        MOVE WI-DTINIZIO(WI-IND)       TO C6TBVAIN-DTINIZIO
007894        MOVE WI-DTFINE  (WI-IND)       TO C6TBVAIN-DTFINE
007895*
007896  EXEC SQL OPEN CD_VALIND END-EXEC 
007897        IF SQLCODE NOT = ZEROES
007898           MOVE 'OCVALIND'             TO WS-SQLACC
007899           PERFORM ERRORE-SQL
007900        END-IF
007901*
007902        PERFORM UT-FETCH-CD-VALIND
007903        PERFORM UNTIL SQLCODE = +100
007904                   OR C6SP01A-CDESITO > SPACES
007905           IF WB-INDM >= WB-IND-MAX
007906              MOVE 'E098'              TO C6SP01A-CDESITO
007907              MOVE 'SFONDAMENTO TAB.BUCHI WB'
007908                                       TO C6SP01A-DSERTEXT-BREVE
007909              MOVE 'SFONDAMENTO TAB.BUCHI WB'
007910                                       TO C6SP01A-DSERTEXT-MEDIO
007911           ELSE
007912              ADD 1                    TO WB-INDM
007913              MOVE WI-CDINDICE(WI-IND) TO WB-CDINDICE(WB-INDM)
007914              MOVE C6TBINDI-NRDECIM    TO WB-NRDECIM-INDI(WB-INDM)
007915              MOVE C6TBVAIN-NRVAL     TO WB-CDVALNUM-INDI(WB-INDM)
007916              IF C6TBVAIN-DTINIZIO < WI-DTINIZIO(WI-IND)
007917                 MOVE WI-DTINIZIO(WI-IND)
007918                                       TO WB-DTINIZIO(WB-INDM)
007919              ELSE
007920                 MOVE C6TBVAIN-DTINIZIO
007921                                       TO WB-DTINIZIO(WB-INDM)
007922              END-IF
007923              IF C6TBVAIN-DTFINE > WI-DTFINE(WI-IND)
007924                 MOVE WI-DTFINE(WI-IND)
007925                                       TO WB-DTFINE(WB-INDM)
007926              ELSE
007927                 MOVE C6TBVAIN-DTFINE  TO WB-DTFINE(WB-INDM)
007928              END-IF
007929              PERFORM UT-FETCH-CD-VALIND
007930           END-IF
007931        END-PERFORM
007932*
007933  EXEC SQL CLOSE CD_VALIND END-EXEC 
007934        IF SQLCODE NOT = ZEROES
007935           MOVE 'CLVALIND'         TO WS-SQLACC
007936           PERFORM ERRORE-SQL
007937        END-IF
007938     END-PERFORM
007939*
007940     MOVE SPACES TO WS-MESSAGGIO
007941     STRING '---> WB-INDM : ' WB-INDM
007942             DELIMITED BY SIZE INTO WS-MESSAGGIO
007943     PERFORM TRACCIA
007944     .
007945********************
007946 UT-FETCH-CD-VALIND.
007947********************
007948*
007949  EXEC SQL FETCH CD_VALIND
007950  INTO :C6TBINDI-NRDIMENS
007951  ,:C6TBINDI-NRDECIM
007952  ,:C6TBVAIN-DTINIZIO
007953  ,:C6TBVAIN-DTFINE
007954  ,:C6TBVAIN-NRVAL
007955  END-EXEC 
007956     IF NOT (SQLCODE = ZEROES OR +100)
007957        MOVE 'FTVALIND' TO WS-SQLACC
007958        PERFORM ERRORE-SQL
007959     END-IF.
007960*
007961*******************
007962 UT-CALCOLA-FINITO.
007963*******************
007964     MOVE SPACES TO WS-MESSAGGIO
007965     MOVE '    UT-CALCOLA-FINITO' TO WS-MESSAGGIO
007966     PERFORM TRACCIA
007967     MOVE SPACES TO WS-MESSAGGIO
007968     STRING '    - STACCO ' WS-CDVALNUM-VALO ' (' WA-NRDECIM ')'
007969             DELIMITED BY SIZE INTO WS-MESSAGGIO
007970     PERFORM TRACCIA
007971     MOVE SPACES TO WS-MESSAGGIO
007972     STRING '    - INDICE ' WS-CDVALNUM-INDI ' ('
007973             WS-NRDECIM-INDI ')'
007974             DELIMITED BY SIZE INTO WS-MESSAGGIO
007975     PERFORM TRACCIA
007976*
007977* SONO COSTRETTA A SCARTARE LA COMPUTE PER PROBLEMI DI ARROTOND.
007978*    IF WA-CDCALCSPR = "D"
007979*       COMPUTE WS-NRFINITO-VALO ROUNDED =
007980*               WS-CDVALNUM-VALO +
007981*        (WS-CDVALNUM-INDI * (10**(WA-NRDECIM - WS-NRDECIM-INDI)))
007982*    ELSE
007983*       COMPUTE WS-NRFINITO-VALO ROUNDED =
007984*        (WS-CDVALNUM-INDI * (10**(WA-NRDECIM - WS-NRDECIM-INDI)))
007985*    + (((WS-CDVALNUM-INDI * (10**(WA-NRDECIM - WS-NRDECIM-INDI)))
007986*    *   (WS-CDVALNUM-VALO / (10**WA-NRDECIM)))
007987*    /    100)
007988*    END-IF.
007989*
007990     MOVE WS-CDVALNUM-INDI         TO PIC918S
007991     MOVE WS-CDVALNUM-VALO         TO PIC918
007992     MOVE ZEROES                   TO PIC918F
007993*
007994* SPREAD ESPRESSO COME DELTA
007995     IF WA-CDCALCSPR = 'D'
007996        EVALUATE WA-NRDECIM
007997* ... DECIMALI 0
007998            WHEN 0 EVALUATE WS-NRDECIM-INDI
007999                       WHEN 0 COMPUTE PIC918F ROUNDED  =
008000                                              PIC918S  + PIC918
008001                       WHEN 1 COMPUTE PIC918F ROUNDED  =
008002                                              PIC9V1SS + PIC918
008003                       WHEN 2 COMPUTE PIC918F ROUNDED  =
008004                                              PIC9V2SS + PIC918
008005                       WHEN 3 COMPUTE PIC918F ROUNDED  =
008006                                              PIC9V3SS + PIC918
008007                       WHEN 4 COMPUTE PIC918F ROUNDED  =
008008                                              PIC9V4SS + PIC918
008009                       WHEN 5 COMPUTE PIC918F ROUNDED  =
008010                                              PIC9V5SS + PIC918
008011                       WHEN 6 COMPUTE PIC918F ROUNDED  =
008012                                              PIC9V6SS + PIC918
008013                   END-EVALUATE
008014* ... DECIMALI 1
008015            WHEN 1 EVALUATE WS-NRDECIM-INDI
008016                       WHEN 0 COMPUTE PIC9V1FI ROUNDED =
008017                                              PIC918S  + PIC9V1SO
008018                       WHEN 1 COMPUTE PIC9V1FI ROUNDED =
008019                                              PIC9V1SS + PIC9V1SO
008020                       WHEN 2 COMPUTE PIC9V1FI ROUNDED =
008021                                              PIC9V2SS + PIC9V1SO
008022                       WHEN 3 COMPUTE PIC9V1FI ROUNDED =
008023                                              PIC9V3SS + PIC9V1SO
008024                       WHEN 4 COMPUTE PIC9V1FI ROUNDED =
008025                                              PIC9V4SS + PIC9V1SO
008026                       WHEN 5 COMPUTE PIC9V1FI ROUNDED =
008027                                              PIC9V5SS + PIC9V1SO
008028                       WHEN 6 COMPUTE PIC9V1FI ROUNDED =
008029                                              PIC9V6SS + PIC9V1SO
008030                   END-EVALUATE
008031* ... DECIMALI 2
008032            WHEN 2 EVALUATE WS-NRDECIM-INDI
008033                       WHEN 0 COMPUTE PIC9V2FI ROUNDED =
008034                                               PIC918S  + PIC9V2SO
008035                       WHEN 1 COMPUTE PIC9V2FI ROUNDED =
008036                                               PIC9V1SS + PIC9V2SO
008037                       WHEN 2 COMPUTE PIC9V2FI ROUNDED =
008038                                               PIC9V2SS + PIC9V2SO
008039                       WHEN 3 COMPUTE PIC9V2FI ROUNDED =
008040                                               PIC9V3SS + PIC9V2SO
008041                       WHEN 4 COMPUTE PIC9V2FI ROUNDED =
008042                                               PIC9V4SS + PIC9V2SO
008043                       WHEN 5 COMPUTE PIC9V2FI ROUNDED =
008044                                               PIC9V5SS + PIC9V2SO
008045                       WHEN 6 COMPUTE PIC9V2FI ROUNDED =
008046                                               PIC9V6SS + PIC9V2SO
008047                   END-EVALUATE
008048* ... DECIMALI 3
008049            WHEN 3 EVALUATE WS-NRDECIM-INDI
008050                       WHEN 0 COMPUTE PIC9V3FI ROUNDED =
008051                                               PIC918S  + PIC9V3SO
008052                       WHEN 1 COMPUTE PIC9V3FI ROUNDED =
008053                                               PIC9V1SS + PIC9V3SO
008054                       WHEN 2 COMPUTE PIC9V3FI ROUNDED =
008055                                               PIC9V2SS + PIC9V3SO
008056                       WHEN 3 COMPUTE PIC9V3FI ROUNDED =
008057                                               PIC9V3SS + PIC9V3SO
008058                       WHEN 4 COMPUTE PIC9V3FI ROUNDED =
008059                                               PIC9V4SS + PIC9V3SO
008060                       WHEN 5 COMPUTE PIC9V3FI ROUNDED =
008061                                               PIC9V5SS + PIC9V3SO
008062                       WHEN 6 COMPUTE PIC9V3FI ROUNDED =
008063                                               PIC9V6SS + PIC9V3SO
008064                   END-EVALUATE
008065* ... DECIMALI 4
008066            WHEN 4 EVALUATE WS-NRDECIM-INDI
008067                       WHEN 0 COMPUTE PIC9V4FI ROUNDED =
008068                                               PIC918S  + PIC9V4SO
008069                       WHEN 1 COMPUTE PIC9V4FI ROUNDED =
008070                                               PIC9V1SS + PIC9V4SO
008071                       WHEN 2 COMPUTE PIC9V4FI ROUNDED =
008072                                               PIC9V2SS + PIC9V4SO
008073                       WHEN 3 COMPUTE PIC9V4FI ROUNDED =
008074                                               PIC9V3SS + PIC9V4SO
008075                       WHEN 4 COMPUTE PIC9V4FI ROUNDED =
008076                                               PIC9V4SS + PIC9V4SO
008077                       WHEN 5 COMPUTE PIC9V4FI ROUNDED =
008078                                               PIC9V5SS + PIC9V4SO
008079                       WHEN 6 COMPUTE PIC9V4FI ROUNDED =
008080                                               PIC9V6SS + PIC9V4SO
008081                   END-EVALUATE
008082* ... DECIMALI 5
008083            WHEN 5 EVALUATE WS-NRDECIM-INDI
008084                       WHEN 0 COMPUTE PIC9V5FI ROUNDED =
008085                                               PIC918S  + PIC9V5SO
008086                       WHEN 1 COMPUTE PIC9V5FI ROUNDED =
008087                                               PIC9V1SS + PIC9V5SO
008088                       WHEN 2 COMPUTE PIC9V5FI ROUNDED =
008089                                               PIC9V2SS + PIC9V5SO
008090                       WHEN 3 COMPUTE PIC9V5FI ROUNDED =
008091                                               PIC9V3SS + PIC9V5SO
008092                       WHEN 4 COMPUTE PIC9V5FI ROUNDED =
008093                                               PIC9V4SS + PIC9V5SO
008094                       WHEN 5 COMPUTE PIC9V5FI ROUNDED =
008095                                               PIC9V5SS + PIC9V5SO
008096                       WHEN 6 COMPUTE PIC9V5FI ROUNDED =
008097                                               PIC9V6SS + PIC9V5SO
008098                   END-EVALUATE
008099* ... DECIMALI 6
008100            WHEN 6 EVALUATE WS-NRDECIM-INDI
008101                       WHEN 0 COMPUTE PIC9V6FI ROUNDED =
008102                                               PIC918S  + PIC9V6SO
008103                       WHEN 1 COMPUTE PIC9V6FI ROUNDED =
008104                                               PIC9V1SS + PIC9V6SO
008105                       WHEN 2 COMPUTE PIC9V6FI ROUNDED =
008106                                               PIC9V2SS + PIC9V6SO
008107                       WHEN 3 COMPUTE PIC9V6FI ROUNDED =
008108                                               PIC9V3SS + PIC9V6SO
008109                       WHEN 4 COMPUTE PIC9V6FI ROUNDED =
008110                                               PIC9V4SS + PIC9V6SO
008111                       WHEN 5 COMPUTE PIC9V6FI ROUNDED =
008112                                               PIC9V5SS + PIC9V6SO
008113                       WHEN 6 COMPUTE PIC9V6FI ROUNDED =
008114                                               PIC9V6SS + PIC9V6SO
008115                   END-EVALUATE
008116        END-EVALUATE
008117     ELSE
008118* SPREAD ESPRESSO COME PERCENTUALE
008119        EVALUATE WA-NRDECIM
008120* ... DECIMALI 0
008121            WHEN 0 EVALUATE WS-NRDECIM-INDI
008122                       WHEN 0 COMPUTE PIC918F ROUNDED =
008123                                   (  PIC918S +
008124                                   (( PIC918 / 100 )  * PIC918S))
008125                       WHEN 1 COMPUTE PIC918F ROUNDED =
008126                                   (  PIC9V1SS +
008127                                   (( PIC918 / 100 ) *  PIC9V1SS))
008128                       WHEN 2 COMPUTE PIC918F ROUNDED =
008129                                   (  PIC9V2SS +
008130                                   (( PIC918 / 100 ) *  PIC9V2SS))
008131                       WHEN 3 COMPUTE PIC918F  ROUNDED =
008132                                   (  PIC9V3SS +
008133                                   (( PIC918 / 100 ) *  PIC9V3SS))
008134                       WHEN 4 COMPUTE PIC918F  ROUNDED =
008135                                   (  PIC9V4SS +
008136                                   (( PIC918 / 100 ) *  PIC9V4SS))
008137                       WHEN 5 COMPUTE PIC918F  ROUNDED =
008138                                   (  PIC9V5SS +
008139                                   (( PIC918 / 100 ) *  PIC9V5SS))
008140                       WHEN 6 COMPUTE PIC918F  ROUNDED =
008141                                   (  PIC9V6SS +
008142                                   (( PIC918 / 100 ) *  PIC9V6SS))
008143                   END-EVALUATE
008144* ... DECIMALI 1
008145            WHEN 1 EVALUATE WS-NRDECIM-INDI
008146                       WHEN 0 COMPUTE PIC9V1FI ROUNDED =
008147                                  (  PIC918S +
008148                                  (( PIC9V1SO / 100 )  * PIC918S))
008149                       WHEN 1 COMPUTE PIC9V1FI ROUNDED =
008150                                  ( PIC9V1SS +
008151                                 (( PIC9V1SO / 100 ) *  PIC9V1SS))
008152                       WHEN 2 COMPUTE PIC9V1FI ROUNDED =
008153                                 (  PIC9V2SS +
008154                                 (( PIC9V1SO / 100 ) *  PIC9V2SS))
008155                       WHEN 3 COMPUTE PIC9V1FI ROUNDED =
008156                                 (  PIC9V3SS +
008157                                 (( PIC9V1SO / 100 ) *  PIC9V3SS))
008158                       WHEN 4 COMPUTE PIC9V1FI ROUNDED =
008159                                 (  PIC9V4SS +
008160                                 (( PIC9V1SO / 100 ) *  PIC9V4SS))
008161                       WHEN 5 COMPUTE PIC9V1FI ROUNDED =
008162                                 (  PIC9V5SS +
008163                                 (( PIC9V1SO / 100 ) *  PIC9V5SS))
008164                       WHEN 6 COMPUTE PIC9V1FI ROUNDED =
008165                                 (  PIC9V6SS +
008166                                 (( PIC9V1SO / 100 ) *  PIC9V6SS))
008167                   END-EVALUATE
008168* ... DECIMALI 2
008169            WHEN 2 EVALUATE WS-NRDECIM-INDI
008170                       WHEN 0 COMPUTE PIC9V2FI ROUNDED =
008171                                  (  PIC918S +
008172                                  (( PIC9V2SO / 100 )  * PIC918S))
008173                       WHEN 1 COMPUTE PIC9V2FI ROUNDED =
008174                                 (  PIC9V1SS +
008175                                 (( PIC9V2SO / 100 ) *  PIC9V1SS))
008176                       WHEN 2 COMPUTE PIC9V2FI ROUNDED =
008177                                 (  PIC9V2SS +
008178                                 (( PIC9V2SO / 100 ) *  PIC9V2SS))
008179                       WHEN 3 COMPUTE PIC9V2FI ROUNDED =
008180                                 (  PIC9V3SS +
008181                                 (( PIC9V2SO / 100 ) *  PIC9V3SS))
008182                       WHEN 4 COMPUTE PIC9V2FI ROUNDED =
008183                                 (  PIC9V4SS +
008184                                 (( PIC9V2SO / 100 ) *  PIC9V4SS))
008185                       WHEN 5 COMPUTE PIC9V2FI ROUNDED =
008186                                 (  PIC9V5SS +
008187                                 (( PIC9V2SO / 100 ) *  PIC9V5SS))
008188                       WHEN 6 COMPUTE PIC9V2FI ROUNDED =
008189                                 (  PIC9V6SS +
008190                                 (( PIC9V2SO / 100 ) *  PIC9V6SS))
008191                   END-EVALUATE
008192* ... DECIMALI 3
008193            WHEN 3 EVALUATE WS-NRDECIM-INDI
008194                       WHEN 0 COMPUTE PIC9V3FI ROUNDED =
008195                                  (  PIC918S +
008196                                  (( PIC9V3SO / 100 )  * PIC918S))
008197                       WHEN 1 COMPUTE PIC9V3FI ROUNDED =
008198                                 (  PIC9V1SS +
008199                                 (( PIC9V3SO / 100 ) *  PIC9V1SS))
008200                       WHEN 2 COMPUTE PIC9V3FI ROUNDED =
008201                                 (  PIC9V2SS +
008202                                 (( PIC9V3SO / 100 ) *  PIC9V2SS))
008203                       WHEN 3 COMPUTE PIC9V3FI ROUNDED =
008204                                 (  PIC9V3SS +
008205                                 (( PIC9V3SO / 100 ) *  PIC9V3SS))
008206                       WHEN 4 COMPUTE PIC9V3FI ROUNDED =
008207                                 (  PIC9V4SS +
008208                                 (( PIC9V3SO / 100 ) *  PIC9V4SS))
008209                       WHEN 5 COMPUTE PIC9V3FI ROUNDED =
008210                                 (  PIC9V5SS +
008211                                 (( PIC9V3SO / 100 ) *  PIC9V5SS))
008212                       WHEN 6 COMPUTE PIC9V3FI ROUNDED =
008213                                 (  PIC9V6SS +
008214                                 (( PIC9V3SO / 100 ) *  PIC9V6SS))
008215                   END-EVALUATE
008216* ... DECIMALI 4
008217            WHEN 4 EVALUATE WS-NRDECIM-INDI
008218                       WHEN 0 COMPUTE PIC9V4FI ROUNDED =
008219                                  (  PIC918S +
008220                                  (( PIC9V4SO / 100 )  * PIC918S))
008221                       WHEN 1 COMPUTE PIC9V4FI ROUNDED =
008222                                 (  PIC9V1SS +
008223                                 (( PIC9V4SO / 100 ) *  PIC9V1SS))
008224                       WHEN 2 COMPUTE PIC9V4FI ROUNDED =
008225                                 (  PIC9V2SS +
008226                                 (( PIC9V4SO / 100 ) *  PIC9V2SS))
008227                       WHEN 3 COMPUTE PIC9V4FI ROUNDED =
008228                                 (  PIC9V3SS +
008229                                 (( PIC9V4SO / 100 ) *  PIC9V3SS))
008230                       WHEN 4 COMPUTE PIC9V4FI ROUNDED =
008231                                 (  PIC9V4SS +
008232                                 (( PIC9V4SO / 100 ) *  PIC9V4SS))
008233                       WHEN 5 COMPUTE PIC9V4FI ROUNDED =
008234                                 (  PIC9V5SS +
008235                                 (( PIC9V4SO / 100 ) *  PIC9V5SS))
008236                       WHEN 6 COMPUTE PIC9V4FI ROUNDED =
008237                                 (  PIC9V6SS +
008238                                 (( PIC9V4SO / 100 ) *  PIC9V6SS))
008239                   END-EVALUATE
008240* ... DECIMALI 5
008241            WHEN 5 EVALUATE WS-NRDECIM-INDI
008242                       WHEN 0 COMPUTE PIC9V5FI ROUNDED =
008243                                  (  PIC918S +
008244                                  (( PIC9V5SO / 100 )  * PIC918S))
008245                       WHEN 1 COMPUTE PIC9V5FI ROUNDED =
008246                                 (  PIC9V1SS +
008247                                 (( PIC9V5SO / 100 ) *  PIC9V1SS))
008248                       WHEN 2 COMPUTE PIC9V5FI ROUNDED =
008249                                 (  PIC9V2SS +
008250                                 (( PIC9V5SO / 100 ) *  PIC9V2SS))
008251                       WHEN 3 COMPUTE PIC9V5FI ROUNDED =
008252                                 (  PIC9V3SS +
008253                                 (( PIC9V5SO / 100 ) *  PIC9V3SS))
008254                       WHEN 4 COMPUTE PIC9V5FI ROUNDED =
008255                                 (  PIC9V4SS +
008256                                 (( PIC9V5SO / 100 ) *  PIC9V4SS))
008257                       WHEN 5 COMPUTE PIC9V5FI ROUNDED =
008258                                 (  PIC9V5SS +
008259                                 (( PIC9V5SO / 100 ) *  PIC9V5SS))
008260                       WHEN 6 COMPUTE PIC9V5FI ROUNDED =
008261                                 (  PIC9V6SS +
008262                                 (( PIC9V5SO / 100 ) *  PIC9V6SS))
008263                   END-EVALUATE
008264* ... DECIMALI 6
008265            WHEN 6 EVALUATE WS-NRDECIM-INDI
008266                       WHEN 0 COMPUTE PIC9V6FI ROUNDED =
008267                                  (  PIC918S +
008268                                  (( PIC9V6SO / 100 )  * PIC918S))
008269                       WHEN 1 COMPUTE PIC9V6FI ROUNDED =
008270                                 (  PIC9V1SS +
008271                                 (( PIC9V6SO / 100 ) *  PIC9V1SS))
008272                       WHEN 2 COMPUTE PIC9V6FI ROUNDED =
008273                                 (  PIC9V2SS +
008274                                 (( PIC9V6SO / 100 ) *  PIC9V2SS))
008275                       WHEN 3 COMPUTE PIC9V6FI ROUNDED =
008276                                 (  PIC9V3SS +
008277                                 (( PIC9V6SO / 100 ) *  PIC9V3SS))
008278                       WHEN 4 COMPUTE PIC9V6FI ROUNDED =
008279                                 (  PIC9V4SS +
008280                                 (( PIC9V6SO / 100 ) *  PIC9V4SS))
008281                       WHEN 5 COMPUTE PIC9V6FI ROUNDED =
008282                                 (  PIC9V5SS +
008283                                 (( PIC9V6SO / 100 ) *  PIC9V5SS))
008284                       WHEN 6 COMPUTE PIC9V6FI ROUNDED =
008285                                 (  PIC9V6SS +
008286                                 (( PIC9V6SO / 100 ) *  PIC9V6SS))
008287                   END-EVALUATE
008288        END-EVALUATE
008289     END-IF
008290     MOVE PIC918F TO WS-NRFINITO-VALO
008291*
008292     MOVE SPACES TO WS-MESSAGGIO
008293     STRING '----> FINITO ' WS-NRFINITO-VALO
008294             DELIMITED BY SIZE INTO WS-MESSAGGIO
008295     PERFORM TRACCIA.
008296*
008297***********************
008298 UT-VERIF-ALLINEAMENTO.
008299***********************
008300     MOVE '*** UT-VERIF-ALLINEAMENTO' TO WS-MESSAGGIO
008301     PERFORM TRACCIA
008302*
008303     SET WS-NO-ALLINEAMENTO-STD       TO TRUE
008304     SET WS-NO-TROVATO-COMPAD         TO TRUE
008305*
008306     PERFORM VARYING WP-IND FROM 1 BY 1
008307       UNTIL WP-IND > WP-INDM
008308          OR WS-SI-ALLINEAMENTO-STD
008309* SE APPLICATO NON DI ISTITUTO, PREPARAZIONE TAB. PER VERIFICA
008310* ED EV. ALLINEAMENTO A STD
008311        IF NOT (WP-CDAPPLIV(WP-IND) = 'S' OR 'Q')
008312           SET WS-SI-ALLINEAMENTO-STD TO TRUE
008313        END-IF
008314     END-PERFORM
008315*
008316* RICERCA COMPONENTE A SPR - QUALIFICATORE IN CNGR
008317     IF WS-SI-ALLINEAMENTO-STD
008318        MOVE ZEROES                   TO WG-IND-RIF
008319        PERFORM VARYING WG-IND FROM 1 BY 1
008320          UNTIL WG-IND > WG-INDM
008321             OR WG-IND-RIF > ZEROES
008322           IF WG-IDCOMP(WG-IND) = WA-IDCOMP
008323              MOVE WG-IND             TO WG-IND-RIF
008324           END-IF
008325        END-PERFORM
008326        IF WG-IND-RIF = ZEROES
008327* ... CARICO TABELLE CONGRUENZE
008328           PERFORM UT-CARICA-CNGR
008329           IF  C6SP01A-CDESITO = SPACES
008330           AND WS-NO-TROVATO-COMPAD
008331              PERFORM UT-CARICA-VALORI-INDICE
008332           END-IF
008333* ... CARICO TABELLE VALORI DI STANDARD PER ALLINEAMENTO
008334           IF C6SP01A-CDESITO = SPACES
008335              PERFORM UT-CARICA-VAL-ALLSTD
008336           END-IF
008337           IF C6SP01A-CDESITO = SPACES
008338              MOVE WG-INDM            TO WG-IND-RIF
008339           END-IF
008340        END-IF
008341        MOVE SPACES TO WS-MESSAGGIO
008342        STRING '    ---> WG-IND-RIF >' WG-IND-RIF '<'
008343                DELIMITED BY SIZE   INTO WS-MESSAGGIO
008344        PERFORM TRACCIA
008345     END-IF.
008346*
008347* ALLINEAMENTO ALLO STD
008348     IF  C6SP01A-CDESITO = SPACES
008349     AND WS-SI-ALLINEAMENTO-STD
008350     AND WG-IND-RIF > ZEROES
008351        MOVE 1                        TO WP-IND
008352        MOVE WG-IND-DA(WG-IND-RIF)    TO WK-IND
008353        PERFORM UNTIL WP-IND > WP-INDM
008354                   OR C6SP01A-CDESITO > SPACES
008355           IF WP-CDAPPLIV(WP-IND) = 'S' OR 'Q'
008356              ADD 1                   TO WP-IND
008357           ELSE
008358              IF WK-DTFINE(WK-IND) < WP-DTINIZIO(WP-IND)
008359                 ADD 1                TO WK-IND
008360              ELSE
008361* VERIFICA SUPERAMENTO STANDARD
008362                 IF (WA-CDESTREM = 'S'
008363                 AND WA-SNSUPSTD = 'S'
008364                 AND WP-CDVALNUM(WP-IND) > WK-NRVAL(WK-IND))
008365                 OR (WA-CDESTREM = 'I'
008366                 AND WA-SNSUPSTD = 'S'
008367                 AND WP-CDVALNUM(WP-IND) < WK-NRVAL(WK-IND))
008368                    PERFORM UT-ISOLA-RANGE-WP
008369                    IF C6SP01A-CDESITO = SPACES
008370* ABBATTIMENTO RANGE CORRENTE E PASSAGGIO AL PROSSIMO RANGE
008371                       MOVE WK-NRVAL(WK-IND)
008372                                      TO WP-CDVALNUM(WP-IND)
008373                       ADD 1          TO WP-IND
008374                    END-IF
008375                 ELSE
008376                    IF WP-DTFINE(WP-IND) <= WK-DTFINE(WK-IND)
008377                       ADD 1          TO WP-IND
008378                    ELSE
008379                       ADD 1          TO WK-IND
008380                    END-IF
008381                 END-IF
008382              END-IF
008383           END-IF
008384        END-PERFORM
008385     END-IF.
008386*
008387*******************
008388 UT-ISOLA-RANGE-WP.
008389*******************
008390* ISOLA IL RANGE DEL VALORE DA ABBATTERE, CREANDO EVENTUALMENTE
008391* NUOVE SPEZZATURE TRA I VALORI
008392*
008393* N.B.: VISTO CHE I RANGE STD SONO CONTIGUI, LADDOVE HO NECESSITA'
008394*       DI FARE CALCOLI SULLE DATE, POSSO INVECE PRENDERE LA DATA
008395*       FINE DELL'OCCORRENZA STD PRECEDENTE O LA DATA INIZIO
008396*       DELL'OCCORRENZA STD SUCCESSIVA
008397*
008398     IF  WP-DTINIZIO(WP-IND) < WK-DTINIZIO(WK-IND)
008399     AND WP-DTFINE(WP-IND)  >= WK-DTINIZIO(WK-IND)
008400* 1A) CREAZIONE SPAZIO WP PER ISOLARE INTERVALLO ANTE STD
008401        PERFORM UT-CREA-SPAZIO-WP
008402* 2A) CONSOLIDAMENTO RECORD CORRENTE
008403        IF C6SP01A-CDESITO = SPACES
008404           MOVE WK-DTFINE(WK-IND - 1)   TO WP-DTFINE(WP-IND)
008405* 3A) PASSO AL RANGE SUCCESSIVO E SISTEMO LA DATA INIZIO
008406           ADD 1                        TO WP-IND
008407           MOVE WK-DTINIZIO(WK-IND)     TO WP-DTINIZIO(WP-IND)
008408* 4A) CREAZIONE SPAZIO WP PER ISOLARE INTERVALLO POST STD
008409           IF WP-DTFINE(WP-IND) > WK-DTFINE(WK-IND)
008410              PERFORM UT-CREA-SPAZIO-WP
008411              IF C6SP01A-CDESITO = SPACES
008412                 MOVE WK-DTFINE(WK-IND) TO WP-DTFINE(WP-IND)
008413                 MOVE WK-DTINIZIO(WK-IND + 1)
008414                                        TO WP-DTINIZIO(WP-IND + 1)
008415              END-IF
008416           END-IF
008417        END-IF
008418     ELSE
008419        IF  WP-DTINIZIO(WP-IND) < WK-DTFINE(WK-IND)
008420        AND WP-DTFINE(WP-IND)  >= WK-DTFINE(WK-IND)
008421* 1B) CREAZIONE SPAZIO WP PER ISOLARE INTERVALLO POST STD
008422           PERFORM UT-CREA-SPAZIO-WP
008423           IF C6SP01A-CDESITO = SPACES
008424              MOVE WK-DTFINE(WK-IND)    TO WP-DTFINE(WP-IND)
008425* 2B) SISTEMO LA DATA INIZIO DEL PROSSIMO INTERVALLO
008426              MOVE WK-DTINIZIO(WK-IND + 1)
008427                                        TO WP-DTINIZIO(WP-IND + 1)
008428           END-IF
008429        END-IF
008430     END-IF.
008431*
008432*******************
008433 UT-CREA-SPAZIO-WP.
008434*******************
008435*
008436     IF WP-INDM = WP-IND-MAX
008437        MOVE 'E098'             TO C6SP01A-CDESITO
008438        MOVE 'SFONDAMENTO TAB.APP WP'
008439                                TO C6SP01A-DSERTEXT-BREVE
008440        MOVE 'SFONDAMENTO TAB.APP WP'
008441                                TO C6SP01A-DSERTEXT-MEDIO
008442     ELSE
008443        PERFORM VARYING WS-SC FROM WP-INDM BY -1
008444          UNTIL WS-SC < WP-IND
008445           MOVE WP-VALO(WS-SC)  TO WP-VALO(WS-SC + 1)
008446        END-PERFORM
008447        ADD 1                   TO WP-INDM
008448     END-IF.
008449*
008450*******************
008451 UT-CREA-SPAZIO-TAB.
008452*******************
008453*
008454     MOVE '  UT-CREA-SPAZIO-TAB     ' TO WS-MESSAGGIO
008455     PERFORM TRACCIA
008456*
008457     IF W-INDS2M(W-INDX) = W-INDS2-MAX
008458        MOVE 'E098'             TO C6SP01A-CDESITO
008459        MOVE 'SFONDAMENTO TAB.APP SPREAD'
008460                                TO C6SP01A-DSERTEXT-BREVE
008461        MOVE 'SFONDAMENTO TAB.APP SPREAD'
008462                                TO C6SP01A-DSERTEXT-MEDIO
008463     ELSE
008464        PERFORM VARYING WS-SC FROM W-INDS2M(W-INDX) BY -1
008465          UNTIL WS-SC < W-INDY
008466           MOVE W-DECOR-S(W-INDX,WS-SC)
008467             TO W-DECOR-S(W-INDX,WS-SC + 1)
008468        END-PERFORM
008469        ADD 1                   TO W-INDS2M(W-INDX)
008470     END-IF.
008471*
008472****************
008473 UT-CARICA-CNGR.
008474****************
008475*
008476     IF WG-INDM = WG-IND-MAX
008477        MOVE 'E098'                TO C6SP01A-CDESITO
008478        MOVE 'SFONDAMENTO TAB.CONGRUENZE'
008479                                   TO C6SP01A-DSERTEXT-BREVE
008480        MOVE 'SFONDAMENTO TAB.CONGRUENZE'
008481                                   TO C6SP01A-DSERTEXT-MEDIO
008482     ELSE
008483        ADD 1                      TO WG-INDM
008484        MOVE WA-IDCOMP             TO WG-IDCOMP(WG-INDM)
008485        MOVE ZEROES                TO WG-IND-DA(WG-INDM)
008486                                      WG-IND-A (WG-INDM)
008487        MOVE WA-IDCDZ              TO C6TBCZCO-IDCDZ
008488*
008489        MOVE WA-IDCDZ              TO WK-IDCDZ-APPO
008490        MOVE WA-IDCOMP             TO WK-IDCOMP-APPO
008491*
008492* ... VERIFICA EV. PRESENZA DI FINITO COLLEGATO
008493  EXEC SQL
008494  SELECT  CZCO.IDCOMP,
008495  CZCO.IDCDZ
008496  INTO :C6TBCZCO-IDCOMP,
008497  :C6TBCZCO-IDCDZ
008498  FROM  C6TBCZCO CZCO
008499  WHERE  CZCO.IDCOMP =
008500  (SELECT DISTINCT(IDCOMPAD)
008501  FROM C6TBRELN RELN
008502  WHERE EXISTS
008503  (SELECT 1 FROM C6TBRELN R2
008504  WHERE R2.IDCDZ    = :C6TBCZCO-IDCDZ
008505  AND R2.IDCDZREG = RELN.IDCDZREG)
008506  AND  RELN.CDTPRELE = 'E'
008507  AND  RELN.IDCOMPAD > 0
008508  AND  RELN.CDSTATO  = 'A')
008509  AND  CZCO.CDSTATO  = 'A'
008510  END-EXEC 
008511        EVALUATE SQLCODE
008512            WHEN ZEROES
008513                 SET  WS-SI-TROVATO-COMPAD TO TRUE
008514                 MOVE C6TBCZCO-IDCDZ    TO WK-IDCDZ-APPO
008515                 MOVE C6TBCZCO-IDCOMP   TO WK-IDCOMP-APPO
008516            WHEN +100   CONTINUE
008517            WHEN OTHER  MOVE 'SLCOMPAD' TO WS-SQLACC
008518                        PERFORM ERRORE-SQL
008519        END-EVALUATE
008520     END-IF.
008521*
008522*************************
008523 UT-CARICA-VALORI-INDICE.
008524*************************
008525*
008526     MOVE ZEROES                  TO WJ-INDM
008527*
008528     MOVE WI-CDINDICE(1)          TO C6TBVAIN-CDINDICE
008529     MOVE WS-DTINIZIO-DB2         TO C6TBVAIN-DTINIZIO
008530     MOVE WS-DTFINE-DB2           TO C6TBVAIN-DTFINE
008531*
008532  EXEC SQL OPEN CD_VALIND END-EXEC 
008533     IF SQLCODE NOT = ZEROES
008534        MOVE 'OCVALIND' TO WS-SQLACC
008535        PERFORM ERRORE-SQL
008536     END-IF
008537*
008538     PERFORM UT-FETCH-CD-VALIND
008539     PERFORM UNTIL SQLCODE = +100
008540                OR C6SP01A-CDESITO > SPACES
008541        IF WJ-INDM = WJ-IND-MAX
008542           MOVE 'E098'            TO C6SP01A-CDESITO
008543           MOVE 'SFONDAMENTO TAB.VALORI INDICE'
008544                                  TO C6SP01A-DSERTEXT-BREVE
008545           MOVE 'SFONDAMENTO TAB.VALORI INDICE'
008546                                  TO C6SP01A-DSERTEXT-MEDIO
008547        ELSE
008548           ADD 1                  TO WJ-INDM
008549           MOVE C6TBVAIN-DTINIZIO TO WJ-DTINIZIO(WJ-INDM)
008550           MOVE C6TBVAIN-DTFINE   TO WJ-DTFINE  (WJ-INDM)
008551           MOVE C6TBVAIN-NRVAL    TO WJ-NRVAL   (WJ-INDM)
008552           MOVE C6TBINDI-NRDECIM  TO WJ-NRDECIM (WJ-INDM)
008553           PERFORM UT-FETCH-CD-VALIND
008554        END-IF
008555     END-PERFORM
008556*
008557  EXEC SQL CLOSE CD_VALIND END-EXEC 
008558     IF SQLCODE NOT = ZEROES
008559        MOVE 'CLVALIND' TO WS-SQLACC
008560        PERFORM ERRORE-SQL
008561     END-IF.
008562*
008563**********************
008564 UT-CARICA-VAL-ALLSTD.
008565**********************
008566     MOVE '    UT-CARICA-VAL-ALLSTD' TO WS-MESSAGGIO
008567     PERFORM TRACCIA
008568     MOVE SPACES TO WS-MESSAGGIO
008569     STRING '    WG-INDM >' WG-INDM '<'
008570            DELIMITED BY SIZE     INTO WS-MESSAGGIO
008571     PERFORM TRACCIA
008572*
008573     MOVE WK-INDM                 TO WG-IND-DA(WG-INDM)
008574     ADD  1                       TO WG-IND-DA(WG-INDM)
008575     MOVE WG-IND-DA(WG-INDM)      TO WG-IND-A (WG-INDM)
008576*
008577     MOVE SPACES TO WS-MESSAGGIO
008578     STRING '    ... DA  >' WG-IND-DA(WG-INDM) '<'
008579            DELIMITED BY SIZE     INTO WS-MESSAGGIO
008580     PERFORM TRACCIA
008581*
008582     IF WS-SI-TROVATO-COMPAD
008583* NO SPREAD
008584        MOVE WS-CDSERINT          TO C6TBVISN-CDSERINT
008585        MOVE WK-IDCDZ-APPO        TO C6TBVISN-IDCDZ
008586        MOVE WK-IDCOMP-APPO       TO C6TBVISN-IDCOMP
008587        MOVE WS-DTINIZIO-DB2      TO C6TBVISN-DTINIZIO
008588        MOVE WS-DTFINE-DB2        TO C6TBVISN-DTFINE
008589  EXEC SQL OPEN CD_VALIST END-EXEC 
008590        IF SQLCODE NOT = ZEROES
008591           MOVE 'OCVALIST' TO WS-SQLACC
008592           PERFORM ERRORE-SQL
008593        END-IF
008594        PERFORM UT-FETCH-CD-VALIST
008595        PERFORM UNTIL SQLCODE = +100
008596                   OR C6SP01A-CDESITO > SPACES
008597           IF WK-INDM = WK-IND-MAX
008598              MOVE 'E098'          TO C6SP01A-CDESITO
008599              MOVE 'SFONDAMENTO TAB.STD.ISTITUTO'
008600                                   TO C6SP01A-DSERTEXT-BREVE
008601              MOVE 'SFONDAMENTO TAB.STD.ISTITUTO'
008602                                   TO C6SP01A-DSERTEXT-MEDIO
008603           ELSE
008604              ADD 1                TO WK-INDM
008605              MOVE WK-IDCOMP-APPO  TO WK-IDCOMP(WK-INDM)
008606              MOVE C6TBVISN-DTINIZIO
008607                                   TO WK-DTINIZIO(WK-INDM)
008608              MOVE C6TBVISN-DTFINE TO WK-DTFINE  (WK-INDM)
008609              MOVE C6TBVISN-NRVAL  TO WK-NRVAL   (WK-INDM)
008610              PERFORM UT-FETCH-CD-VALIST
008611           END-IF
008612        END-PERFORM
008613  EXEC SQL CLOSE CD_VALIST END-EXEC 
008614        IF SQLCODE NOT = ZEROES
008615           MOVE 'CLVALIST' TO WS-SQLACC
008616           PERFORM ERRORE-SQL
008617        END-IF
008618     ELSE
008619* SI SPREAD
008620        MOVE 1                    TO WJ-IND
008621        MOVE WS-CDSERINT          TO C6TBVISS-CDSERINT
008622        MOVE WK-IDCDZ-APPO        TO C6TBVISS-IDCDZ
008623        MOVE WK-IDCOMP-APPO       TO C6TBVISS-IDCOMP
008624        MOVE WI-CDINDICE(1)       TO C6TBVISS-CDINDICE
008625        MOVE WS-DTINIZIO-DB2      TO C6TBVISS-DTINIZIO
008626        MOVE WS-DTFINE-DB2        TO C6TBVISS-DTFINE
008627  EXEC SQL OPEN CD_VALIS2_SPR END-EXEC 
008628        IF SQLCODE NOT = ZEROES
008629           MOVE 'OCISTSP2' TO WS-SQLACC
008630           PERFORM ERRORE-SQL
008631        END-IF
008632        PERFORM UT-FETCH-CD-VALIS2-SPR
008633        PERFORM UNTIL SQLCODE = +100
008634                   OR C6SP01A-CDESITO > SPACES
008635           IF WJ-DTFINE(WJ-IND) < C6TBVISS-DTINIZIO
008636              ADD 1                  TO WJ-IND
008637           ELSE
008638              PERFORM UT-SCRIVI-WK
008639              IF C6SP01A-CDESITO = SPACES
008640                 IF C6TBVISS-DTFINE <= WJ-DTFINE(WJ-IND)
008641                    PERFORM UT-FETCH-CD-VALIS2-SPR
008642                 ELSE
008643                    ADD 1            TO WJ-IND
008644                 END-IF
008645              END-IF
008646           END-IF
008647        END-PERFORM
008648  EXEC SQL CLOSE CD_VALIS2_SPR END-EXEC 
008649        IF SQLCODE NOT = ZEROES
008650           MOVE 'CLISTSP2' TO WS-SQLACC
008651           PERFORM ERRORE-SQL
008652        END-IF
008653     END-IF.
008654     MOVE WK-INDM                 TO WG-IND-A (WG-INDM).
008655*
008656     MOVE SPACES TO WS-MESSAGGIO
008657     STRING '    ... A   >' WG-IND-A(WG-INDM) '<'
008658            DELIMITED BY SIZE     INTO WS-MESSAGGIO
008659     PERFORM TRACCIA
008660     .
008661**************
008662 UT-SCRIVI-WK.
008663**************
008664*
008665     IF WK-INDM = WK-IND-MAX
008666        MOVE 'E098'                TO C6SP01A-CDESITO
008667        MOVE 'SFONDAMENTO TAB.STD.ISTITUTO'
008668                                   TO C6SP01A-DSERTEXT-BREVE
008669        MOVE 'SFONDAMENTO TAB.STD.ISTITUTO'
008670                                   TO C6SP01A-DSERTEXT-MEDIO
008671     ELSE
008672        ADD 1                      TO WK-INDM
008673        MOVE WK-IDCOMP-APPO        TO WK-IDCOMP(WK-INDM)
008674        IF C6TBVISS-DTINIZIO < WJ-DTINIZIO(WJ-IND)
008675           MOVE WJ-DTINIZIO(WJ-IND)
008676                                   TO WK-DTINIZIO(WK-INDM)
008677        ELSE
008678           MOVE C6TBVISS-DTINIZIO  TO WK-DTINIZIO(WK-INDM)
008679        END-IF
008680        IF C6TBVISS-DTFINE > WJ-DTFINE(WJ-IND)
008681           MOVE WJ-DTFINE(WJ-IND)  TO WK-DTFINE(WK-INDM)
008682        ELSE
008683           MOVE C6TBVISS-DTFINE    TO WK-DTFINE(WK-INDM)
008684        END-IF
008685        MOVE C6TBVISS-NRVAL        TO WS-CDVALNUM-VALO
008686        MOVE WJ-NRVAL(WJ-IND)      TO WS-CDVALNUM-INDI
008687        MOVE WJ-NRDECIM(WJ-IND)    TO WS-NRDECIM-INDI
008688        PERFORM UT-CALCOLA-FINITO
008689        MOVE WS-NRFINITO-VALO      TO WK-NRVAL(WK-INDM)
008690     END-IF
008691     .
008692************************
008693 UT-FETCH-CD-VALIS2-SPR.
008694************************
008695*
008696  EXEC SQL FETCH CD_VALIS2_SPR
008697  INTO :C6TBVISS-DTINIZIO
008698  ,:C6TBVISS-DTFINE
008699  ,:C6TBVISS-NRVAL
008700  ,:C6TBPRQL-NRPRIOR
008701  END-EXEC 
008702     IF NOT (SQLCODE = ZEROES OR +100)
008703        MOVE 'FTISTSP2' TO WS-SQLACC
008704        PERFORM ERRORE-SQL
008705     END-IF.
008706*
008707
008708**************
008709 UT-ELABORA-CAP-FLOOR.
008710**************
008711     MOVE '    UT-ELABORA-CAP-FLOOR ' TO WS-MESSAGGIO
008712     PERFORM TRACCIA
008713*
008714     IF W-INDC > ZEROES
008715
008716*    DISPLAY "W-INDC" W-INDC
008717
008718      PERFORM VARYING W-INDX FROM 1 BY 1
008719       UNTIL W-INDS-DA(W-INDX) NOT > ZEROES
008720         MOVE 1 TO W-INDY
008721         MOVE 1 TO W-INDZ
008722
008723*        DISPLAY "INIZIO CONFRONTO"
008724         PERFORM  UNTIL W-INDY > W-INDS2M(W-INDX)
008725
008726*            DISPLAY "W-DTFINE-C(W-INDZ)" W-DTFINE-C(W-INDZ)
008727*            DISPLAY "W-DTFINE-S"W-DTFINE-S(W-INDX,W-INDY)
008728*            DISPLAY "W-CDVALNUM-S"W-CDVALNUM-S(W-INDX,W-INDY)
008729*            DISPLAY "W-CDVALNUM-C(W-INDZ)"W-CDVALNUM-C(W-INDZ)
008730
008731              IF W-DTFINE-C(W-INDZ) >= W-DTFINE-S(W-INDX,W-INDY)
008732*               DISPLAY "DATA FINE CAP >= "
008733                IF W-CDVALNUM-S(W-INDX,W-INDY) >
008734                   W-CDVALNUM-C(W-INDZ)
008735                   MOVE W-CDVALNUM-C(W-INDZ)
008736                     TO W-CDVALNUM-S(W-INDX,W-INDY)
008737                END-IF
008738*             END-IF
008739
008740*            DISPLAY "W-DTFINE-C(W-INDZ)" W-DTFINE-C(W-INDZ)
008741*            DISPLAY "W-DTFINE-S"W-DTFINE-S(W-INDX,W-INDY)
008742*            DISPLAY "W-CDVALNUM-S"W-CDVALNUM-S(W-INDX,W-INDY)
008743*            DISPLAY "W-CDVALNUM-C(W-INDZ)"W-CDVALNUM-C(W-INDZ)
008744
008745*             IF W-DTFINE-C(W-INDZ) <  W-DTFINE-S(W-INDX,W-INDY)
008746              ELSE
008747*               DISPLAY "DATA FINE CAP MINORE"
008748                PERFORM UT-CREA-SPAZIO-TAB
008749                MOVE W-DTFINE-C(W-INDZ)
008750                  TO W-DTFINE-S(W-INDX,W-INDY)
008751                MOVE W-DTINIZIO-C(W-INDZ + 1)
008752                  TO W-DTINIZIO-S(W-INDX,W-INDY + 1 )
008753                IF W-CDVALNUM-S(W-INDX,W-INDY) >
008754                   W-CDVALNUM-C(W-INDZ)
008755                  MOVE W-CDVALNUM-C(W-INDZ)
008756                    TO W-CDVALNUM-S(W-INDX,W-INDY)
008757                END-IF
008758                ADD  1         TO W-INDZ
008759              END-IF
008760             ADD  1          TO W-INDY
008761
008762*            DISPLAY "W-INDY" W-INDY
008763*            DISPLAY "W-INDZ" W-INDZ
008764
008765         END-PERFORM
008766
008767       END-PERFORM
008768     END-IF
008769
008770*    PERFORM VARYING W-IND-APP FROM 1 BY 1
008771*      UNTIL W-INDS-DA(W-IND-APP) NOT > ZEROES
008772*         DISPLAY "W-INDS-DA(W-IND-APP)"
008773*                  W-INDS-DA(W-IND-APP)
008774*         DISPLAY "W-INDS-A(W-IND-APP)"
008775*                  W-INDS-A(W-IND-APP)
008776*         DISPLAY "W-INDS2M(W-IND-APP)"
008777*                  W-INDS2M(W-IND-APP)
008778*         PERFORM VARYING W-IND-APP1 FROM 1 BY 1
008779*           UNTIL W-DTINIZIO-S(W-IND-APP,W-IND-APP1) NOT > ZEROES
008780*             DISPLAY "W-DTINIZIO-S(W-IND-APP,W-IND-APP1)"
008781*                      W-DTINIZIO-S(W-IND-APP,W-IND-APP1)
008782*             DISPLAY "W-DTFINE-S(W-IND-APP,W-IND-APP1)"
008783*                      W-DTFINE-S(W-IND-APP,W-IND-APP1)
008784*             DISPLAY "W-CDVALNUM-S(W-IND-APP,W-IND-APP1)"
008785*                      W-CDVALNUM-S(W-IND-APP,W-IND-APP1)
008786*         END-PERFORM
008787*    END-PERFORM
008788
008789
008790     IF W-INDF > ZEROES
008791
008792*    DISPLAY "W-INDF" W-INDF
008793
008794      PERFORM VARYING W-INDX FROM 1 BY 1
008795       UNTIL W-INDS-DA(W-INDX) NOT > ZEROES
008796         MOVE 1 TO W-INDY
008797         MOVE 1 TO W-INDZ
008798
008799*        DISPLAY "INIZIO CONFRONTO"
008800         PERFORM  UNTIL W-INDY > W-INDS2M(W-INDX)
008801
008802*            DISPLAY "W-DTFINE-F(W-INDZ)" W-DTFINE-F(W-INDZ)
008803*            DISPLAY "W-DTFINE-S"W-DTFINE-S(W-INDX,W-INDY)
008804*            DISPLAY "W-CDVALNUM-S"W-CDVALNUM-S(W-INDX,W-INDY)
008805*            DISPLAY "W-CDVALNUM-F(W-INDZ)"W-CDVALNUM-F(W-INDZ)
008806
008807              IF W-DTFINE-F(W-INDZ) >= W-DTFINE-S(W-INDX,W-INDY)
008808*               DISPLAY "DATA FINE FLO >= "
008809                IF W-CDVALNUM-S(W-INDX,W-INDY) <
008810                   W-CDVALNUM-F(W-INDZ)
008811                   MOVE W-CDVALNUM-F(W-INDZ)
008812                     TO W-CDVALNUM-S(W-INDX,W-INDY)
008813                END-IF
008814                IF W-DTFINE-F(W-INDZ) = W-DTFINE-S(W-INDX,W-INDY)
008815                   ADD  1         TO W-INDZ
008816                END-IF
008817*             END-IF
008818
008819*            DISPLAY "W-DTFINE-F(W-INDZ)" W-DTFINE-F(W-INDZ)
008820*            DISPLAY "W-DTFINE-S"W-DTFINE-S(W-INDX,W-INDY)
008821*            DISPLAY "W-CDVALNUM-S"W-CDVALNUM-S(W-INDX,W-INDY)
008822*            DISPLAY "W-CDVALNUM-F(W-INDZ)"W-CDVALNUM-F(W-INDZ)
008823
008824*             IF W-DTFINE-F(W-INDZ) <  W-DTFINE-S(W-INDX,W-INDY)
008825              ELSE
008826*               DISPLAY "DATA FINE FLO MINORE"
008827                PERFORM UT-CREA-SPAZIO-TAB
008828                MOVE W-DTFINE-F(W-INDZ)
008829                  TO W-DTFINE-S(W-INDX,W-INDY)
008830                MOVE W-DTINIZIO-F(W-INDZ + 1)
008831                  TO W-DTINIZIO-S(W-INDX,W-INDY + 1 )
008832                IF W-CDVALNUM-S(W-INDX,W-INDY) <
008833                   W-CDVALNUM-F(W-INDZ)
008834                  MOVE W-CDVALNUM-F(W-INDZ)
008835                    TO W-CDVALNUM-S(W-INDX,W-INDY)
008836                END-IF
008837                ADD  1         TO W-INDZ
008838              END-IF
008839             ADD  1          TO W-INDY
008840
008841*            DISPLAY "W-INDY" W-INDY
008842*            DISPLAY "W-INDZ" W-INDZ
008843
008844         END-PERFORM
008845
008846       END-PERFORM
008847     END-IF
008848
008849*    PERFORM VARYING W-IND-APP FROM 1 BY 1
008850*      UNTIL W-INDS-DA(W-IND-APP) NOT > ZEROES
008851*         DISPLAY "W-INDS-DA(W-IND-APP)"
008852*                  W-INDS-DA(W-IND-APP)
008853*         DISPLAY "W-INDS-A(W-IND-APP)"
008854*                  W-INDS-A(W-IND-APP)
008855*         DISPLAY "W-INDS2M(W-IND-APP)"
008856*                  W-INDS2M(W-IND-APP)
008857*         PERFORM VARYING W-IND-APP1 FROM 1 BY 1
008858*           UNTIL W-DTINIZIO-S(W-IND-APP,W-IND-APP1) NOT > ZEROES
008859*             DISPLAY "W-DTINIZIO-S(W-IND-APP,W-IND-APP1)"
008860*                      W-DTINIZIO-S(W-IND-APP,W-IND-APP1)
008861*             DISPLAY "W-DTFINE-S(W-IND-APP,W-IND-APP1)"
008862*                      W-DTFINE-S(W-IND-APP,W-IND-APP1)
008863*             DISPLAY "W-CDVALNUM-S(W-IND-APP,W-IND-APP1)"
008864*                      W-CDVALNUM-S(W-IND-APP,W-IND-APP1)
008865*         END-PERFORM
008866*    END-PERFORM
008867
008868     PERFORM UT-COMPATTA-TAB-SPREAD.
008869     .
008870
008871**************
008872 UT-COMPATTA-TAB-SPREAD.
008873**************
008874     MOVE '  UT-COMPATTA-TAB-SPREAD ' TO WS-MESSAGGIO
008875     PERFORM TRACCIA
008876*
008877     MOVE ZEROES                      TO W-INDS-CONTATORE-TOT
008878     PERFORM VARYING W-INDX FROM 1 BY 1
008879       UNTIL W-INDS-DA(W-INDX) NOT > ZEROES
008880         PERFORM VARYING W-INDY FROM 1 BY 1
008881           UNTIL W-INDY > W-INDS2M(W-INDX)
008882             IF W-INDY > 1
008883*              DISPLAY "W-CDVALNUM-S(W-INDX,W-INDY)"
008884*                       W-CDVALNUM-S(W-INDX,W-INDY)
008885*              DISPLAY "W-CDVALNUM-S(W-INDX,W-INDY - 1)"
008886*                       W-CDVALNUM-S(W-INDX,W-INDY - 1)
008887*              DISPLAY "W-CDVALNUM-S(W-INDX,W-INDY + 1)"
008888*                       W-CDVALNUM-S(W-INDX,W-INDY + 1)
008889*              DISPLAY "W-DTFINE-S(W-INDX,W-INDY)"
008890*                       W-DTFINE-S(W-INDX,W-INDY)
008891*              DISPLAY "W-DTFINE-S(W-INDX,W-INDY - 1)"
008892*                       W-DTFINE-S(W-INDX,W-INDY - 1)
008893*              DISPLAY "W-DTFINE-S(W-INDX,W-INDY + 1)"
008894*                       W-DTFINE-S(W-INDX,W-INDY + 1)
008895*              DISPLAY "W-DTINIZIO-S(W-INDX,W-INDY)"
008896*                       W-DTINIZIO-S(W-INDX,W-INDY)
008897*              DISPLAY "W-DTINIZIO-S(W-INDX,W-INDY - 1)"
008898*                       W-DTINIZIO-S(W-INDX,W-INDY - 1)
008899*              DISPLAY "W-DTINIZIO-S(W-INDX,W-INDY + 1)"
008900*                       W-DTINIZIO-S(W-INDX,W-INDY + 1)
008901               IF W-CDVALNUM-S(W-INDX,W-INDY) =
008902                  W-CDVALNUM-S(W-INDX,W-INDY - 1)
008903                    MOVE W-DTFINE-S(W-INDX,W-INDY)
008904                      TO W-DTFINE-S(W-INDX,W-INDY - 1)
008905                    PERFORM UT-CANC-RECORD-TAB
008906               END-IF
008907             END-IF
008908         END-PERFORM
008909         PERFORM UT-RICALCOLA-TAB-OUT-APP
008910
008911
008912*    PERFORM VARYING W-IND-APP FROM 1 BY 1
008913*      UNTIL W-IND-APP > WS-IND-OUT
008914*         DISPLAY "W-IND-APP" W-IND-APP
008915*         DISPLAY "WS-DSCDZBR-OUT(W-IND-APP)"
008916*                  WS-DSCDZBR-OUT(W-IND-APP)
008917*         DISPLAY "WS-DSLEGBR-OUT(W-IND-APP)"
008918*                  WS-DSLEGBR-OUT(W-IND-APP)
008919*         DISPLAY "WS-DTINIVAL-OUT(W-IND-APP)"
008920*                  WS-DTINIVAL-OUT(W-IND-APP)
008921*         DISPLAY "WS-DTFINVAL-OUT(W-IND-APP)"
008922*                  WS-DTFINVAL-OUT(W-IND-APP)
008923*         DISPLAY "WS-NRVAL-OUT(W-IND-APP)"
008924*                  WS-NRVAL-OUT(W-IND-APP)
008925*         DISPLAY "WS-DSVAL-OUT(W-IND-APP)"
008926*                  WS-DSVAL-OUT(W-IND-APP)
008927*    END-PERFORM
008928
008929         MOVE W-INDS-DA(W-INDX) TO W-INDS-DA-APP
008930         PERFORM VARYING W-INDZ FROM 1 BY 1
008931           UNTIL W-INDZ > W-INDS2M(W-INDX)
008932           MOVE W-DTINIZIO-S(W-INDX,W-INDZ)
008933             TO WS-DTINIVAL-OUT(W-INDS-DA-APP)
008934           MOVE W-DTFINE-S(W-INDX,W-INDZ)
008935             TO WS-DTFINVAL-OUT(W-INDS-DA-APP)
008936           MOVE W-CDVALNUM-S(W-INDX,W-INDZ)
008937             TO WS-NRVAL-OUT(W-INDS-DA-APP)
008938           ADD  1               TO W-INDS-DA-APP
008939         END-PERFORM
008940
008941*    PERFORM VARYING W-IND-APP FROM 1 BY 1
008942*      UNTIL W-IND-APP > WS-IND-OUT
008943*         DISPLAY "W-IND-APP" W-IND-APP
008944*         DISPLAY "WS-DSCDZBR-OUT(W-IND-APP)"
008945*                  WS-DSCDZBR-OUT(W-IND-APP)
008946*         DISPLAY "WS-DSLEGBR-OUT(W-IND-APP)"
008947*                  WS-DSLEGBR-OUT(W-IND-APP)
008948*         DISPLAY "WS-DTINIVAL-OUT(W-IND-APP)"
008949*                  WS-DTINIVAL-OUT(W-IND-APP)
008950*         DISPLAY "WS-DTFINVAL-OUT(W-IND-APP)"
008951*                  WS-DTFINVAL-OUT(W-IND-APP)
008952*         DISPLAY "WS-NRVAL-OUT(W-IND-APP)"
008953*                  WS-NRVAL-OUT(W-IND-APP)
008954*         DISPLAY "WS-DSVAL-OUT(W-IND-APP)"
008955*                  WS-DSVAL-OUT(W-IND-APP)
008956*    END-PERFORM
008957
008958     END-PERFORM.
008959
008960
008961*******************
008962 UT-CANC-RECORD-TAB.
008963*******************
008964     MOVE '  UT-CANC-RECORD-TAB     ' TO WS-MESSAGGIO
008965     PERFORM TRACCIA
008966*
008967*
008968*       DISPLAY "W-INDS2M(W-INDX)"  W-INDS2M(W-INDX)
008969*       DISPLAY "W-INDY"            W-INDY
008970*
008971        PERFORM VARYING WS-SC FROM W-INDS2M(W-INDX) BY -1
008972          UNTIL WS-SC <= W-INDY
008973*          DISPLAY "WS-SC" WS-SC
008974*          DISPLAY "W-INDS2M(W-INDX)"  W-INDS2M(W-INDX)
008975*          DISPLAY "W-DECOR-S"W-DECOR-S(W-INDX,WS-SC)
008976*          DISPLAY "W-DECOR-S -1"W-DECOR-S(W-INDX,WS-SC - 1)
008977           MOVE W-DECOR-S(W-INDX,WS-SC)
008978             TO W-DECOR-S(W-INDX,WS-SC - 1)
008979        END-PERFORM
008980*
008981        SUBTRACT 1           FROM W-INDS2M(W-INDX)
008982        .
008983*
008984*******************
008985 UT-RICALCOLA-TAB-OUT-APP.
008986*******************
008987     MOVE 'UT-RICALCOLA-TAB-OUT-APP ' TO WS-MESSAGGIO
008988     PERFORM TRACCIA
008989*
008990
008991*       DISPLAY "W-INDS-DA(W-INDX)" W-INDS-DA(W-INDX)
008992*       DISPLAY "W-INDS-A(W-INDX) " W-INDS-A(W-INDX)
008993*       DISPLAY "W-INDS-CONTATORE-TOT" W-INDS-CONTATORE-TOT
008994
008995        IF W-INDS-CONTATORE-TOT NOT = ZEROES
008996           COMPUTE W-INDS-DA(W-INDX) =  W-INDS-DA(W-INDX) +
008997                                         W-INDS-CONTATORE-TOT
008998           COMPUTE W-INDS-A(W-INDX) =   W-INDS-A(W-INDX) +
008999                                         W-INDS-CONTATORE-TOT
009000        END-IF
009001*
009002*       DISPLAY "W-INDS-DA(W-INDX)" W-INDS-DA(W-INDX)
009003*       DISPLAY "W-INDS2M(W-INDX) " W-INDS2M(W-INDX)
009004        COMPUTE W-INDS-A-APP = (W-INDS-DA(W-INDX) +
009005                                W-INDS2M(W-INDX) ) - 1
009006*       DISPLAY "W-INDS-A-APP     " W-INDS-A-APP
009007*       DISPLAY "W-INDS-A(W-INDX) " W-INDS-A(W-INDX)
009008        IF W-INDS-A-APP > W-INDS-A(W-INDX)
009009*         DISPLAY "MAGGIORE"
009010          MOVE ZERO              TO W-INDS-CONTATORE
009011          COMPUTE W-INDS-D-APP = W-INDS-A-APP - W-INDS-A(W-INDX)
009012          PERFORM UNTIL W-INDS-CONTATORE = W-INDS-D-APP
009013            PERFORM VARYING WS-SC FROM WS-IND-OUT       BY -1
009014              UNTIL WS-SC < W-INDS-DA(W-INDX)
009015               MOVE WS-TBCDZOUT-OUT(WS-SC)
009016                 TO WS-TBCDZOUT-OUT(WS-SC + 1)
009017            END-PERFORM
009018            ADD  1               TO   WS-IND-OUT
009019            ADD  1               TO   W-INDO
009020            ADD  1               TO   W-INDS-CONTATORE
009021*           DISPLAY "W-INDS-CONTATORE" W-INDS-CONTATORE
009022          END-PERFORM
009023*         DISPLAY "W-INDS-CONTATORE-TOT" W-INDS-CONTATORE-TOT
009024          ADD W-INDS-CONTATORE       TO   W-INDS-CONTATORE-TOT
009025        END-IF
009026        IF W-INDS-A-APP < W-INDS-A(W-INDX)
009027*         DISPLAY "MINORE"
009028          COMPUTE W-INDS-D-APP =  W-INDS-A(W-INDX) - W-INDS-A-APP
009029          PERFORM UNTIL W-INDS-CONTATORE = W-INDS-D-APP
009030            PERFORM VARYING WS-SC FROM W-INDS-A(W-INDX) BY  1
009031              UNTIL WS-SC > WS-IND-OUT
009032               MOVE WS-TBCDZOUT-OUT(WS-SC)
009033                 TO WS-TBCDZOUT-OUT(WS-SC - 1)
009034            END-PERFORM
009035            SUBTRACT 1             FROM WS-IND-OUT
009036            SUBTRACT 1             FROM W-INDO
009037            ADD  1                 TO   W-INDS-CONTATORE
009038*           DISPLAY "W-INDS-CONTATORE   " W-INDS-CONTATORE
009039          END-PERFORM
009040            SUBTRACT W-INDS-CONTATORE  FROM W-INDS-CONTATORE-TOT
009041*           DISPLAY "W-INDS-CONTATORE-TOT" W-INDS-CONTATORE-TOT
009042        END-IF
009043
009044*       IF WS-IND-OUT = WS-IND-MAX
009045*         IF C6SP01A-CDKEYRIP > SPACES
009046*            MOVE "E098" TO C6SP01A-CDESITO
009047*            MOVE "SFONDAMENTO TAB.OUTPUT"
009048*                            TO C6SP01A-DSERTEXT-BREVE
009049*            MOVE "SFONDAMENTO TAB.OUTPUT"
009050*                            TO C6SP01A-DSERTEXT-MEDIO
009051*         ELSE
009052*            MOVE "1" TO C6SP01A-CDUTIRIP-OUT
009053*       END-IF
009054        IF WS-IND-OUT > WS-IND-OUT-MAX
009055             MOVE 'E098' TO C6SP01A-CDESITO
009056             MOVE 'SFONDAMENTO TAB.OUTPUT'
009057                             TO C6SP01A-DSERTEXT-BREVE
009058             MOVE 'SFONDAMENTO TAB.OUTPUT'
009059                             TO C6SP01A-DSERTEXT-MEDIO
009060        END-IF
009061        .
009062*
009063*******************
009064 CARICA-TABOUT.
009065*******************
009066     MOVE 'CARICA-TABOUT ' TO WS-MESSAGGIO
009067     PERFORM TRACCIA
009068*
009069*    MOVE WS-IND-OUT       TO C6SP01A-ELDIMOUT-OUT
009070
009071
009072
009073     PERFORM VARYING W-IND-FIN FROM 1 BY 1
009074       UNTIL W-IND-FIN > WS-IND-OUT
009075
009076        IF C6SP01A-ELDIMOUT-OUT = WS-IND-MAX
009077
009078          IF C6SP01A-CDKEYRIP > SPACES
009079            MOVE 'E098'    TO C6SP01A-CDESITO
009080            MOVE 'SFONDAMENTO TAB.OUTPUT'
009081                           TO C6SP01A-DSERTEXT-BREVE
009082            MOVE 'SFONDAMENTO TAB.OUTPUT'
009083                           TO C6SP01A-DSERTEXT-MEDIO
009084          ELSE
009085            SET WS-SI-FINE-RIPARTENZA TO TRUE
009086          END-IF
009087
009088        ELSE
009089
009090          IF C6SP01A-CDKEYRIP <= SPACES
009091          OR (C6SP01A-CDKEYRIP > SPACES
009092          AND WS-IND-RIP >= WS-IND-MAX)
009093
009094            ADD 1            TO C6SP01A-ELDIMOUT-OUT
009095            MOVE WS-DTINIVAL-OUT(W-IND-FIN)
009096              TO C6SP01A-DTINIVAL-OUT(C6SP01A-ELDIMOUT-OUT)
009097            MOVE WS-DTFINVAL-OUT(W-IND-FIN)
009098              TO C6SP01A-DTFINVAL-OUT(C6SP01A-ELDIMOUT-OUT)
009099            MOVE WS-DSCDZBR-OUT(W-IND-FIN)
009100              TO C6SP01A-DSCDZBR-OUT(C6SP01A-ELDIMOUT-OUT)
009101            MOVE WS-DSLEGBR-OUT(W-IND-FIN)
009102              TO C6SP01A-DSLEGBR-OUT(C6SP01A-ELDIMOUT-OUT)
009103            MOVE WS-NRPRELEM-OUT(W-IND-FIN)
009104              TO C6SP01A-NRPRELEM-OUT(C6SP01A-ELDIMOUT-OUT)
009105            MOVE WS-NRPREGOL-OUT(W-IND-FIN)
009106              TO C6SP01A-NRPREGOL-OUT(C6SP01A-ELDIMOUT-OUT)
009107            MOVE WS-CDNATCDZ-OUT(W-IND-FIN)
009108              TO C6SP01A-CDNATCDZ-OUT(C6SP01A-ELDIMOUT-OUT)
009109            MOVE WS-CDAPPLIV-OUT(W-IND-FIN)
009110              TO C6SP01A-CDAPPLIV-OUT(C6SP01A-ELDIMOUT-OUT)
009111            MOVE WS-CDFORVAL-OUT(W-IND-FIN)
009112              TO C6SP01A-CDFORVAL-OUT(C6SP01A-ELDIMOUT-OUT)
009113            MOVE WS-NMDIMEN-OUT(W-IND-FIN)
009114              TO C6SP01A-NMDIMEN-OUT(C6SP01A-ELDIMOUT-OUT)
009115            MOVE WS-NMDECIMA-OUT(W-IND-FIN)
009116              TO C6SP01A-NMDECIMA-OUT(C6SP01A-ELDIMOUT-OUT)
009117            MOVE WS-DSVAL-OUT   (W-IND-FIN)
009118              TO C6SP01A-DSVAL-OUT   (C6SP01A-ELDIMOUT-OUT)
009119            MOVE WS-NRVAL-OUT   (W-IND-FIN)
009120              TO C6SP01A-NRVAL-OUT   (C6SP01A-ELDIMOUT-OUT)
009121            MOVE WS-NRPRCOMP-OUT(W-IND-FIN)
009122              TO C6SP01A-NRPRCOMP-OUT(C6SP01A-ELDIMOUT-OUT)
009123            MOVE WS-CDINDICE-OUT(W-IND-FIN)
009124              TO C6SP01A-CDINDICE-OUT(C6SP01A-ELDIMOUT-OUT)
009125          ELSE
009126            IF C6SP01A-CDKEYRIP > SPACES
009127              ADD 1             TO WS-IND-RIP
009128            END-IF
009129          END-IF
009130       END-IF
009131     END-PERFORM.
009132
009133     IF WS-SI-FINE-RIPARTENZA
009134        MOVE '1' TO C6SP01A-CDUTIRIP-OUT
009135     END-IF.
009136
009137*********
009138 TRACCIA.
009139*********
009140*    DISPLAY WS-MESSAGGIO.
009141     .
009142*
009143************
009144 ERRORE-SQL.
009145************
009146     MOVE ALL '9'                  TO C6SP01A-CDESITO
009147     MOVE SQLCODE                  TO WS-SQLCOD
009148     INSPECT SQLERRMC REPLACING ALL HIGH-VALUES BY SPACES
009149     MOVE SQLERRMC                 TO WS-SQLERRMC
009150     MOVE WS-ERMSG(1:14)           TO C6SP01A-DSERTEXT-BREVE
009151     MOVE WS-ERMSG                 TO C6SP01A-DSERTEXT-MEDIO
009152     GOBACK.
009153
