008985 UT-RICALCOLA-TAB-OUT-APP.
008987     MOVE 'UT-RICALCOLA-TAB-OUT-APP ' TO WS-MESSAGGIO
008988     PERFORM TRACCIA
008990
008994
008995        IF W-INDS-CONTATORE-TOT NOT = ZEROES
008996           COMPUTE W-INDS-DA(W-INDX) =  W-INDS-DA(W-INDX) +
008997                                         W-INDS-CONTATORE-TOT
008998           COMPUTE W-INDS-A(W-INDX) =   W-INDS-A(W-INDX) +
008999                                         W-INDS-CONTATORE-TOT
009000        END-IF
009004        COMPUTE W-INDS-A-APP = (W-INDS-DA(W-INDX) +
009005                                W-INDS2M(W-INDX) ) - 1
009008        IF W-INDS-A-APP > W-INDS-A(W-INDX)
009010          MOVE ZERO              TO W-INDS-CONTATORE
009011          COMPUTE W-INDS-D-APP = W-INDS-A-APP - W-INDS-A(W-INDX)
009012          PERFORM UNTIL W-INDS-CONTATORE = W-INDS-D-APP
009013            PERFORM VARYING WS-SC FROM WS-IND-OUT       BY -1
009014              UNTIL WS-SC < W-INDS-DA(W-INDX)
009015               MOVE WS-TBCDZOUT-OUT(WS-SC)
009016                 TO WS-TBCDZOUT-OUT(WS-SC + 1)
009017            END-PERFORM
009018            ADD  1               TO   WS-IND-OUT
009019            ADD  1               TO   W-INDO
009020            ADD  1               TO   W-INDS-CONTATORE
009022          END-PERFORM
009024          ADD W-INDS-CONTATORE       TO   W-INDS-CONTATORE-TOT
009025        END-IF
009026        IF W-INDS-A-APP < W-INDS-A(W-INDX)
009028          COMPUTE W-INDS-D-APP =  W-INDS-A(W-INDX) - W-INDS-A-APP
009029          PERFORM UNTIL W-INDS-CONTATORE = W-INDS-D-APP
009030            PERFORM VARYING WS-SC FROM W-INDS-A(W-INDX) BY  1
009031              UNTIL WS-SC > WS-IND-OUT
009032               MOVE WS-TBCDZOUT-OUT(WS-SC)
009033                 TO WS-TBCDZOUT-OUT(WS-SC - 1)
009034            END-PERFORM
009035            SUBTRACT 1             FROM WS-IND-OUT
009036            SUBTRACT 1             FROM W-INDO
009037            ADD  1                 TO   W-INDS-CONTATORE
009039          END-PERFORM
009040            SUBTRACT W-INDS-CONTATORE  FROM W-INDS-CONTATORE-TOT
009042        END-IF
009043
009054        IF WS-IND-OUT > WS-IND-OUT-MAX
009055             MOVE 'E098' TO C6SP01A-CDESITO
009056             MOVE 'SFONDAMENTO TAB.OUTPUT'
009057                             TO C6SP01A-DSERTEXT-BREVE
009058             MOVE 'SFONDAMENTO TAB.OUTPUT'
009059                             TO C6SP01A-DSERTEXT-MEDIO
009060        END-IF
009061        .
